/* automatically generated by rust-bindgen */

use drogue_ffi_compat::va_list as __va_list;

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage, Align> {
    storage: Storage,
    align: [Align; 0],
}
impl<Storage, Align> __BindgenBitfieldUnit<Storage, Align> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage, align: [] }
    }
}
impl<Storage, Align> __BindgenBitfieldUnit<Storage, Align>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn set_bit(&mut self, index: usize, val: bool) {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = &mut self.storage.as_mut()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        if val {
            *byte |= mask;
        } else {
            *byte &= !mask;
        }
    }
    #[inline]

pub const ERR_DES_INVALID_INPUT_LENGTH: i32 = -50;
pub const ERR_DES_HW_ACCEL_FAILED: i32 = -51;
pub const DES_KEY_SIZE: u32 = 8;
pub const GCM_ENCRYPT: u32 = 1;
pub const GCM_DECRYPT: u32 = 0;
pub const ERR_GCM_AUTH_FAILED: i32 = -18;
pub const ERR_GCM_HW_ACCEL_FAILED: i32 = -19;
pub const ERR_GCM_BAD_INPUT: i32 = -20;
pub const ERR_HKDF_BAD_INPUT_DATA: i32 = -24448;
pub const ERR_MD2_HW_ACCEL_FAILED: i32 = -43;
pub const ERR_MD4_HW_ACCEL_FAILED: i32 = -45;
pub const ERR_PKCS5_BAD_INPUT_DATA: i32 = -12160;
pub const ERR_PKCS5_INVALID_FORMAT: i32 = -12032;
pub const ERR_PKCS5_FEATURE_UNAVAILABLE: i32 = -11904;
pub const ERR_PKCS5_PASSWORD_MISMATCH: i32 = -11776;
pub const PKCS5_DECRYPT: u32 = 0;
pub const PKCS5_ENCRYPT: u32 = 1;
pub const ERR_PKCS12_BAD_INPUT_DATA: i32 = -8064;
pub const ERR_PKCS12_FEATURE_UNAVAILABLE: i32 = -7936;
pub const ERR_PKCS12_PBE_INVALID_FORMAT: i32 = -7808;
pub const ERR_PKCS12_PASSWORD_MISMATCH: i32 = -7680;
pub const PKCS12_DERIVE_KEY: u32 = 1;
pub const PKCS12_DERIVE_IV: u32 = 2;
pub const PKCS12_DERIVE_MAC_KEY: u32 = 3;
pub const PKCS12_PBE_DECRYPT: u32 = 0;
pub const PKCS12_PBE_ENCRYPT: u32 = 1;
pub const ERR_RIPEMD160_HW_ACCEL_FAILED: i32 = -49;
pub const XTEA_ENCRYPT: u32 = 1;
pub const XTEA_DECRYPT: u32 = 0;
pub const ERR_XTEA_INVALID_INPUT_LENGTH: i32 = -40;
pub const ERR_XTEA_HW_ACCEL_FAILED: i32 = -41;
pub const ERR_ENTROPY_SOURCE_FAILED: i32 = -60;
pub const ERR_ENTROPY_MAX_SOURCES: i32 = -62;
pub const ERR_ENTROPY_NO_SOURCES_DEFINED: i32 = -64;
pub const ERR_ENTROPY_NO_STRONG_SOURCE: i32 = -61;
pub const ERR_ENTROPY_FILE_IO_ERROR: i32 = -63;
pub const ENTROPY_MAX_SOURCES: u32 = 20;
pub const ENTROPY_MAX_GATHER: u32 = 128;
pub const ENTROPY_BLOCK_SIZE: u32 = 64;
pub const ENTROPY_MAX_SEED_SIZE: u32 = 1024;
pub const ENTROPY_SOURCE_MANUAL: u32 = 20;
pub const ENTROPY_SOURCE_STRONG: u32 = 1;
pub const ENTROPY_SOURCE_WEAK: u32 = 0;
pub const ERR_CTR_DRBG_ENTROPY_SOURCE_FAILED: i32 = -52;
pub const ERR_CTR_DRBG_REQUEST_TOO_BIG: i32 = -54;
pub const ERR_CTR_DRBG_INPUT_TOO_BIG: i32 = -56;
pub const ERR_CTR_DRBG_FILE_IO_ERROR: i32 = -58;
pub const CTR_DRBG_BLOCKSIZE: u32 = 16;
pub const CTR_DRBG_KEYSIZE: u32 = 32;
pub const CTR_DRBG_KEYBITS: u32 = 256;
pub const CTR_DRBG_SEEDLEN: u32 = 48;
pub const CTR_DRBG_ENTROPY_LEN: u32 = 48;
pub const CTR_DRBG_RESEED_INTERVAL: u32 = 10000;
pub const CTR_DRBG_MAX_INPUT: u32 = 256;
pub const CTR_DRBG_MAX_REQUEST: u32 = 1024;
pub const CTR_DRBG_MAX_SEED_INPUT: u32 = 384;
pub const CTR_DRBG_PR_OFF: u32 = 0;
pub const CTR_DRBG_PR_ON: u32 = 1;
pub const CTR_DRBG_ENTROPY_NONCE_LEN: u32 = 0;
pub type iso_c_forbids_empty_translation_units = crate::types::c_int;
pub type wchar_t = crate::types::c_uint;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: crate::types::c_longlong,
    pub __clang_max_align_nonce2: f64,
}
#[test]
fn bindgen_test_layout_max_align_t() {
    assert_eq!(
        ::core::mem::size_of::<max_align_t>(),
        16usize,
        concat!("Size of: ", stringify!(max_align_t))
    );
    assert_eq!(
        ::core::mem::align_of::<max_align_t>(),
        8usize,
        concat!("Alignment of ", stringify!(max_align_t))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<max_align_t>())).__clang_max_align_nonce1 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<max_align_t>())).__clang_max_align_nonce2 as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce2)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}mbedtls_calloc"]
    pub fn calloc(n: usize, size: usize) -> *mut crate::types::c_void;
}
extern "C" {
    #[link_name = "\u{1}mbedtls_free"]
    pub fn free(ptr: *mut crate::types::c_void);
}
extern "C" {
    #[doc = " \\brief               This function dynamically sets the memory-management"]
    #[doc = "                      functions used by the library, during runtime."]
    #[doc = ""]
    #[doc = " \\param calloc_func   The \\c calloc function implementation."]
    #[doc = " \\param free_func     The \\c free function implementation."]
    #[doc = ""]
    #[doc = " \\return              \\c 0."]
    #[link_name = "\u{1}mbedtls_platform_set_calloc_free"]
    pub fn platform_set_calloc_free(
        calloc_func: ::core::option::Option<
            unsafe extern "C" fn(arg1: usize, arg2: usize) -> *mut crate::types::c_void,
        >,
        free_func: ::core::option::Option<unsafe extern "C" fn(arg1: *mut crate::types::c_void)>,
    ) -> crate::types::c_int;
}
extern "C" {
    #[link_name = "\u{1}mbedtls_printf"]
    pub static mut printf: ::core::option::Option<
        unsafe extern "C" fn(format: *const crate::types::c_char, ...) -> crate::types::c_int,
    >;
}
extern "C" {
    #[doc = " \\brief               This function dynamically configures the snprintf"]
    #[doc = "                      function that is called when the mbedtls_snprintf()"]
    #[doc = "                      function is invoked by the library."]
    #[doc = ""]
    #[doc = " \\param printf_func   The \\c printf function implementation."]
    #[doc = ""]
    #[doc = " \\return              \\c 0 on success."]
    #[link_name = "\u{1}mbedtls_platform_set_printf"]
    pub fn platform_set_printf(
        printf_func: ::core::option::Option<
            unsafe extern "C" fn(arg1: *const crate::types::c_char, ...) -> crate::types::c_int,
        >,
    ) -> crate::types::c_int;
}
extern "C" {
    #[link_name = "\u{1}mbedtls_snprintf"]
    pub static mut snprintf: ::core::option::Option<
        unsafe extern "C" fn(
            s: *mut crate::types::c_char,
            n: usize,
            format: *const crate::types::c_char,
            ...
        ) -> crate::types::c_int,
    >;
}
extern "C" {
    #[doc = " \\brief                 This function allows configuring a custom"]
    #[doc = "                        \\c snprintf function pointer."]
    #[doc = ""]
    #[doc = " \\param snprintf_func   The \\c snprintf function implementation."]
    #[doc = ""]
    #[doc = " \\return                \\c 0 on success."]
    #[link_name = "\u{1}mbedtls_platform_set_snprintf"]
    pub fn platform_set_snprintf(
        snprintf_func: ::core::option::Option<
            unsafe extern "C" fn(
                s: *mut crate::types::c_char,
                n: usize,
                format: *const crate::types::c_char,
                ...
            ) -> crate::types::c_int,
        >,
    ) -> crate::types::c_int;
}
pub type va_list = __builtin_va_list;
pub type __gnuc_va_list = __builtin_va_list;
extern "C" {
    #[link_name = "\u{1}mbedtls_vsnprintf"]
    pub static mut vsnprintf: ::core::option::Option<
        unsafe extern "C" fn(
            s: *mut crate::types::c_char,
            n: usize,
            format: *const crate::types::c_char,
            arg: va_list,
        ) -> crate::types::c_int,
    >;
}
extern "C" {
    #[doc = " \\brief   Set your own snprintf function pointer"]
    #[doc = ""]
    #[doc = " \\param   vsnprintf_func   The \\c vsnprintf function implementation"]
    #[doc = ""]
    #[doc = " \\return  \\c 0"]
    #[link_name = "\u{1}mbedtls_platform_set_vsnprintf"]
    pub fn platform_set_vsnprintf(
        vsnprintf_func: ::core::option::Option<
            unsafe extern "C" fn(
                s: *mut crate::types::c_char,
                n: usize,
                format: *const crate::types::c_char,
                arg: va_list,
            ) -> crate::types::c_int,
        >,
    ) -> crate::types::c_int;
}
#[doc = " \\brief   The platform context structure."]
#[doc = ""]
#[doc = " \\note    This structure may be used to assist platform-specific"]
#[doc = "          setup or teardown operations."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct platform_context {
    #[doc = "< A placeholder member, as empty structs are not portable."]
    pub dummy: crate::types::c_char,
}
#[test]
fn bindgen_test_layout_platform_context() {
    assert_eq!(
        ::core::mem::size_of::<platform_context>(),
        1usize,
        concat!("Size of: ", stringify!(platform_context))
    );
    assert_eq!(
        ::core::mem::align_of::<platform_context>(),
        1usize,
        concat!("Alignment of ", stringify!(platform_context))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<platform_context>())).dummy as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(platform_context),
            "::",
            stringify!(dummy)
        )
    );
}
extern "C" {
    #[doc = " \\brief   This function performs any platform-specific initialization"]
    #[doc = "          operations."]
    #[doc = ""]
    #[doc = " \\note    This function should be called before any other library functions."]
    #[doc = ""]
    #[doc = "          Its implementation is platform-specific, and unless"]
    #[doc = "          platform-specific code is provided, it does nothing."]
    #[doc = ""]
    #[doc = " \\note    The usage and necessity of this function is dependent on the platform."]
    #[doc = ""]
    #[doc = " \\param   ctx     The platform context."]
    #[doc = ""]
    #[doc = " \\return  \\c 0 on success."]
    #[link_name = "\u{1}mbedtls_platform_setup"]
    pub fn platform_setup(ctx: *mut platform_context) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief   This function performs any platform teardown operations."]
    #[doc = ""]
    #[doc = " \\note    This function should be called after every other Mbed TLS module"]
    #[doc = "          has been correctly freed using the appropriate free function."]
    #[doc = ""]
    #[doc = "          Its implementation is platform-specific, and unless"]
    #[doc = "          platform-specific code is provided, it does nothing."]
    #[doc = ""]
    #[doc = " \\note    The usage and necessity of this function is dependent on the platform."]
    #[doc = ""]
    #[doc = " \\param   ctx     The platform context."]
    #[doc = ""]
    #[link_name = "\u{1}mbedtls_platform_teardown"]
    pub fn platform_teardown(ctx: *mut platform_context);
}
pub type int_least64_t = i64;
pub type uint_least64_t = u64;
pub type int_fast64_t = i64;
pub type uint_fast64_t = u64;
pub type int_least32_t = i32;
pub type uint_least32_t = u32;
pub type int_fast32_t = i32;
pub type uint_fast32_t = u32;
pub type int_least16_t = i16;
pub type uint_least16_t = u16;
pub type int_fast16_t = i16;
pub type uint_fast16_t = u16;
pub type int_least8_t = i8;
pub type uint_least8_t = u8;
pub type int_fast8_t = i8;
pub type uint_fast8_t = u8;
pub type intmax_t = crate::types::c_longlong;
pub type uintmax_t = crate::types::c_ulonglong;
pub type mpi_sint = i32;
pub type mpi_uint = u32;
pub type t_udbl = u64;
#[doc = " \\brief          MPI structure"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mpi {
    #[doc = "<  Sign: -1 if the mpi is negative, 1 otherwise"]
    pub s: crate::types::c_int,
    #[doc = "<  total # of limbs"]
    pub n: usize,
    #[doc = "<  pointer to limbs"]
    pub p: *mut mpi_uint,
}
#[test]
fn bindgen_test_layout_mpi() {
    assert_eq!(
        ::core::mem::size_of::<mpi>(),
        12usize,
        concat!("Size of: ", stringify!(mpi))
    );
    assert_eq!(
        ::core::mem::align_of::<mpi>(),
        4usize,
        concat!("Alignment of ", stringify!(mpi))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<mpi>())).s as *const _ as usize },
        0usize,
        concat!("Offset of field: ", stringify!(mpi), "::", stringify!(s))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<mpi>())).n as *const _ as usize },
        4usize,
        concat!("Offset of field: ", stringify!(mpi), "::", stringify!(n))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<mpi>())).p as *const _ as usize },
        8usize,
        concat!("Offset of field: ", stringify!(mpi), "::", stringify!(p))
    );
}
impl Default for mpi {
    fn default() -> Self {
        unsafe { ::core::mem::zeroed() }
    }
}
extern "C" {
    #[doc = " \\brief           Initialize an MPI context."]
    #[doc = ""]
    #[doc = "                  This makes the MPI ready to be set or freed,"]
    #[doc = "                  but does not define a value for the MPI."]
    #[doc = ""]
    #[doc = " \\param X         The MPI context to initialize. This must not be \\c NULL."]
    #[link_name = "\u{1}mbedtls_mpi_init"]
    pub fn mpi_init(X: *mut mpi);
}
extern "C" {
    #[doc = " \\brief          This function frees the components of an MPI context."]
    #[doc = ""]
    #[doc = " \\param X        The MPI context to be cleared. This may be \\c NULL,"]
    #[doc = "                 in which case this function is a no-op. If it is"]
    #[doc = "                 not \\c NULL, it must point to an initialized MPI."]
    #[link_name = "\u{1}mbedtls_mpi_free"]
    pub fn mpi_free(X: *mut mpi);
}
extern "C" {
    #[doc = " \\brief          Enlarge an MPI to the specified number of limbs."]
    #[doc = ""]
    #[doc = " \\note           This function does nothing if the MPI is"]
    #[doc = "                 already large enough."]
    #[doc = ""]
    #[doc = " \\param X        The MPI to grow. It must be initialized."]
    #[doc = " \\param nblimbs  The target number of limbs."]
    #[doc = ""]
    #[doc = " \\return         \\c 0 if successful."]
    #[doc = " \\return         #MBEDTLS_ERR_MPI_ALLOC_FAILED if memory allocation failed."]
    #[doc = " \\return         Another negative error code on other kinds of failure."]
    #[link_name = "\u{1}mbedtls_mpi_grow"]
    pub fn mpi_grow(X: *mut mpi, nblimbs: usize) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief          This function resizes an MPI downwards, keeping at least the"]
    #[doc = "                 specified number of limbs."]
    #[doc = ""]
    #[doc = "                 If \\c X is smaller than \\c nblimbs, it is resized up"]
    #[doc = "                 instead."]
    #[doc = ""]
    #[doc = " \\param X        The MPI to shrink. This must point to an initialized MPI."]
    #[doc = " \\param nblimbs  The minimum number of limbs to keep."]
    #[doc = ""]
    #[doc = " \\return         \\c 0 if successful."]
    #[doc = " \\return         #MBEDTLS_ERR_MPI_ALLOC_FAILED if memory allocation failed"]
    #[doc = "                 (this can only happen when resizing up)."]
    #[doc = " \\return         Another negative error code on other kinds of failure."]
    #[link_name = "\u{1}mbedtls_mpi_shrink"]
    pub fn mpi_shrink(X: *mut mpi, nblimbs: usize) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief          Make a copy of an MPI."]
    #[doc = ""]
    #[doc = " \\param X        The destination MPI. This must point to an initialized MPI."]
    #[doc = " \\param Y        The source MPI. This must point to an initialized MPI."]
    #[doc = ""]
    #[doc = " \\note           The limb-buffer in the destination MPI is enlarged"]
    #[doc = "                 if necessary to hold the value in the source MPI."]
    #[doc = ""]
    #[doc = " \\return         \\c 0 if successful."]
    #[doc = " \\return         #MBEDTLS_ERR_MPI_ALLOC_FAILED if memory allocation failed."]
    #[doc = " \\return         Another negative error code on other kinds of failure."]
    #[link_name = "\u{1}mbedtls_mpi_copy"]
    pub fn mpi_copy(X: *mut mpi, Y: *const mpi) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief          Swap the contents of two MPIs."]
    #[doc = ""]
    #[doc = " \\param X        The first MPI. It must be initialized."]
    #[doc = " \\param Y        The second MPI. It must be initialized."]
    #[link_name = "\u{1}mbedtls_mpi_swap"]
    pub fn mpi_swap(X: *mut mpi, Y: *mut mpi);
}
extern "C" {
    #[doc = " \\brief          Perform a safe conditional copy of MPI which doesn't"]
    #[doc = "                 reveal whether the condition was true or not."]
    #[doc = ""]
    #[doc = " \\param X        The MPI to conditionally assign to. This must point"]
    #[doc = "                 to an initialized MPI."]
    #[doc = " \\param Y        The MPI to be assigned from. This must point to an"]
    #[doc = "                 initialized MPI."]
    #[doc = " \\param assign   The condition deciding whether to perform the"]
    #[doc = "                 assignment or not. Possible values:"]
    #[doc = "                 * \\c 1: Perform the assignment `X = Y`."]
    #[doc = "                 * \\c 0: Keep the original value of \\p X."]
    #[doc = ""]
    #[doc = " \\note           This function is equivalent to"]
    #[doc = "                      `if( assign ) mbedtls_mpi_copy( X, Y );`"]
    #[doc = "                 except that it avoids leaking any information about whether"]
    #[doc = "                 the assignment was done or not (the above code may leak"]
    #[doc = "                 information through branch prediction and/or memory access"]
    #[doc = "                 patterns analysis)."]
    #[doc = ""]
    #[doc = " \\return         \\c 0 if successful."]
    #[doc = " \\return         #MBEDTLS_ERR_MPI_ALLOC_FAILED if memory allocation failed."]
    #[doc = " \\return         Another negative error code on other kinds of failure."]
    #[link_name = "\u{1}mbedtls_mpi_safe_cond_assign"]
    pub fn mpi_safe_cond_assign(
        X: *mut mpi,
        Y: *const mpi,
        assign: crate::types::c_uchar,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief          Perform a safe conditional swap which doesn't"]
    #[doc = "                 reveal whether the condition was true or not."]
    #[doc = ""]
    #[doc = " \\param X        The first MPI. This must be initialized."]
    #[doc = " \\param Y        The second MPI. This must be initialized."]
    #[doc = " \\param assign   The condition deciding whether to perform"]
    #[doc = "                 the swap or not. Possible values:"]
    #[doc = "                 * \\c 1: Swap the values of \\p X and \\p Y."]
    #[doc = "                 * \\c 0: Keep the original values of \\p X and \\p Y."]
    #[doc = ""]
    #[doc = " \\note           This function is equivalent to"]
    #[doc = "                      if( assign ) mbedtls_mpi_swap( X, Y );"]
    #[doc = "                 except that it avoids leaking any information about whether"]
    #[doc = "                 the assignment was done or not (the above code may leak"]
    #[doc = "                 information through branch prediction and/or memory access"]
    #[doc = "                 patterns analysis)."]
    #[doc = ""]
    #[doc = " \\return         \\c 0 if successful."]
    #[doc = " \\return         #MBEDTLS_ERR_MPI_ALLOC_FAILED if memory allocation failed."]
    #[doc = " \\return         Another negative error code on other kinds of failure."]
    #[doc = ""]
    #[link_name = "\u{1}mbedtls_mpi_safe_cond_swap"]
    pub fn mpi_safe_cond_swap(
        X: *mut mpi,
        Y: *mut mpi,
        assign: crate::types::c_uchar,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief          Store integer value in MPI."]
    #[doc = ""]
    #[doc = " \\param X        The MPI to set. This must be initialized."]
    #[doc = " \\param z        The value to use."]
    #[doc = ""]
    #[doc = " \\return         \\c 0 if successful."]
    #[doc = " \\return         #MBEDTLS_ERR_MPI_ALLOC_FAILED if memory allocation failed."]
    #[doc = " \\return         Another negative error code on other kinds of failure."]
    #[link_name = "\u{1}mbedtls_mpi_lset"]
    pub fn mpi_lset(X: *mut mpi, z: mpi_sint) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief          Get a specific bit from an MPI."]
    #[doc = ""]
    #[doc = " \\param X        The MPI to query. This must be initialized."]
    #[doc = " \\param pos      Zero-based index of the bit to query."]
    #[doc = ""]
    #[doc = " \\return         \\c 0 or \\c 1 on success, depending on whether bit \\c pos"]
    #[doc = "                 of \\c X is unset or set."]
    #[doc = " \\return         A negative error code on failure."]
    #[link_name = "\u{1}mbedtls_mpi_get_bit"]
    pub fn mpi_get_bit(X: *const mpi, pos: usize) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief          Modify a specific bit in an MPI."]
    #[doc = ""]
    #[doc = " \\note           This function will grow the target MPI if necessary to set a"]
    #[doc = "                 bit to \\c 1 in a not yet existing limb. It will not grow if"]
    #[doc = "                 the bit should be set to \\c 0."]
    #[doc = ""]
    #[doc = " \\param X        The MPI to modify. This must be initialized."]
    #[doc = " \\param pos      Zero-based index of the bit to modify."]
    #[doc = " \\param val      The desired value of bit \\c pos: \\c 0 or \\c 1."]
    #[doc = ""]
    #[doc = " \\return         \\c 0 if successful."]
    #[doc = " \\return         #MBEDTLS_ERR_MPI_ALLOC_FAILED if memory allocation failed."]
    #[doc = " \\return         Another negative error code on other kinds of failure."]
    #[link_name = "\u{1}mbedtls_mpi_set_bit"]
    pub fn mpi_set_bit(X: *mut mpi, pos: usize, val: crate::types::c_uchar) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief          Return the number of bits of value \\c 0 before the"]
    #[doc = "                 least significant bit of value \\c 1."]
    #[doc = ""]
    #[doc = " \\note           This is the same as the zero-based index of"]
    #[doc = "                 the least significant bit of value \\c 1."]
    #[doc = ""]
    #[doc = " \\param X        The MPI to query."]
    #[doc = ""]
    #[doc = " \\return         The number of bits of value \\c 0 before the least significant"]
    #[doc = "                 bit of value \\c 1 in \\p X."]
    #[link_name = "\u{1}mbedtls_mpi_lsb"]
    pub fn mpi_lsb(X: *const mpi) -> usize;
}
extern "C" {
    #[doc = " \\brief          Return the number of bits up to and including the most"]
    #[doc = "                 significant bit of value \\c 1."]
    #[doc = ""]
    #[doc = " * \\note         This is same as the one-based index of the most"]
    #[doc = "                 significant bit of value \\c 1."]
    #[doc = ""]
    #[doc = " \\param X        The MPI to query. This must point to an initialized MPI."]
    #[doc = ""]
    #[doc = " \\return         The number of bits up to and including the most"]
    #[doc = "                 significant bit of value \\c 1."]
    #[link_name = "\u{1}mbedtls_mpi_bitlen"]
    pub fn mpi_bitlen(X: *const mpi) -> usize;
}
extern "C" {
    #[doc = " \\brief          Return the total size of an MPI value in bytes."]
    #[doc = ""]
    #[doc = " \\param X        The MPI to use. This must point to an initialized MPI."]
    #[doc = ""]
    #[doc = " \\note           The value returned by this function may be less than"]
    #[doc = "                 the number of bytes used to store \\p X internally."]
    #[doc = "                 This happens if and only if there are trailing bytes"]
    #[doc = "                 of value zero."]
    #[doc = ""]
    #[doc = " \\return         The least number of bytes capable of storing"]
    #[doc = "                 the absolute value of \\p X."]
    #[link_name = "\u{1}mbedtls_mpi_size"]
    pub fn mpi_size(X: *const mpi) -> usize;
}
extern "C" {
    #[doc = " \\brief          Import an MPI from an ASCII string."]
    #[doc = ""]
    #[doc = " \\param X        The destination MPI. This must point to an initialized MPI."]
    #[doc = " \\param radix    The numeric base of the input string."]
    #[doc = " \\param s        Null-terminated string buffer."]
    #[doc = ""]
    #[doc = " \\return         \\c 0 if successful."]
    #[doc = " \\return         A negative error code on failure."]
    #[link_name = "\u{1}mbedtls_mpi_read_string"]
    pub fn mpi_read_string(
        X: *mut mpi,
        radix: crate::types::c_int,
        s: *const crate::types::c_char,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief          Export an MPI to an ASCII string."]
    #[doc = ""]
    #[doc = " \\param X        The source MPI. This must point to an initialized MPI."]
    #[doc = " \\param radix    The numeric base of the output string."]
    #[doc = " \\param buf      The buffer to write the string to. This must be writable"]
    #[doc = "                 buffer of length \\p buflen Bytes."]
    #[doc = " \\param buflen   The available size in Bytes of \\p buf."]
    #[doc = " \\param olen     The address at which to store the length of the string"]
    #[doc = "                 written, including the  final \\c NULL byte. This must"]
    #[doc = "                 not be \\c NULL."]
    #[doc = ""]
    #[doc = " \\note           You can call this function with `buflen == 0` to obtain the"]
    #[doc = "                 minimum required buffer size in `*olen`."]
    #[doc = ""]
    #[doc = " \\return         \\c 0 if successful."]
    #[doc = " \\return         #MBEDTLS_ERR_MPI_BUFFER_TOO_SMALL if the target buffer \\p buf"]
    #[doc = "                 is too small to hold the value of \\p X in the desired base."]
    #[doc = "                 In this case, `*olen` is nonetheless updated to contain the"]
    #[doc = "                 size of \\p buf required for a successful call."]
    #[doc = " \\return         Another negative error code on different kinds of failure."]
    #[link_name = "\u{1}mbedtls_mpi_write_string"]
    pub fn mpi_write_string(
        X: *const mpi,
        radix: crate::types::c_int,
        buf: *mut crate::types::c_char,
        buflen: usize,
        olen: *mut usize,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief          Import an MPI from unsigned big endian binary data."]
    #[doc = ""]
    #[doc = " \\param X        The destination MPI. This must point to an initialized MPI."]
    #[doc = " \\param buf      The input buffer. This must be a readable buffer of length"]
    #[doc = "                 \\p buflen Bytes."]
    #[doc = " \\param buflen   The length of the input buffer \\p p in Bytes."]
    #[doc = ""]
    #[doc = " \\return         \\c 0 if successful."]
    #[doc = " \\return         #MBEDTLS_ERR_MPI_ALLOC_FAILED if memory allocation failed."]
    #[doc = " \\return         Another negative error code on different kinds of failure."]
    #[link_name = "\u{1}mbedtls_mpi_read_binary"]
    pub fn mpi_read_binary(
        X: *mut mpi,
        buf: *const crate::types::c_uchar,
        buflen: usize,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief          Import X from unsigned binary data, little endian"]
    #[doc = ""]
    #[doc = " \\param X        The destination MPI. This must point to an initialized MPI."]
    #[doc = " \\param buf      The input buffer. This must be a readable buffer of length"]
    #[doc = "                 \\p buflen Bytes."]
    #[doc = " \\param buflen   The length of the input buffer \\p p in Bytes."]
    #[doc = ""]
    #[doc = " \\return         \\c 0 if successful."]
    #[doc = " \\return         #MBEDTLS_ERR_MPI_ALLOC_FAILED if memory allocation failed."]
    #[doc = " \\return         Another negative error code on different kinds of failure."]
    #[link_name = "\u{1}mbedtls_mpi_read_binary_le"]
    pub fn mpi_read_binary_le(
        X: *mut mpi,
        buf: *const crate::types::c_uchar,
        buflen: usize,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief          Export X into unsigned binary data, big endian."]
    #[doc = "                 Always fills the whole buffer, which will start with zeros"]
    #[doc = "                 if the number is smaller."]
    #[doc = ""]
    #[doc = " \\param X        The source MPI. This must point to an initialized MPI."]
    #[doc = " \\param buf      The output buffer. This must be a writable buffer of length"]
    #[doc = "                 \\p buflen Bytes."]
    #[doc = " \\param buflen   The size of the output buffer \\p buf in Bytes."]
    #[doc = ""]
    #[doc = " \\return         \\c 0 if successful."]
    #[doc = " \\return         #MBEDTLS_ERR_MPI_BUFFER_TOO_SMALL if \\p buf isn't"]
    #[doc = "                 large enough to hold the value of \\p X."]
    #[doc = " \\return         Another negative error code on different kinds of failure."]
    #[link_name = "\u{1}mbedtls_mpi_write_binary"]
    pub fn mpi_write_binary(
        X: *const mpi,
        buf: *mut crate::types::c_uchar,
        buflen: usize,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief          Export X into unsigned binary data, little endian."]
    #[doc = "                 Always fills the whole buffer, which will end with zeros"]
    #[doc = "                 if the number is smaller."]
    #[doc = ""]
    #[doc = " \\param X        The source MPI. This must point to an initialized MPI."]
    #[doc = " \\param buf      The output buffer. This must be a writable buffer of length"]
    #[doc = "                 \\p buflen Bytes."]
    #[doc = " \\param buflen   The size of the output buffer \\p buf in Bytes."]
    #[doc = ""]
    #[doc = " \\return         \\c 0 if successful."]
    #[doc = " \\return         #MBEDTLS_ERR_MPI_BUFFER_TOO_SMALL if \\p buf isn't"]
    #[doc = "                 large enough to hold the value of \\p X."]
    #[doc = " \\return         Another negative error code on different kinds of failure."]
    #[link_name = "\u{1}mbedtls_mpi_write_binary_le"]
    pub fn mpi_write_binary_le(
        X: *const mpi,
        buf: *mut crate::types::c_uchar,
        buflen: usize,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief          Perform a left-shift on an MPI: X <<= count"]
    #[doc = ""]
    #[doc = " \\param X        The MPI to shift. This must point to an initialized MPI."]
    #[doc = " \\param count    The number of bits to shift by."]
    #[doc = ""]
    #[doc = " \\return         \\c 0 if successful."]
    #[doc = " \\return         #MBEDTLS_ERR_MPI_ALLOC_FAILED if a memory allocation failed."]
    #[doc = " \\return         Another negative error code on different kinds of failure."]
    #[link_name = "\u{1}mbedtls_mpi_shift_l"]
    pub fn mpi_shift_l(X: *mut mpi, count: usize) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief          Perform a right-shift on an MPI: X >>= count"]
    #[doc = ""]
    #[doc = " \\param X        The MPI to shift. This must point to an initialized MPI."]
    #[doc = " \\param count    The number of bits to shift by."]
    #[doc = ""]
    #[doc = " \\return         \\c 0 if successful."]
    #[doc = " \\return         #MBEDTLS_ERR_MPI_ALLOC_FAILED if a memory allocation failed."]
    #[doc = " \\return         Another negative error code on different kinds of failure."]
    #[link_name = "\u{1}mbedtls_mpi_shift_r"]
    pub fn mpi_shift_r(X: *mut mpi, count: usize) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief          Compare the absolute values of two MPIs."]
    #[doc = ""]
    #[doc = " \\param X        The left-hand MPI. This must point to an initialized MPI."]
    #[doc = " \\param Y        The right-hand MPI. This must point to an initialized MPI."]
    #[doc = ""]
    #[doc = " \\return         \\c 1 if `|X|` is greater than `|Y|`."]
    #[doc = " \\return         \\c -1 if `|X|` is lesser than `|Y|`."]
    #[doc = " \\return         \\c 0 if `|X|` is equal to `|Y|`."]
    #[link_name = "\u{1}mbedtls_mpi_cmp_abs"]
    pub fn mpi_cmp_abs(X: *const mpi, Y: *const mpi) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief          Compare two MPIs."]
    #[doc = ""]
    #[doc = " \\param X        The left-hand MPI. This must point to an initialized MPI."]
    #[doc = " \\param Y        The right-hand MPI. This must point to an initialized MPI."]
    #[doc = ""]
    #[doc = " \\return         \\c 1 if \\p X is greater than \\p Y."]
    #[doc = " \\return         \\c -1 if \\p X is lesser than \\p Y."]
    #[doc = " \\return         \\c 0 if \\p X is equal to \\p Y."]
    #[link_name = "\u{1}mbedtls_mpi_cmp_mpi"]
    pub fn mpi_cmp_mpi(X: *const mpi, Y: *const mpi) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief          Check if an MPI is less than the other in constant time."]
    #[doc = ""]
    #[doc = " \\param X        The left-hand MPI. This must point to an initialized MPI"]
    #[doc = "                 with the same allocated length as Y."]
    #[doc = " \\param Y        The right-hand MPI. This must point to an initialized MPI"]
    #[doc = "                 with the same allocated length as X."]
    #[doc = " \\param ret      The result of the comparison:"]
    #[doc = "                 \\c 1 if \\p X is less than \\p Y."]
    #[doc = "                 \\c 0 if \\p X is greater than or equal to \\p Y."]
    #[doc = ""]
    #[doc = " \\return         0 on success."]
    #[doc = " \\return         MBEDTLS_ERR_MPI_BAD_INPUT_DATA if the allocated length of"]
    #[doc = "                 the two input MPIs is not the same."]
    #[link_name = "\u{1}mbedtls_mpi_lt_mpi_ct"]
    pub fn mpi_lt_mpi_ct(
        X: *const mpi,
        Y: *const mpi,
        ret: *mut crate::types::c_uint,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief          Compare an MPI with an integer."]
    #[doc = ""]
    #[doc = " \\param X        The left-hand MPI. This must point to an initialized MPI."]
    #[doc = " \\param z        The integer value to compare \\p X to."]
    #[doc = ""]
    #[doc = " \\return         \\c 1 if \\p X is greater than \\p z."]
    #[doc = " \\return         \\c -1 if \\p X is lesser than \\p z."]
    #[doc = " \\return         \\c 0 if \\p X is equal to \\p z."]
    #[link_name = "\u{1}mbedtls_mpi_cmp_int"]
    pub fn mpi_cmp_int(X: *const mpi, z: mpi_sint) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief          Perform an unsigned addition of MPIs: X = |A| + |B|"]
    #[doc = ""]
    #[doc = " \\param X        The destination MPI. This must point to an initialized MPI."]
    #[doc = " \\param A        The first summand. This must point to an initialized MPI."]
    #[doc = " \\param B        The second summand. This must point to an initialized MPI."]
    #[doc = ""]
    #[doc = " \\return         \\c 0 if successful."]
    #[doc = " \\return         #MBEDTLS_ERR_MPI_ALLOC_FAILED if a memory allocation failed."]
    #[doc = " \\return         Another negative error code on different kinds of failure."]
    #[link_name = "\u{1}mbedtls_mpi_add_abs"]
    pub fn mpi_add_abs(X: *mut mpi, A: *const mpi, B: *const mpi) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief          Perform an unsigned subtraction of MPIs: X = |A| - |B|"]
    #[doc = ""]
    #[doc = " \\param X        The destination MPI. This must point to an initialized MPI."]
    #[doc = " \\param A        The minuend. This must point to an initialized MPI."]
    #[doc = " \\param B        The subtrahend. This must point to an initialized MPI."]
    #[doc = ""]
    #[doc = " \\return         \\c 0 if successful."]
    #[doc = " \\return         #MBEDTLS_ERR_MPI_NEGATIVE_VALUE if \\p B is greater than \\p A."]
    #[doc = " \\return         Another negative error code on different kinds of failure."]
    #[doc = ""]
    #[link_name = "\u{1}mbedtls_mpi_sub_abs"]
    pub fn mpi_sub_abs(X: *mut mpi, A: *const mpi, B: *const mpi) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief          Perform a signed addition of MPIs: X = A + B"]
    #[doc = ""]
    #[doc = " \\param X        The destination MPI. This must point to an initialized MPI."]
    #[doc = " \\param A        The first summand. This must point to an initialized MPI."]
    #[doc = " \\param B        The second summand. This must point to an initialized MPI."]
    #[doc = ""]
    #[doc = " \\return         \\c 0 if successful."]
    #[doc = " \\return         #MBEDTLS_ERR_MPI_ALLOC_FAILED if a memory allocation failed."]
    #[doc = " \\return         Another negative error code on different kinds of failure."]
    #[link_name = "\u{1}mbedtls_mpi_add_mpi"]
    pub fn mpi_add_mpi(X: *mut mpi, A: *const mpi, B: *const mpi) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief          Perform a signed subtraction of MPIs: X = A - B"]
    #[doc = ""]
    #[doc = " \\param X        The destination MPI. This must point to an initialized MPI."]
    #[doc = " \\param A        The minuend. This must point to an initialized MPI."]
    #[doc = " \\param B        The subtrahend. This must point to an initialized MPI."]
    #[doc = ""]
    #[doc = " \\return         \\c 0 if successful."]
    #[doc = " \\return         #MBEDTLS_ERR_MPI_ALLOC_FAILED if a memory allocation failed."]
    #[doc = " \\return         Another negative error code on different kinds of failure."]
    #[link_name = "\u{1}mbedtls_mpi_sub_mpi"]
    pub fn mpi_sub_mpi(X: *mut mpi, A: *const mpi, B: *const mpi) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief          Perform a signed addition of an MPI and an integer: X = A + b"]
    #[doc = ""]
    #[doc = " \\param X        The destination MPI. This must point to an initialized MPI."]
    #[doc = " \\param A        The first summand. This must point to an initialized MPI."]
    #[doc = " \\param b        The second summand."]
    #[doc = ""]
    #[doc = " \\return         \\c 0 if successful."]
    #[doc = " \\return         #MBEDTLS_ERR_MPI_ALLOC_FAILED if a memory allocation failed."]
    #[doc = " \\return         Another negative error code on different kinds of failure."]
    #[link_name = "\u{1}mbedtls_mpi_add_int"]
    pub fn mpi_add_int(X: *mut mpi, A: *const mpi, b: mpi_sint) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief          Perform a signed subtraction of an MPI and an integer:"]
    #[doc = "                 X = A - b"]
    #[doc = ""]
    #[doc = " \\param X        The destination MPI. This must point to an initialized MPI."]
    #[doc = " \\param A        The minuend. This must point to an initialized MPI."]
    #[doc = " \\param b        The subtrahend."]
    #[doc = ""]
    #[doc = " \\return         \\c 0 if successful."]
    #[doc = " \\return         #MBEDTLS_ERR_MPI_ALLOC_FAILED if a memory allocation failed."]
    #[doc = " \\return         Another negative error code on different kinds of failure."]
    #[link_name = "\u{1}mbedtls_mpi_sub_int"]
    pub fn mpi_sub_int(X: *mut mpi, A: *const mpi, b: mpi_sint) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief          Perform a multiplication of two MPIs: X = A * B"]
    #[doc = ""]
    #[doc = " \\param X        The destination MPI. This must point to an initialized MPI."]
    #[doc = " \\param A        The first factor. This must point to an initialized MPI."]
    #[doc = " \\param B        The second factor. This must point to an initialized MPI."]
    #[doc = ""]
    #[doc = " \\return         \\c 0 if successful."]
    #[doc = " \\return         #MBEDTLS_ERR_MPI_ALLOC_FAILED if a memory allocation failed."]
    #[doc = " \\return         Another negative error code on different kinds of failure."]
    #[doc = ""]
    #[link_name = "\u{1}mbedtls_mpi_mul_mpi"]
    pub fn mpi_mul_mpi(X: *mut mpi, A: *const mpi, B: *const mpi) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief          Perform a multiplication of an MPI with an unsigned integer:"]
    #[doc = "                 X = A * b"]
    #[doc = ""]
    #[doc = " \\param X        The destination MPI. This must point to an initialized MPI."]
    #[doc = " \\param A        The first factor. This must point to an initialized MPI."]
    #[doc = " \\param b        The second factor."]
    #[doc = ""]
    #[doc = " \\return         \\c 0 if successful."]
    #[doc = " \\return         #MBEDTLS_ERR_MPI_ALLOC_FAILED if a memory allocation failed."]
    #[doc = " \\return         Another negative error code on different kinds of failure."]
    #[doc = ""]
    #[link_name = "\u{1}mbedtls_mpi_mul_int"]
    pub fn mpi_mul_int(X: *mut mpi, A: *const mpi, b: mpi_uint) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief          Perform a division with remainder of two MPIs:"]
    #[doc = "                 A = Q * B + R"]
    #[doc = ""]
    #[doc = " \\param Q        The destination MPI for the quotient."]
    #[doc = "                 This may be \\c NULL if the value of the"]
    #[doc = "                 quotient is not needed."]
    #[doc = " \\param R        The destination MPI for the remainder value."]
    #[doc = "                 This may be \\c NULL if the value of the"]
    #[doc = "                 remainder is not needed."]
    #[doc = " \\param A        The dividend. This must point to an initialized MPi."]
    #[doc = " \\param B        The divisor. This must point to an initialized MPI."]
    #[doc = ""]
    #[doc = " \\return         \\c 0 if successful."]
    #[doc = " \\return         #MBEDTLS_ERR_MPI_ALLOC_FAILED if memory allocation failed."]
    #[doc = " \\return         #MBEDTLS_ERR_MPI_DIVISION_BY_ZERO if \\p B equals zero."]
    #[doc = " \\return         Another negative error code on different kinds of failure."]
    #[link_name = "\u{1}mbedtls_mpi_div_mpi"]
    pub fn mpi_div_mpi(
        Q: *mut mpi,
        R: *mut mpi,
        A: *const mpi,
        B: *const mpi,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief          Perform a division with remainder of an MPI by an integer:"]
    #[doc = "                 A = Q * b + R"]
    #[doc = ""]
    #[doc = " \\param Q        The destination MPI for the quotient."]
    #[doc = "                 This may be \\c NULL if the value of the"]
    #[doc = "                 quotient is not needed."]
    #[doc = " \\param R        The destination MPI for the remainder value."]
    #[doc = "                 This may be \\c NULL if the value of the"]
    #[doc = "                 remainder is not needed."]
    #[doc = " \\param A        The dividend. This must point to an initialized MPi."]
    #[doc = " \\param b        The divisor."]
    #[doc = ""]
    #[doc = " \\return         \\c 0 if successful."]
    #[doc = " \\return         #MBEDTLS_ERR_MPI_ALLOC_FAILED if memory allocation failed."]
    #[doc = " \\return         #MBEDTLS_ERR_MPI_DIVISION_BY_ZERO if \\p b equals zero."]
    #[doc = " \\return         Another negative error code on different kinds of failure."]
    #[link_name = "\u{1}mbedtls_mpi_div_int"]
    pub fn mpi_div_int(Q: *mut mpi, R: *mut mpi, A: *const mpi, b: mpi_sint)
        -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief          Perform a modular reduction. R = A mod B"]
    #[doc = ""]
    #[doc = " \\param R        The destination MPI for the residue value."]
    #[doc = "                 This must point to an initialized MPI."]
    #[doc = " \\param A        The MPI to compute the residue of."]
    #[doc = "                 This must point to an initialized MPI."]
    #[doc = " \\param B        The base of the modular reduction."]
    #[doc = "                 This must point to an initialized MPI."]
    #[doc = ""]
    #[doc = " \\return         \\c 0 if successful."]
    #[doc = " \\return         #MBEDTLS_ERR_MPI_ALLOC_FAILED if a memory allocation failed."]
    #[doc = " \\return         #MBEDTLS_ERR_MPI_DIVISION_BY_ZERO if \\p B equals zero."]
    #[doc = " \\return         #MBEDTLS_ERR_MPI_NEGATIVE_VALUE if \\p B is negative."]
    #[doc = " \\return         Another negative error code on different kinds of failure."]
    #[doc = ""]
    #[link_name = "\u{1}mbedtls_mpi_mod_mpi"]
    pub fn mpi_mod_mpi(R: *mut mpi, A: *const mpi, B: *const mpi) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief          Perform a modular reduction with respect to an integer."]
    #[doc = "                 r = A mod b"]
    #[doc = ""]
    #[doc = " \\param r        The address at which to store the residue."]
    #[doc = "                 This must not be \\c NULL."]
    #[doc = " \\param A        The MPI to compute the residue of."]
    #[doc = "                 This must point to an initialized MPi."]
    #[doc = " \\param b        The integer base of the modular reduction."]
    #[doc = ""]
    #[doc = " \\return         \\c 0 if successful."]
    #[doc = " \\return         #MBEDTLS_ERR_MPI_ALLOC_FAILED if a memory allocation failed."]
    #[doc = " \\return         #MBEDTLS_ERR_MPI_DIVISION_BY_ZERO if \\p b equals zero."]
    #[doc = " \\return         #MBEDTLS_ERR_MPI_NEGATIVE_VALUE if \\p b is negative."]
    #[doc = " \\return         Another negative error code on different kinds of failure."]
    #[link_name = "\u{1}mbedtls_mpi_mod_int"]
    pub fn mpi_mod_int(r: *mut mpi_uint, A: *const mpi, b: mpi_sint) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief          Perform a sliding-window exponentiation: X = A^E mod N"]
    #[doc = ""]
    #[doc = " \\param X        The destination MPI. This must point to an initialized MPI."]
    #[doc = " \\param A        The base of the exponentiation."]
    #[doc = "                 This must point to an initialized MPI."]
    #[doc = " \\param E        The exponent MPI. This must point to an initialized MPI."]
    #[doc = " \\param N        The base for the modular reduction. This must point to an"]
    #[doc = "                 initialized MPI."]
    #[doc = " \\param _RR      A helper MPI depending solely on \\p N which can be used to"]
    #[doc = "                 speed-up multiple modular exponentiations for the same value"]
    #[doc = "                 of \\p N. This may be \\c NULL. If it is not \\c NULL, it must"]
    #[doc = "                 point to an initialized MPI. If it hasn't been used after"]
    #[doc = "                 the call to mbedtls_mpi_init(), this function will compute"]
    #[doc = "                 the helper value and store it in \\p _RR for reuse on"]
    #[doc = "                 subsequent calls to this function. Otherwise, the function"]
    #[doc = "                 will assume that \\p _RR holds the helper value set by a"]
    #[doc = "                 previous call to mbedtls_mpi_exp_mod(), and reuse it."]
    #[doc = ""]
    #[doc = " \\return         \\c 0 if successful."]
    #[doc = " \\return         #MBEDTLS_ERR_MPI_ALLOC_FAILED if a memory allocation failed."]
    #[doc = " \\return         #MBEDTLS_ERR_MPI_BAD_INPUT_DATA if \\c N is negative or"]
    #[doc = "                 even, or if \\c E is negative."]
    #[doc = " \\return         Another negative error code on different kinds of failures."]
    #[doc = ""]
    #[link_name = "\u{1}mbedtls_mpi_exp_mod"]
    pub fn mpi_exp_mod(
        X: *mut mpi,
        A: *const mpi,
        E: *const mpi,
        N: *const mpi,
        _RR: *mut mpi,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief          Fill an MPI with a number of random bytes."]
    #[doc = ""]
    #[doc = " \\param X        The destination MPI. This must point to an initialized MPI."]
    #[doc = " \\param size     The number of random bytes to generate."]
    #[doc = " \\param f_rng    The RNG function to use. This must not be \\c NULL."]
    #[doc = " \\param p_rng    The RNG parameter to be passed to \\p f_rng. This may be"]
    #[doc = "                 \\c NULL if \\p f_rng doesn't need a context argument."]
    #[doc = ""]
    #[doc = " \\return         \\c 0 if successful."]
    #[doc = " \\return         #MBEDTLS_ERR_MPI_ALLOC_FAILED if a memory allocation failed."]
    #[doc = " \\return         Another negative error code on failure."]
    #[doc = ""]
    #[doc = " \\note           The bytes obtained from the RNG are interpreted"]
    #[doc = "                 as a big-endian representation of an MPI; this can"]
    #[doc = "                 be relevant in applications like deterministic ECDSA."]
    #[link_name = "\u{1}mbedtls_mpi_fill_random"]
    pub fn mpi_fill_random(
        X: *mut mpi,
        size: usize,
        f_rng: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut crate::types::c_void,
                arg2: *mut crate::types::c_uchar,
                arg3: usize,
            ) -> crate::types::c_int,
        >,
        p_rng: *mut crate::types::c_void,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief          Compute the greatest common divisor: G = gcd(A, B)"]
    #[doc = ""]
    #[doc = " \\param G        The destination MPI. This must point to an initialized MPI."]
    #[doc = " \\param A        The first operand. This must point to an initialized MPI."]
    #[doc = " \\param B        The second operand. This must point to an initialized MPI."]
    #[doc = ""]
    #[doc = " \\return         \\c 0 if successful."]
    #[doc = " \\return         #MBEDTLS_ERR_MPI_ALLOC_FAILED if a memory allocation failed."]
    #[doc = " \\return         Another negative error code on different kinds of failure."]
    #[link_name = "\u{1}mbedtls_mpi_gcd"]
    pub fn mpi_gcd(G: *mut mpi, A: *const mpi, B: *const mpi) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief          Compute the modular inverse: X = A^-1 mod N"]
    #[doc = ""]
    #[doc = " \\param X        The destination MPI. This must point to an initialized MPI."]
    #[doc = " \\param A        The MPI to calculate the modular inverse of. This must point"]
    #[doc = "                 to an initialized MPI."]
    #[doc = " \\param N        The base of the modular inversion. This must point to an"]
    #[doc = "                 initialized MPI."]
    #[doc = ""]
    #[doc = " \\return         \\c 0 if successful."]
    #[doc = " \\return         #MBEDTLS_ERR_MPI_ALLOC_FAILED if a memory allocation failed."]
    #[doc = " \\return         #MBEDTLS_ERR_MPI_BAD_INPUT_DATA if \\p N is less than"]
    #[doc = "                 or equal to one."]
    #[doc = " \\return         #MBEDTLS_ERR_MPI_NOT_ACCEPTABLE if \\p has no modular inverse"]
    #[doc = "                 with respect to \\p N."]
    #[link_name = "\u{1}mbedtls_mpi_inv_mod"]
    pub fn mpi_inv_mod(X: *mut mpi, A: *const mpi, N: *const mpi) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief          Perform a Miller-Rabin primality test with error"]
    #[doc = "                 probability of 2<sup>-80</sup>."]
    #[doc = ""]
    #[doc = " \\deprecated     Superseded by mbedtls_mpi_is_prime_ext() which allows"]
    #[doc = "                 specifying the number of Miller-Rabin rounds."]
    #[doc = ""]
    #[doc = " \\param X        The MPI to check for primality."]
    #[doc = "                 This must point to an initialized MPI."]
    #[doc = " \\param f_rng    The RNG function to use. This must not be \\c NULL."]
    #[doc = " \\param p_rng    The RNG parameter to be passed to \\p f_rng."]
    #[doc = "                 This may be \\c NULL if \\p f_rng doesn't use a"]
    #[doc = "                 context parameter."]
    #[doc = ""]
    #[doc = " \\return         \\c 0 if successful, i.e. \\p X is probably prime."]
    #[doc = " \\return         #MBEDTLS_ERR_MPI_ALLOC_FAILED if a memory allocation failed."]
    #[doc = " \\return         #MBEDTLS_ERR_MPI_NOT_ACCEPTABLE if \\p X is not prime."]
    #[doc = " \\return         Another negative error code on other kinds of failure."]
    #[link_name = "\u{1}mbedtls_mpi_is_prime"]
    pub fn mpi_is_prime(
        X: *const mpi,
        f_rng: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut crate::types::c_void,
                arg2: *mut crate::types::c_uchar,
                arg3: usize,
            ) -> crate::types::c_int,
        >,
        p_rng: *mut crate::types::c_void,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief          Miller-Rabin primality test."]
    #[doc = ""]
    #[doc = " \\warning        If \\p X is potentially generated by an adversary, for example"]
    #[doc = "                 when validating cryptographic parameters that you didn't"]
    #[doc = "                 generate yourself and that are supposed to be prime, then"]
    #[doc = "                 \\p rounds should be at least the half of the security"]
    #[doc = "                 strength of the cryptographic algorithm. On the other hand,"]
    #[doc = "                 if \\p X is chosen uniformly or non-adversially (as is the"]
    #[doc = "                 case when mbedtls_mpi_gen_prime calls this function), then"]
    #[doc = "                 \\p rounds can be much lower."]
    #[doc = ""]
    #[doc = " \\param X        The MPI to check for primality."]
    #[doc = "                 This must point to an initialized MPI."]
    #[doc = " \\param rounds   The number of bases to perform the Miller-Rabin primality"]
    #[doc = "                 test for. The probability of returning 0 on a composite is"]
    #[doc = "                 at most 2<sup>-2*\\p rounds</sup>."]
    #[doc = " \\param f_rng    The RNG function to use. This must not be \\c NULL."]
    #[doc = " \\param p_rng    The RNG parameter to be passed to \\p f_rng."]
    #[doc = "                 This may be \\c NULL if \\p f_rng doesn't use"]
    #[doc = "                 a context parameter."]
    #[doc = ""]
    #[doc = " \\return         \\c 0 if successful, i.e. \\p X is probably prime."]
    #[doc = " \\return         #MBEDTLS_ERR_MPI_ALLOC_FAILED if a memory allocation failed."]
    #[doc = " \\return         #MBEDTLS_ERR_MPI_NOT_ACCEPTABLE if \\p X is not prime."]
    #[doc = " \\return         Another negative error code on other kinds of failure."]
    #[link_name = "\u{1}mbedtls_mpi_is_prime_ext"]
    pub fn mpi_is_prime_ext(
        X: *const mpi,
        rounds: crate::types::c_int,
        f_rng: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut crate::types::c_void,
                arg2: *mut crate::types::c_uchar,
                arg3: usize,
            ) -> crate::types::c_int,
        >,
        p_rng: *mut crate::types::c_void,
    ) -> crate::types::c_int;
}
#[repr(u32)]
#[doc = " \\brief Flags for mbedtls_mpi_gen_prime()"]
#[doc = ""]
#[doc = " Each of these flags is a constraint on the result X returned by"]
#[doc = " mbedtls_mpi_gen_prime()."]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum mpi_gen_prime_flag_t {
    #[doc = "< (X-1)/2 is prime too"]
    MPI_GEN_PRIME_FLAG_DH = 1,
    #[doc = "< lower error rate from 2<sup>-80</sup> to 2<sup>-128</sup>"]
    MPI_GEN_PRIME_FLAG_LOW_ERR = 2,
}
extern "C" {
    #[doc = " \\brief          Generate a prime number."]
    #[doc = ""]
    #[doc = " \\param X        The destination MPI to store the generated prime in."]
    #[doc = "                 This must point to an initialized MPi."]
    #[doc = " \\param nbits    The required size of the destination MPI in bits."]
    #[doc = "                 This must be between \\c 3 and #MBEDTLS_MPI_MAX_BITS."]
    #[doc = " \\param flags    A mask of flags of type #mbedtls_mpi_gen_prime_flag_t."]
    #[doc = " \\param f_rng    The RNG function to use. This must not be \\c NULL."]
    #[doc = " \\param p_rng    The RNG parameter to be passed to \\p f_rng."]
    #[doc = "                 This may be \\c NULL if \\p f_rng doesn't use"]
    #[doc = "                 a context parameter."]
    #[doc = ""]
    #[doc = " \\return         \\c 0 if successful, in which case \\p X holds a"]
    #[doc = "                 probably prime number."]
    #[doc = " \\return         #MBEDTLS_ERR_MPI_ALLOC_FAILED if a memory allocation failed."]
    #[doc = " \\return         #MBEDTLS_ERR_MPI_BAD_INPUT_DATA if `nbits` is not between"]
    #[doc = "                 \\c 3 and #MBEDTLS_MPI_MAX_BITS."]
    #[link_name = "\u{1}mbedtls_mpi_gen_prime"]
    pub fn mpi_gen_prime(
        X: *mut mpi,
        nbits: usize,
        flags: crate::types::c_int,
        f_rng: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut crate::types::c_void,
                arg2: *mut crate::types::c_uchar,
                arg3: usize,
            ) -> crate::types::c_int,
        >,
        p_rng: *mut crate::types::c_void,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief          Checkup routine"]
    #[doc = ""]
    #[doc = " \\return         0 if successful, or 1 if the test failed"]
    #[link_name = "\u{1}mbedtls_mpi_self_test"]
    pub fn mpi_self_test(verbose: crate::types::c_int) -> crate::types::c_int;
}
#[repr(u32)]
#[doc = " \\brief     Supported message digests."]
#[doc = ""]
#[doc = " \\warning   MD2, MD4, MD5 and SHA-1 are considered weak message digests and"]
#[doc = "            their use constitutes a security risk. We recommend considering"]
#[doc = "            stronger message digests instead."]
#[doc = ""]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum md_type_t {
    #[doc = "< None."]
    MD_NONE = 0,
    #[doc = "< The MD2 message digest."]
    MD_MD2 = 1,
    #[doc = "< The MD4 message digest."]
    MD_MD4 = 2,
    #[doc = "< The MD5 message digest."]
    MD_MD5 = 3,
    #[doc = "< The SHA-1 message digest."]
    MD_SHA1 = 4,
    #[doc = "< The SHA-224 message digest."]
    MD_SHA224 = 5,
    #[doc = "< The SHA-256 message digest."]
    MD_SHA256 = 6,
    #[doc = "< The SHA-384 message digest."]
    MD_SHA384 = 7,
    #[doc = "< The SHA-512 message digest."]
    MD_SHA512 = 8,
    #[doc = "< The RIPEMD-160 message digest."]
    MD_RIPEMD160 = 9,
}
#[doc = " The generic message-digest context."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct md_context_t {
    #[doc = " Information about the associated message digest."]
    pub md_info: *const md_info_t,
    #[doc = " The digest-specific context."]
    pub md_ctx: *mut crate::types::c_void,
    #[doc = " The HMAC part of the context."]
    pub hmac_ctx: *mut crate::types::c_void,
}
#[test]
fn bindgen_test_layout_md_context_t() {
    assert_eq!(
        ::core::mem::size_of::<md_context_t>(),
        12usize,
        concat!("Size of: ", stringify!(md_context_t))
    );
    assert_eq!(
        ::core::mem::align_of::<md_context_t>(),
        4usize,
        concat!("Alignment of ", stringify!(md_context_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<md_context_t>())).md_info as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(md_context_t),
            "::",
            stringify!(md_info)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<md_context_t>())).md_ctx as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(md_context_t),
            "::",
            stringify!(md_ctx)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<md_context_t>())).hmac_ctx as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(md_context_t),
            "::",
            stringify!(hmac_ctx)
        )
    );
}
impl Default for md_context_t {
    fn default() -> Self {
        unsafe { ::core::mem::zeroed() }
    }
}
extern "C" {
    #[doc = " \\brief           This function returns the list of digests supported by the"]
    #[doc = "                  generic digest module."]
    #[doc = ""]
    #[doc = " \\note            The list starts with the strongest available hashes."]
    #[doc = ""]
    #[doc = " \\return          A statically allocated array of digests. Each element"]
    #[doc = "                  in the returned list is an integer belonging to the"]
    #[doc = "                  message-digest enumeration #mbedtls_md_type_t."]
    #[doc = "                  The last entry is 0."]
    #[link_name = "\u{1}mbedtls_md_list"]
    pub fn md_list() -> *const crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief           This function returns the message-digest information"]
    #[doc = "                  associated with the given digest name."]
    #[doc = ""]
    #[doc = " \\param md_name   The name of the digest to search for."]
    #[doc = ""]
    #[doc = " \\return          The message-digest information associated with \\p md_name."]
    #[doc = " \\return          NULL if the associated message-digest information is not found."]
    #[link_name = "\u{1}mbedtls_md_info_from_string"]
    pub fn md_info_from_string(md_name: *const crate::types::c_char) -> *const md_info_t;
}
extern "C" {
    #[doc = " \\brief           This function returns the message-digest information"]
    #[doc = "                  associated with the given digest type."]
    #[doc = ""]
    #[doc = " \\param md_type   The type of digest to search for."]
    #[doc = ""]
    #[doc = " \\return          The message-digest information associated with \\p md_type."]
    #[doc = " \\return          NULL if the associated message-digest information is not found."]
    #[link_name = "\u{1}mbedtls_md_info_from_type"]
    pub fn md_info_from_type(md_type: md_type_t) -> *const md_info_t;
}
extern "C" {
    #[doc = " \\brief           This function initializes a message-digest context without"]
    #[doc = "                  binding it to a particular message-digest algorithm."]
    #[doc = ""]
    #[doc = "                  This function should always be called first. It prepares the"]
    #[doc = "                  context for mbedtls_md_setup() for binding it to a"]
    #[doc = "                  message-digest algorithm."]
    #[link_name = "\u{1}mbedtls_md_init"]
    pub fn md_init(ctx: *mut md_context_t);
}
extern "C" {
    #[doc = " \\brief           This function clears the internal structure of \\p ctx and"]
    #[doc = "                  frees any embedded internal structure, but does not free"]
    #[doc = "                  \\p ctx itself."]
    #[doc = ""]
    #[doc = "                  If you have called mbedtls_md_setup() on \\p ctx, you must"]
    #[doc = "                  call mbedtls_md_free() when you are no longer using the"]
    #[doc = "                  context."]
    #[doc = "                  Calling this function if you have previously"]
    #[doc = "                  called mbedtls_md_init() and nothing else is optional."]
    #[doc = "                  You must not call this function if you have not called"]
    #[doc = "                  mbedtls_md_init()."]
    #[link_name = "\u{1}mbedtls_md_free"]
    pub fn md_free(ctx: *mut md_context_t);
}
extern "C" {
    #[doc = " \\brief           This function selects the message digest algorithm to use,"]
    #[doc = "                  and allocates internal structures."]
    #[doc = ""]
    #[doc = "                  It should be called after mbedtls_md_init() or mbedtls_md_free()."]
    #[doc = "                  Makes it necessary to call mbedtls_md_free() later."]
    #[doc = ""]
    #[doc = " \\deprecated      Superseded by mbedtls_md_setup() in 2.0.0"]
    #[doc = ""]
    #[doc = " \\param ctx       The context to set up."]
    #[doc = " \\param md_info   The information structure of the message-digest algorithm"]
    #[doc = "                  to use."]
    #[doc = ""]
    #[doc = " \\return          \\c 0 on success."]
    #[doc = " \\return          #MBEDTLS_ERR_MD_BAD_INPUT_DATA on parameter-verification"]
    #[doc = "                  failure."]
    #[doc = " \\return          #MBEDTLS_ERR_MD_ALLOC_FAILED on memory-allocation failure."]
    #[link_name = "\u{1}mbedtls_md_init_ctx"]
    pub fn md_init_ctx(ctx: *mut md_context_t, md_info: *const md_info_t) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief           This function selects the message digest algorithm to use,"]
    #[doc = "                  and allocates internal structures."]
    #[doc = ""]
    #[doc = "                  It should be called after mbedtls_md_init() or"]
    #[doc = "                  mbedtls_md_free(). Makes it necessary to call"]
    #[doc = "                  mbedtls_md_free() later."]
    #[doc = ""]
    #[doc = " \\param ctx       The context to set up."]
    #[doc = " \\param md_info   The information structure of the message-digest algorithm"]
    #[doc = "                  to use."]
    #[doc = " \\param hmac      Defines if HMAC is used. 0: HMAC is not used (saves some memory),"]
    #[doc = "                  or non-zero: HMAC is used with this context."]
    #[doc = ""]
    #[doc = " \\return          \\c 0 on success."]
    #[doc = " \\return          #MBEDTLS_ERR_MD_BAD_INPUT_DATA on parameter-verification"]
    #[doc = "                  failure."]
    #[doc = " \\return          #MBEDTLS_ERR_MD_ALLOC_FAILED on memory-allocation failure."]
    #[link_name = "\u{1}mbedtls_md_setup"]
    pub fn md_setup(
        ctx: *mut md_context_t,
        md_info: *const md_info_t,
        hmac: crate::types::c_int,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief           This function clones the state of an message-digest"]
    #[doc = "                  context."]
    #[doc = ""]
    #[doc = " \\note            You must call mbedtls_md_setup() on \\c dst before calling"]
    #[doc = "                  this function."]
    #[doc = ""]
    #[doc = " \\note            The two contexts must have the same type,"]
    #[doc = "                  for example, both are SHA-256."]
    #[doc = ""]
    #[doc = " \\warning         This function clones the message-digest state, not the"]
    #[doc = "                  HMAC state."]
    #[doc = ""]
    #[doc = " \\param dst       The destination context."]
    #[doc = " \\param src       The context to be cloned."]
    #[doc = ""]
    #[doc = " \\return          \\c 0 on success."]
    #[doc = " \\return          #MBEDTLS_ERR_MD_BAD_INPUT_DATA on parameter-verification failure."]
    #[link_name = "\u{1}mbedtls_md_clone"]
    pub fn md_clone(dst: *mut md_context_t, src: *const md_context_t) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief           This function extracts the message-digest size from the"]
    #[doc = "                  message-digest information structure."]
    #[doc = ""]
    #[doc = " \\param md_info   The information structure of the message-digest algorithm"]
    #[doc = "                  to use."]
    #[doc = ""]
    #[doc = " \\return          The size of the message-digest output in Bytes."]
    #[link_name = "\u{1}mbedtls_md_get_size"]
    pub fn md_get_size(md_info: *const md_info_t) -> crate::types::c_uchar;
}
extern "C" {
    #[doc = " \\brief           This function extracts the message-digest type from the"]
    #[doc = "                  message-digest information structure."]
    #[doc = ""]
    #[doc = " \\param md_info   The information structure of the message-digest algorithm"]
    #[doc = "                  to use."]
    #[doc = ""]
    #[doc = " \\return          The type of the message digest."]
    #[link_name = "\u{1}mbedtls_md_get_type"]
    pub fn md_get_type(md_info: *const md_info_t) -> md_type_t;
}
extern "C" {
    #[doc = " \\brief           This function extracts the message-digest name from the"]
    #[doc = "                  message-digest information structure."]
    #[doc = ""]
    #[doc = " \\param md_info   The information structure of the message-digest algorithm"]
    #[doc = "                  to use."]
    #[doc = ""]
    #[doc = " \\return          The name of the message digest."]
    #[link_name = "\u{1}mbedtls_md_get_name"]
    pub fn md_get_name(md_info: *const md_info_t) -> *const crate::types::c_char;
}
extern "C" {
    #[doc = " \\brief           This function starts a message-digest computation."]
    #[doc = ""]
    #[doc = "                  You must call this function after setting up the context"]
    #[doc = "                  with mbedtls_md_setup(), and before passing data with"]
    #[doc = "                  mbedtls_md_update()."]
    #[doc = ""]
    #[doc = " \\param ctx       The generic message-digest context."]
    #[doc = ""]
    #[doc = " \\return          \\c 0 on success."]
    #[doc = " \\return          #MBEDTLS_ERR_MD_BAD_INPUT_DATA on parameter-verification"]
    #[doc = "                  failure."]
    #[link_name = "\u{1}mbedtls_md_starts"]
    pub fn md_starts(ctx: *mut md_context_t) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief           This function feeds an input buffer into an ongoing"]
    #[doc = "                  message-digest computation."]
    #[doc = ""]
    #[doc = "                  You must call mbedtls_md_starts() before calling this"]
    #[doc = "                  function. You may call this function multiple times."]
    #[doc = "                  Afterwards, call mbedtls_md_finish()."]
    #[doc = ""]
    #[doc = " \\param ctx       The generic message-digest context."]
    #[doc = " \\param input     The buffer holding the input data."]
    #[doc = " \\param ilen      The length of the input data."]
    #[doc = ""]
    #[doc = " \\return          \\c 0 on success."]
    #[doc = " \\return          #MBEDTLS_ERR_MD_BAD_INPUT_DATA on parameter-verification"]
    #[doc = "                  failure."]
    #[link_name = "\u{1}mbedtls_md_update"]
    pub fn md_update(
        ctx: *mut md_context_t,
        input: *const crate::types::c_uchar,
        ilen: usize,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief           This function finishes the digest operation,"]
    #[doc = "                  and writes the result to the output buffer."]
    #[doc = ""]
    #[doc = "                  Call this function after a call to mbedtls_md_starts(),"]
    #[doc = "                  followed by any number of calls to mbedtls_md_update()."]
    #[doc = "                  Afterwards, you may either clear the context with"]
    #[doc = "                  mbedtls_md_free(), or call mbedtls_md_starts() to reuse"]
    #[doc = "                  the context for another digest operation with the same"]
    #[doc = "                  algorithm."]
    #[doc = ""]
    #[doc = " \\param ctx       The generic message-digest context."]
    #[doc = " \\param output    The buffer for the generic message-digest checksum result."]
    #[doc = ""]
    #[doc = " \\return          \\c 0 on success."]
    #[doc = " \\return          #MBEDTLS_ERR_MD_BAD_INPUT_DATA on parameter-verification"]
    #[doc = "                  failure."]
    #[link_name = "\u{1}mbedtls_md_finish"]
    pub fn md_finish(
        ctx: *mut md_context_t,
        output: *mut crate::types::c_uchar,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief          This function calculates the message-digest of a buffer,"]
    #[doc = "                 with respect to a configurable message-digest algorithm"]
    #[doc = "                 in a single call."]
    #[doc = ""]
    #[doc = "                 The result is calculated as"]
    #[doc = "                 Output = message_digest(input buffer)."]
    #[doc = ""]
    #[doc = " \\param md_info  The information structure of the message-digest algorithm"]
    #[doc = "                 to use."]
    #[doc = " \\param input    The buffer holding the data."]
    #[doc = " \\param ilen     The length of the input data."]
    #[doc = " \\param output   The generic message-digest checksum result."]
    #[doc = ""]
    #[doc = " \\return         \\c 0 on success."]
    #[doc = " \\return         #MBEDTLS_ERR_MD_BAD_INPUT_DATA on parameter-verification"]
    #[doc = "                 failure."]
    #[link_name = "\u{1}mbedtls_md"]
    pub fn md(
        md_info: *const md_info_t,
        input: *const crate::types::c_uchar,
        ilen: usize,
        output: *mut crate::types::c_uchar,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief           This function sets the HMAC key and prepares to"]
    #[doc = "                  authenticate a new message."]
    #[doc = ""]
    #[doc = "                  Call this function after mbedtls_md_setup(), to use"]
    #[doc = "                  the MD context for an HMAC calculation, then call"]
    #[doc = "                  mbedtls_md_hmac_update() to provide the input data, and"]
    #[doc = "                  mbedtls_md_hmac_finish() to get the HMAC value."]
    #[doc = ""]
    #[doc = " \\param ctx       The message digest context containing an embedded HMAC"]
    #[doc = "                  context."]
    #[doc = " \\param key       The HMAC secret key."]
    #[doc = " \\param keylen    The length of the HMAC key in Bytes."]
    #[doc = ""]
    #[doc = " \\return          \\c 0 on success."]
    #[doc = " \\return          #MBEDTLS_ERR_MD_BAD_INPUT_DATA on parameter-verification"]
    #[doc = "                  failure."]
    #[link_name = "\u{1}mbedtls_md_hmac_starts"]
    pub fn md_hmac_starts(
        ctx: *mut md_context_t,
        key: *const crate::types::c_uchar,
        keylen: usize,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief           This function feeds an input buffer into an ongoing HMAC"]
    #[doc = "                  computation."]
    #[doc = ""]
    #[doc = "                  Call mbedtls_md_hmac_starts() or mbedtls_md_hmac_reset()"]
    #[doc = "                  before calling this function."]
    #[doc = "                  You may call this function multiple times to pass the"]
    #[doc = "                  input piecewise."]
    #[doc = "                  Afterwards, call mbedtls_md_hmac_finish()."]
    #[doc = ""]
    #[doc = " \\param ctx       The message digest context containing an embedded HMAC"]
    #[doc = "                  context."]
    #[doc = " \\param input     The buffer holding the input data."]
    #[doc = " \\param ilen      The length of the input data."]
    #[doc = ""]
    #[doc = " \\return          \\c 0 on success."]
    #[doc = " \\return          #MBEDTLS_ERR_MD_BAD_INPUT_DATA on parameter-verification"]
    #[doc = "                  failure."]
    #[link_name = "\u{1}mbedtls_md_hmac_update"]
    pub fn md_hmac_update(
        ctx: *mut md_context_t,
        input: *const crate::types::c_uchar,
        ilen: usize,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief           This function finishes the HMAC operation, and writes"]
    #[doc = "                  the result to the output buffer."]
    #[doc = ""]
    #[doc = "                  Call this function after mbedtls_md_hmac_starts() and"]
    #[doc = "                  mbedtls_md_hmac_update() to get the HMAC value. Afterwards"]
    #[doc = "                  you may either call mbedtls_md_free() to clear the context,"]
    #[doc = "                  or call mbedtls_md_hmac_reset() to reuse the context with"]
    #[doc = "                  the same HMAC key."]
    #[doc = ""]
    #[doc = " \\param ctx       The message digest context containing an embedded HMAC"]
    #[doc = "                  context."]
    #[doc = " \\param output    The generic HMAC checksum result."]
    #[doc = ""]
    #[doc = " \\return          \\c 0 on success."]
    #[doc = " \\return          #MBEDTLS_ERR_MD_BAD_INPUT_DATA on parameter-verification"]
    #[doc = "                  failure."]
    #[link_name = "\u{1}mbedtls_md_hmac_finish"]
    pub fn md_hmac_finish(
        ctx: *mut md_context_t,
        output: *mut crate::types::c_uchar,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief           This function prepares to authenticate a new message with"]
    #[doc = "                  the same key as the previous HMAC operation."]
    #[doc = ""]
    #[doc = "                  You may call this function after mbedtls_md_hmac_finish()."]
    #[doc = "                  Afterwards call mbedtls_md_hmac_update() to pass the new"]
    #[doc = "                  input."]
    #[doc = ""]
    #[doc = " \\param ctx       The message digest context containing an embedded HMAC"]
    #[doc = "                  context."]
    #[doc = ""]
    #[doc = " \\return          \\c 0 on success."]
    #[doc = " \\return          #MBEDTLS_ERR_MD_BAD_INPUT_DATA on parameter-verification"]
    #[doc = "                  failure."]
    #[link_name = "\u{1}mbedtls_md_hmac_reset"]
    pub fn md_hmac_reset(ctx: *mut md_context_t) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief          This function calculates the full generic HMAC"]
    #[doc = "                 on the input buffer with the provided key."]
    #[doc = ""]
    #[doc = "                 The function allocates the context, performs the"]
    #[doc = "                 calculation, and frees the context."]
    #[doc = ""]
    #[doc = "                 The HMAC result is calculated as"]
    #[doc = "                 output = generic HMAC(hmac key, input buffer)."]
    #[doc = ""]
    #[doc = " \\param md_info  The information structure of the message-digest algorithm"]
    #[doc = "                 to use."]
    #[doc = " \\param key      The HMAC secret key."]
    #[doc = " \\param keylen   The length of the HMAC secret key in Bytes."]
    #[doc = " \\param input    The buffer holding the input data."]
    #[doc = " \\param ilen     The length of the input data."]
    #[doc = " \\param output   The generic HMAC result."]
    #[doc = ""]
    #[doc = " \\return         \\c 0 on success."]
    #[doc = " \\return         #MBEDTLS_ERR_MD_BAD_INPUT_DATA on parameter-verification"]
    #[doc = "                 failure."]
    #[link_name = "\u{1}mbedtls_md_hmac"]
    pub fn md_hmac(
        md_info: *const md_info_t,
        key: *const crate::types::c_uchar,
        keylen: usize,
        input: *const crate::types::c_uchar,
        ilen: usize,
        output: *mut crate::types::c_uchar,
    ) -> crate::types::c_int;
}
extern "C" {
    #[link_name = "\u{1}mbedtls_md_process"]
    pub fn md_process(
        ctx: *mut md_context_t,
        data: *const crate::types::c_uchar,
    ) -> crate::types::c_int;
}
#[doc = " Message digest information."]
#[doc = " Allows message digest functions to be called in a generic way."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct md_info_t {
    #[doc = " Name of the message digest"]
    pub name: *const crate::types::c_char,
    #[doc = " Digest identifier"]
    pub type_: md_type_t,
    #[doc = " Output length of the digest function in bytes"]
    pub size: crate::types::c_uchar,
    #[doc = " Block length of the digest function in bytes"]
    pub block_size: crate::types::c_uchar,
}
#[test]
fn bindgen_test_layout_md_info_t() {
    assert_eq!(
        ::core::mem::size_of::<md_info_t>(),
        12usize,
        concat!("Size of: ", stringify!(md_info_t))
    );
    assert_eq!(
        ::core::mem::align_of::<md_info_t>(),
        4usize,
        concat!("Alignment of ", stringify!(md_info_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<md_info_t>())).name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(md_info_t),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<md_info_t>())).type_ as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(md_info_t),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<md_info_t>())).size as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(md_info_t),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<md_info_t>())).block_size as *const _ as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(md_info_t),
            "::",
            stringify!(block_size)
        )
    );
}
impl Default for md_info_t {
    fn default() -> Self {
        unsafe { ::core::mem::zeroed() }
    }
}
extern "C" {
    #[link_name = "\u{1}mbedtls_md5_info"]
    pub static md5_info: md_info_t;
}
extern "C" {
    #[link_name = "\u{1}mbedtls_ripemd160_info"]
    pub static ripemd160_info: md_info_t;
}
extern "C" {
    #[link_name = "\u{1}mbedtls_sha1_info"]
    pub static sha1_info: md_info_t;
}
extern "C" {
    #[link_name = "\u{1}mbedtls_sha224_info"]
    pub static sha224_info: md_info_t;
}
extern "C" {
    #[link_name = "\u{1}mbedtls_sha256_info"]
    pub static sha256_info: md_info_t;
}
extern "C" {
    #[link_name = "\u{1}mbedtls_sha384_info"]
    pub static sha384_info: md_info_t;
}
extern "C" {
    #[link_name = "\u{1}mbedtls_sha512_info"]
    pub static sha512_info: md_info_t;
}
#[repr(u32)]
#[doc = " Domain-parameter identifiers: curve, subgroup, and generator."]
#[doc = ""]
#[doc = " \\note Only curves over prime fields are supported."]
#[doc = ""]
#[doc = " \\warning This library does not support validation of arbitrary domain"]
#[doc = " parameters. Therefore, only standardized domain parameters from trusted"]
#[doc = " sources should be used. See mbedtls_ecp_group_load()."]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum ecp_group_id {
    #[doc = "< Curve not defined."]
    ECP_DP_NONE = 0,
    #[doc = "< Domain parameters for the 192-bit curve defined by FIPS 186-4 and SEC1."]
    ECP_DP_SECP192R1 = 1,
    #[doc = "< Domain parameters for the 224-bit curve defined by FIPS 186-4 and SEC1."]
    ECP_DP_SECP224R1 = 2,
    #[doc = "< Domain parameters for the 256-bit curve defined by FIPS 186-4 and SEC1."]
    ECP_DP_SECP256R1 = 3,
    #[doc = "< Domain parameters for the 384-bit curve defined by FIPS 186-4 and SEC1."]
    ECP_DP_SECP384R1 = 4,
    #[doc = "< Domain parameters for the 521-bit curve defined by FIPS 186-4 and SEC1."]
    ECP_DP_SECP521R1 = 5,
    #[doc = "< Domain parameters for 256-bit Brainpool curve."]
    ECP_DP_BP256R1 = 6,
    #[doc = "< Domain parameters for 384-bit Brainpool curve."]
    ECP_DP_BP384R1 = 7,
    #[doc = "< Domain parameters for 512-bit Brainpool curve."]
    ECP_DP_BP512R1 = 8,
    #[doc = "< Domain parameters for Curve25519."]
    ECP_DP_CURVE25519 = 9,
    #[doc = "< Domain parameters for 192-bit \"Koblitz\" curve."]
    ECP_DP_SECP192K1 = 10,
    #[doc = "< Domain parameters for 224-bit \"Koblitz\" curve."]
    ECP_DP_SECP224K1 = 11,
    #[doc = "< Domain parameters for 256-bit \"Koblitz\" curve."]
    ECP_DP_SECP256K1 = 12,
    #[doc = "< Domain parameters for Curve448."]
    ECP_DP_CURVE448 = 13,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum ecp_curve_type {
    ECP_TYPE_NONE = 0,
    ECP_TYPE_SHORT_WEIERSTRASS = 1,
    ECP_TYPE_MONTGOMERY = 2,
}
#[doc = " Curve information, for use by other modules."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ecp_curve_info {
    #[doc = "< An internal identifier."]
    pub grp_id: ecp_group_id,
    #[doc = "< The TLS NamedCurve identifier."]
    pub tls_id: u16,
    #[doc = "< The curve size in bits."]
    pub bit_size: u16,
    #[doc = "< A human-friendly name."]
    pub name: *const crate::types::c_char,
}
#[test]
fn bindgen_test_layout_ecp_curve_info() {
    assert_eq!(
        ::core::mem::size_of::<ecp_curve_info>(),
        12usize,
        concat!("Size of: ", stringify!(ecp_curve_info))
    );
    assert_eq!(
        ::core::mem::align_of::<ecp_curve_info>(),
        4usize,
        concat!("Alignment of ", stringify!(ecp_curve_info))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ecp_curve_info>())).grp_id as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ecp_curve_info),
            "::",
            stringify!(grp_id)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ecp_curve_info>())).tls_id as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ecp_curve_info),
            "::",
            stringify!(tls_id)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ecp_curve_info>())).bit_size as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(ecp_curve_info),
            "::",
            stringify!(bit_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ecp_curve_info>())).name as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ecp_curve_info),
            "::",
            stringify!(name)
        )
    );
}
impl Default for ecp_curve_info {
    fn default() -> Self {
        unsafe { ::core::mem::zeroed() }
    }
}
#[doc = " \\brief           The ECP point structure, in Jacobian coordinates."]
#[doc = ""]
#[doc = " \\note            All functions expect and return points satisfying"]
#[doc = "                  the following condition: <code>Z == 0</code> or"]
#[doc = "                  <code>Z == 1</code>. Other values of \\p Z are"]
#[doc = "                  used only by internal functions."]
#[doc = "                  The point is zero, or \"at infinity\", if <code>Z == 0</code>."]
#[doc = "                  Otherwise, \\p X and \\p Y are its standard (affine)"]
#[doc = "                  coordinates."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ecp_point {
    #[doc = "< The X coordinate of the ECP point."]
    pub X: mpi,
    #[doc = "< The Y coordinate of the ECP point."]
    pub Y: mpi,
    #[doc = "< The Z coordinate of the ECP point."]
    pub Z: mpi,
}
#[test]
fn bindgen_test_layout_ecp_point() {
    assert_eq!(
        ::core::mem::size_of::<ecp_point>(),
        36usize,
        concat!("Size of: ", stringify!(ecp_point))
    );
    assert_eq!(
        ::core::mem::align_of::<ecp_point>(),
        4usize,
        concat!("Alignment of ", stringify!(ecp_point))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ecp_point>())).X as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ecp_point),
            "::",
            stringify!(X)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ecp_point>())).Y as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ecp_point),
            "::",
            stringify!(Y)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ecp_point>())).Z as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ecp_point),
            "::",
            stringify!(Z)
        )
    );
}
impl Default for ecp_point {
    fn default() -> Self {
        unsafe { ::core::mem::zeroed() }
    }
}
#[doc = " \\brief           The ECP group structure."]
#[doc = ""]
#[doc = " We consider two types of curve equations:"]
#[doc = " <ul><li>Short Weierstrass: <code>y^2 = x^3 + A x + B mod P</code>"]
#[doc = " (SEC1 + RFC-4492)</li>"]
#[doc = " <li>Montgomery: <code>y^2 = x^3 + A x^2 + x mod P</code> (Curve25519,"]
#[doc = " Curve448)</li></ul>"]
#[doc = " In both cases, the generator (\\p G) for a prime-order subgroup is fixed."]
#[doc = ""]
#[doc = " For Short Weierstrass, this subgroup is the whole curve, and its"]
#[doc = " cardinality is denoted by \\p N. Our code requires that \\p N is an"]
#[doc = " odd prime as mbedtls_ecp_mul() requires an odd number, and"]
#[doc = " mbedtls_ecdsa_sign() requires that it is prime for blinding purposes."]
#[doc = ""]
#[doc = " For Montgomery curves, we do not store \\p A, but <code>(A + 2) / 4</code>,"]
#[doc = " which is the quantity used in the formulas. Additionally, \\p nbits is"]
#[doc = " not the size of \\p N but the required size for private keys."]
#[doc = ""]
#[doc = " If \\p modp is NULL, reduction modulo \\p P is done using a generic algorithm."]
#[doc = " Otherwise, \\p modp must point to a function that takes an \\p mbedtls_mpi in the"]
#[doc = " range of <code>0..2^(2*pbits)-1</code>, and transforms it in-place to an integer"]
#[doc = " which is congruent mod \\p P to the given MPI, and is close enough to \\p pbits"]
#[doc = " in size, so that it may be efficiently brought in the 0..P-1 range by a few"]
#[doc = " additions or subtractions. Therefore, it is only an approximative modular"]
#[doc = " reduction. It must return 0 on success and non-zero on failure."]
#[doc = ""]
#[doc = " \\note        Alternative implementations must keep the group IDs distinct. If"]
#[doc = "              two group structures have the same ID, then they must be"]
#[doc = "              identical."]
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ecp_group {
    #[doc = "< An internal group identifier."]
    pub id: ecp_group_id,
    #[doc = "< The prime modulus of the base field."]
    pub P: mpi,
    #[doc = "< For Short Weierstrass: \\p A in the equation. For"]
    #[doc = "Montgomery curves: <code>(A + 2) / 4</code>."]
    pub A: mpi,
    #[doc = "< For Short Weierstrass: \\p B in the equation."]
    #[doc = "For Montgomery curves: unused."]
    pub B: mpi,
    #[doc = "< The generator of the subgroup used."]
    pub G: ecp_point,
    #[doc = "< The order of \\p G."]
    pub N: mpi,
    #[doc = "< The number of bits in \\p P."]
    pub pbits: usize,
    #[doc = "< For Short Weierstrass: The number of bits in \\p P."]
    #[doc = "For Montgomery curves: the number of bits in the"]
    #[doc = "private keys."]
    pub nbits: usize,
    #[doc = "< \\internal 1 if the constants are static."]
    pub h: crate::types::c_uint,
    #[doc = "< The function for fast pseudo-reduction"]
    #[doc = "mod \\p P (see above)."]
    pub modp: ::core::option::Option<unsafe extern "C" fn(arg1: *mut mpi) -> crate::types::c_int>,
    #[doc = "< Unused."]
    pub t_pre: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ecp_point,
            arg2: *mut crate::types::c_void,
        ) -> crate::types::c_int,
    >,
    #[doc = "< Unused."]
    pub t_post: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ecp_point,
            arg2: *mut crate::types::c_void,
        ) -> crate::types::c_int,
    >,
    #[doc = "< Unused."]
    pub t_data: *mut crate::types::c_void,
    #[doc = "< Pre-computed points for ecp_mul_comb()."]
    pub T: *mut ecp_point,
    #[doc = "< The number of pre-computed points."]
    pub T_size: usize,
}
#[test]
fn bindgen_test_layout_ecp_group() {
    assert_eq!(
        ::core::mem::size_of::<ecp_group>(),
        124usize,
        concat!("Size of: ", stringify!(ecp_group))
    );
    assert_eq!(
        ::core::mem::align_of::<ecp_group>(),
        4usize,
        concat!("Alignment of ", stringify!(ecp_group))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ecp_group>())).id as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ecp_group),
            "::",
            stringify!(id)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ecp_group>())).P as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ecp_group),
            "::",
            stringify!(P)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ecp_group>())).A as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ecp_group),
            "::",
            stringify!(A)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ecp_group>())).B as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(ecp_group),
            "::",
            stringify!(B)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ecp_group>())).G as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ecp_group),
            "::",
            stringify!(G)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ecp_group>())).N as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(ecp_group),
            "::",
            stringify!(N)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ecp_group>())).pbits as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(ecp_group),
            "::",
            stringify!(pbits)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ecp_group>())).nbits as *const _ as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(ecp_group),
            "::",
            stringify!(nbits)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ecp_group>())).h as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(ecp_group),
            "::",
            stringify!(h)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ecp_group>())).modp as *const _ as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(ecp_group),
            "::",
            stringify!(modp)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ecp_group>())).t_pre as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(ecp_group),
            "::",
            stringify!(t_pre)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ecp_group>())).t_post as *const _ as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(ecp_group),
            "::",
            stringify!(t_post)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ecp_group>())).t_data as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(ecp_group),
            "::",
            stringify!(t_data)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ecp_group>())).T as *const _ as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(ecp_group),
            "::",
            stringify!(T)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ecp_group>())).T_size as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(ecp_group),
            "::",
            stringify!(T_size)
        )
    );
}
impl Default for ecp_group {
    fn default() -> Self {
        unsafe { ::core::mem::zeroed() }
    }
}
pub type ecp_restart_ctx = crate::types::c_void;
#[doc = " \\brief    The ECP key-pair structure."]
#[doc = ""]
#[doc = " A generic key-pair that may be used for ECDSA and fixed ECDH, for example."]
#[doc = ""]
#[doc = " \\note    Members are deliberately in the same order as in the"]
#[doc = "          ::mbedtls_ecdsa_context structure."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ecp_keypair {
    #[doc = "<  Elliptic curve and base point"]
    pub grp: ecp_group,
    #[doc = "<  our secret value"]
    pub d: mpi,
    #[doc = "<  our public value"]
    pub Q: ecp_point,
}
#[test]
fn bindgen_test_layout_ecp_keypair() {
    assert_eq!(
        ::core::mem::size_of::<ecp_keypair>(),
        172usize,
        concat!("Size of: ", stringify!(ecp_keypair))
    );
    assert_eq!(
        ::core::mem::align_of::<ecp_keypair>(),
        4usize,
        concat!("Alignment of ", stringify!(ecp_keypair))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ecp_keypair>())).grp as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ecp_keypair),
            "::",
            stringify!(grp)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ecp_keypair>())).d as *const _ as usize },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(ecp_keypair),
            "::",
            stringify!(d)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ecp_keypair>())).Q as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(ecp_keypair),
            "::",
            stringify!(Q)
        )
    );
}
impl Default for ecp_keypair {
    fn default() -> Self {
        unsafe { ::core::mem::zeroed() }
    }
}
extern "C" {
    #[link_name = "\u{1}mbedtls_ecp_get_type"]
    pub fn ecp_get_type(grp: *const ecp_group) -> ecp_curve_type;
}
extern "C" {
    #[doc = " \\brief           This function retrieves the information defined in"]
    #[doc = "                  mbedtls_ecp_curve_info() for all supported curves in order"]
    #[doc = "                  of preference."]
    #[doc = ""]
    #[doc = " \\note            This function returns information about all curves"]
    #[doc = "                  supported by the library. Some curves may not be"]
    #[doc = "                  supported for all algorithms. Call mbedtls_ecdh_can_do()"]
    #[doc = "                  or mbedtls_ecdsa_can_do() to check if a curve is"]
    #[doc = "                  supported for ECDH or ECDSA."]
    #[doc = ""]
    #[doc = " \\return          A statically allocated array. The last entry is 0."]
    #[link_name = "\u{1}mbedtls_ecp_curve_list"]
    pub fn ecp_curve_list() -> *const ecp_curve_info;
}
extern "C" {
    #[doc = " \\brief           This function retrieves the list of internal group"]
    #[doc = "                  identifiers of all supported curves in the order of"]
    #[doc = "                  preference."]
    #[doc = ""]
    #[doc = " \\note            This function returns information about all curves"]
    #[doc = "                  supported by the library. Some curves may not be"]
    #[doc = "                  supported for all algorithms. Call mbedtls_ecdh_can_do()"]
    #[doc = "                  or mbedtls_ecdsa_can_do() to check if a curve is"]
    #[doc = "                  supported for ECDH or ECDSA."]
    #[doc = ""]
    #[doc = " \\return          A statically allocated array,"]
    #[doc = "                  terminated with MBEDTLS_ECP_DP_NONE."]
    #[link_name = "\u{1}mbedtls_ecp_grp_id_list"]
    pub fn ecp_grp_id_list() -> *const ecp_group_id;
}
extern "C" {
    #[doc = " \\brief           This function retrieves curve information from an internal"]
    #[doc = "                  group identifier."]
    #[doc = ""]
    #[doc = " \\param grp_id    An \\c MBEDTLS_ECP_DP_XXX value."]
    #[doc = ""]
    #[doc = " \\return          The associated curve information on success."]
    #[doc = " \\return          NULL on failure."]
    #[link_name = "\u{1}mbedtls_ecp_curve_info_from_grp_id"]
    pub fn ecp_curve_info_from_grp_id(grp_id: ecp_group_id) -> *const ecp_curve_info;
}
extern "C" {
    #[doc = " \\brief           This function retrieves curve information from a TLS"]
    #[doc = "                  NamedCurve value."]
    #[doc = ""]
    #[doc = " \\param tls_id    An \\c MBEDTLS_ECP_DP_XXX value."]
    #[doc = ""]
    #[doc = " \\return          The associated curve information on success."]
    #[doc = " \\return          NULL on failure."]
    #[link_name = "\u{1}mbedtls_ecp_curve_info_from_tls_id"]
    pub fn ecp_curve_info_from_tls_id(tls_id: u16) -> *const ecp_curve_info;
}
extern "C" {
    #[doc = " \\brief           This function retrieves curve information from a"]
    #[doc = "                  human-readable name."]
    #[doc = ""]
    #[doc = " \\param name      The human-readable name."]
    #[doc = ""]
    #[doc = " \\return          The associated curve information on success."]
    #[doc = " \\return          NULL on failure."]
    #[link_name = "\u{1}mbedtls_ecp_curve_info_from_name"]
    pub fn ecp_curve_info_from_name(name: *const crate::types::c_char) -> *const ecp_curve_info;
}
extern "C" {
    #[doc = " \\brief           This function initializes a point as zero."]
    #[doc = ""]
    #[doc = " \\param pt        The point to initialize."]
    #[link_name = "\u{1}mbedtls_ecp_point_init"]
    pub fn ecp_point_init(pt: *mut ecp_point);
}
extern "C" {
    #[doc = " \\brief           This function initializes an ECP group context"]
    #[doc = "                  without loading any domain parameters."]
    #[doc = ""]
    #[doc = " \\note            After this function is called, domain parameters"]
    #[doc = "                  for various ECP groups can be loaded through the"]
    #[doc = "                  mbedtls_ecp_group_load() or mbedtls_ecp_tls_read_group()"]
    #[doc = "                  functions."]
    #[link_name = "\u{1}mbedtls_ecp_group_init"]
    pub fn ecp_group_init(grp: *mut ecp_group);
}
extern "C" {
    #[doc = " \\brief           This function initializes a key pair as an invalid one."]
    #[doc = ""]
    #[doc = " \\param key       The key pair to initialize."]
    #[link_name = "\u{1}mbedtls_ecp_keypair_init"]
    pub fn ecp_keypair_init(key: *mut ecp_keypair);
}
extern "C" {
    #[doc = " \\brief           This function frees the components of a point."]
    #[doc = ""]
    #[doc = " \\param pt        The point to free."]
    #[link_name = "\u{1}mbedtls_ecp_point_free"]
    pub fn ecp_point_free(pt: *mut ecp_point);
}
extern "C" {
    #[doc = " \\brief           This function frees the components of an ECP group."]
    #[doc = ""]
    #[doc = " \\param grp       The group to free. This may be \\c NULL, in which"]
    #[doc = "                  case this function returns immediately. If it is not"]
    #[doc = "                  \\c NULL, it must point to an initialized ECP group."]
    #[link_name = "\u{1}mbedtls_ecp_group_free"]
    pub fn ecp_group_free(grp: *mut ecp_group);
}
extern "C" {
    #[doc = " \\brief           This function frees the components of a key pair."]
    #[doc = ""]
    #[doc = " \\param key       The key pair to free. This may be \\c NULL, in which"]
    #[doc = "                  case this function returns immediately. If it is not"]
    #[doc = "                  \\c NULL, it must point to an initialized ECP key pair."]
    #[link_name = "\u{1}mbedtls_ecp_keypair_free"]
    pub fn ecp_keypair_free(key: *mut ecp_keypair);
}
extern "C" {
    #[doc = " \\brief           This function copies the contents of point \\p Q into"]
    #[doc = "                  point \\p P."]
    #[doc = ""]
    #[doc = " \\param P         The destination point. This must be initialized."]
    #[doc = " \\param Q         The source point. This must be initialized."]
    #[doc = ""]
    #[doc = " \\return          \\c 0 on success."]
    #[doc = " \\return          #MBEDTLS_ERR_MPI_ALLOC_FAILED on memory-allocation failure."]
    #[doc = " \\return          Another negative error code for other kinds of failure."]
    #[link_name = "\u{1}mbedtls_ecp_copy"]
    pub fn ecp_copy(P: *mut ecp_point, Q: *const ecp_point) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief           This function copies the contents of group \\p src into"]
    #[doc = "                  group \\p dst."]
    #[doc = ""]
    #[doc = " \\param dst       The destination group. This must be initialized."]
    #[doc = " \\param src       The source group. This must be initialized."]
    #[doc = ""]
    #[doc = " \\return          \\c 0 on success."]
    #[doc = " \\return          #MBEDTLS_ERR_MPI_ALLOC_FAILED on memory-allocation failure."]
    #[doc = " \\return          Another negative error code on other kinds of failure."]
    #[link_name = "\u{1}mbedtls_ecp_group_copy"]
    pub fn ecp_group_copy(dst: *mut ecp_group, src: *const ecp_group) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief           This function sets a point to the point at infinity."]
    #[doc = ""]
    #[doc = " \\param pt        The point to set. This must be initialized."]
    #[doc = ""]
    #[doc = " \\return          \\c 0 on success."]
    #[doc = " \\return          #MBEDTLS_ERR_MPI_ALLOC_FAILED on memory-allocation failure."]
    #[doc = " \\return          Another negative error code on other kinds of failure."]
    #[link_name = "\u{1}mbedtls_ecp_set_zero"]
    pub fn ecp_set_zero(pt: *mut ecp_point) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief           This function checks if a point is the point at infinity."]
    #[doc = ""]
    #[doc = " \\param pt        The point to test. This must be initialized."]
    #[doc = ""]
    #[doc = " \\return          \\c 1 if the point is zero."]
    #[doc = " \\return          \\c 0 if the point is non-zero."]
    #[doc = " \\return          A negative error code on failure."]
    #[link_name = "\u{1}mbedtls_ecp_is_zero"]
    pub fn ecp_is_zero(pt: *mut ecp_point) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief           This function compares two points."]
    #[doc = ""]
    #[doc = " \\note            This assumes that the points are normalized. Otherwise,"]
    #[doc = "                  they may compare as \"not equal\" even if they are."]
    #[doc = ""]
    #[doc = " \\param P         The first point to compare. This must be initialized."]
    #[doc = " \\param Q         The second point to compare. This must be initialized."]
    #[doc = ""]
    #[doc = " \\return          \\c 0 if the points are equal."]
    #[doc = " \\return          #MBEDTLS_ERR_ECP_BAD_INPUT_DATA if the points are not equal."]
    #[link_name = "\u{1}mbedtls_ecp_point_cmp"]
    pub fn ecp_point_cmp(P: *const ecp_point, Q: *const ecp_point) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief           This function imports a non-zero point from two ASCII"]
    #[doc = "                  strings."]
    #[doc = ""]
    #[doc = " \\param P         The destination point. This must be initialized."]
    #[doc = " \\param radix     The numeric base of the input."]
    #[doc = " \\param x         The first affine coordinate, as a null-terminated string."]
    #[doc = " \\param y         The second affine coordinate, as a null-terminated string."]
    #[doc = ""]
    #[doc = " \\return          \\c 0 on success."]
    #[doc = " \\return          An \\c MBEDTLS_ERR_MPI_XXX error code on failure."]
    #[link_name = "\u{1}mbedtls_ecp_point_read_string"]
    pub fn ecp_point_read_string(
        P: *mut ecp_point,
        radix: crate::types::c_int,
        x: *const crate::types::c_char,
        y: *const crate::types::c_char,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief           This function exports a point into unsigned binary data."]
    #[doc = ""]
    #[doc = " \\param grp       The group to which the point should belong."]
    #[doc = "                  This must be initialized and have group parameters"]
    #[doc = "                  set, for example through mbedtls_ecp_group_load()."]
    #[doc = " \\param P         The point to export. This must be initialized."]
    #[doc = " \\param format    The point format. This must be either"]
    #[doc = "                  #MBEDTLS_ECP_PF_COMPRESSED or #MBEDTLS_ECP_PF_UNCOMPRESSED."]
    #[doc = "                  (For groups without these formats, this parameter is"]
    #[doc = "                  ignored. But it still has to be either of the above"]
    #[doc = "                  values.)"]
    #[doc = " \\param olen      The address at which to store the length of"]
    #[doc = "                  the output in Bytes. This must not be \\c NULL."]
    #[doc = " \\param buf       The output buffer. This must be a writable buffer"]
    #[doc = "                  of length \\p buflen Bytes."]
    #[doc = " \\param buflen    The length of the output buffer \\p buf in Bytes."]
    #[doc = ""]
    #[doc = " \\return          \\c 0 on success."]
    #[doc = " \\return          #MBEDTLS_ERR_ECP_BUFFER_TOO_SMALL if the output buffer"]
    #[doc = "                  is too small to hold the point."]
    #[doc = " \\return          #MBEDTLS_ERR_ECP_FEATURE_UNAVAILABLE if the point format"]
    #[doc = "                  or the export for the given group is not implemented."]
    #[doc = " \\return          Another negative error code on other kinds of failure."]
    #[link_name = "\u{1}mbedtls_ecp_point_write_binary"]
    pub fn ecp_point_write_binary(
        grp: *const ecp_group,
        P: *const ecp_point,
        format: crate::types::c_int,
        olen: *mut usize,
        buf: *mut crate::types::c_uchar,
        buflen: usize,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief           This function imports a point from unsigned binary data."]
    #[doc = ""]
    #[doc = " \\note            This function does not check that the point actually"]
    #[doc = "                  belongs to the given group, see mbedtls_ecp_check_pubkey()"]
    #[doc = "                  for that."]
    #[doc = ""]
    #[doc = " \\param grp       The group to which the point should belong."]
    #[doc = "                  This must be initialized and have group parameters"]
    #[doc = "                  set, for example through mbedtls_ecp_group_load()."]
    #[doc = " \\param P         The destination context to import the point to."]
    #[doc = "                  This must be initialized."]
    #[doc = " \\param buf       The input buffer. This must be a readable buffer"]
    #[doc = "                  of length \\p ilen Bytes."]
    #[doc = " \\param ilen      The length of the input buffer \\p buf in Bytes."]
    #[doc = ""]
    #[doc = " \\return          \\c 0 on success."]
    #[doc = " \\return          #MBEDTLS_ERR_ECP_BAD_INPUT_DATA if the input is invalid."]
    #[doc = " \\return          #MBEDTLS_ERR_MPI_ALLOC_FAILED on memory-allocation failure."]
    #[doc = " \\return          #MBEDTLS_ERR_ECP_FEATURE_UNAVAILABLE if the import for the"]
    #[doc = "                  given group is not implemented."]
    #[link_name = "\u{1}mbedtls_ecp_point_read_binary"]
    pub fn ecp_point_read_binary(
        grp: *const ecp_group,
        P: *mut ecp_point,
        buf: *const crate::types::c_uchar,
        ilen: usize,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief           This function imports a point from a TLS ECPoint record."]
    #[doc = ""]
    #[doc = " \\note            On function return, \\p *buf is updated to point immediately"]
    #[doc = "                  after the ECPoint record."]
    #[doc = ""]
    #[doc = " \\param grp       The ECP group to use."]
    #[doc = "                  This must be initialized and have group parameters"]
    #[doc = "                  set, for example through mbedtls_ecp_group_load()."]
    #[doc = " \\param pt        The destination point."]
    #[doc = " \\param buf       The address of the pointer to the start of the input buffer."]
    #[doc = " \\param len       The length of the buffer."]
    #[doc = ""]
    #[doc = " \\return          \\c 0 on success."]
    #[doc = " \\return          An \\c MBEDTLS_ERR_MPI_XXX error code on initialization"]
    #[doc = "                  failure."]
    #[doc = " \\return          #MBEDTLS_ERR_ECP_BAD_INPUT_DATA if input is invalid."]
    #[link_name = "\u{1}mbedtls_ecp_tls_read_point"]
    pub fn ecp_tls_read_point(
        grp: *const ecp_group,
        pt: *mut ecp_point,
        buf: *mut *const crate::types::c_uchar,
        len: usize,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief           This function exports a point as a TLS ECPoint record"]
    #[doc = "                  defined in RFC 4492, Section 5.4."]
    #[doc = ""]
    #[doc = " \\param grp       The ECP group to use."]
    #[doc = "                  This must be initialized and have group parameters"]
    #[doc = "                  set, for example through mbedtls_ecp_group_load()."]
    #[doc = " \\param pt        The point to be exported. This must be initialized."]
    #[doc = " \\param format    The point format to use. This must be either"]
    #[doc = "                  #MBEDTLS_ECP_PF_COMPRESSED or #MBEDTLS_ECP_PF_UNCOMPRESSED."]
    #[doc = " \\param olen      The address at which to store the length in Bytes"]
    #[doc = "                  of the data written."]
    #[doc = " \\param buf       The target buffer. This must be a writable buffer of"]
    #[doc = "                  length \\p blen Bytes."]
    #[doc = " \\param blen      The length of the target buffer \\p buf in Bytes."]
    #[doc = ""]
    #[doc = " \\return          \\c 0 on success."]
    #[doc = " \\return          #MBEDTLS_ERR_ECP_BAD_INPUT_DATA if the input is invalid."]
    #[doc = " \\return          #MBEDTLS_ERR_ECP_BUFFER_TOO_SMALL if the target buffer"]
    #[doc = "                  is too small to hold the exported point."]
    #[doc = " \\return          Another negative error code on other kinds of failure."]
    #[link_name = "\u{1}mbedtls_ecp_tls_write_point"]
    pub fn ecp_tls_write_point(
        grp: *const ecp_group,
        pt: *const ecp_point,
        format: crate::types::c_int,
        olen: *mut usize,
        buf: *mut crate::types::c_uchar,
        blen: usize,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief           This function sets up an ECP group context"]
    #[doc = "                  from a standardized set of domain parameters."]
    #[doc = ""]
    #[doc = " \\note            The index should be a value of the NamedCurve enum,"]
    #[doc = "                  as defined in <em>RFC-4492: Elliptic Curve Cryptography"]
    #[doc = "                  (ECC) Cipher Suites for Transport Layer Security (TLS)</em>,"]
    #[doc = "                  usually in the form of an \\c MBEDTLS_ECP_DP_XXX macro."]
    #[doc = ""]
    #[doc = " \\param grp       The group context to setup. This must be initialized."]
    #[doc = " \\param id        The identifier of the domain parameter set to load."]
    #[doc = ""]
    #[doc = " \\return          \\c 0 on success."]
    #[doc = " \\return          #MBEDTLS_ERR_ECP_FEATURE_UNAVAILABLE if \\p id doesn't"]
    #[doc = "                  correspond to a known group."]
    #[doc = " \\return          Another negative error code on other kinds of failure."]
    #[link_name = "\u{1}mbedtls_ecp_group_load"]
    pub fn ecp_group_load(grp: *mut ecp_group, id: ecp_group_id) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief           This function sets up an ECP group context from a TLS"]
    #[doc = "                  ECParameters record as defined in RFC 4492, Section 5.4."]
    #[doc = ""]
    #[doc = " \\note            The read pointer \\p buf is updated to point right after"]
    #[doc = "                  the ECParameters record on exit."]
    #[doc = ""]
    #[doc = " \\param grp       The group context to setup. This must be initialized."]
    #[doc = " \\param buf       The address of the pointer to the start of the input buffer."]
    #[doc = " \\param len       The length of the input buffer \\c *buf in Bytes."]
    #[doc = ""]
    #[doc = " \\return          \\c 0 on success."]
    #[doc = " \\return          #MBEDTLS_ERR_ECP_BAD_INPUT_DATA if input is invalid."]
    #[doc = " \\return          #MBEDTLS_ERR_ECP_FEATURE_UNAVAILABLE if the group is not"]
    #[doc = "                  recognized."]
    #[doc = " \\return          Another negative error code on other kinds of failure."]
    #[link_name = "\u{1}mbedtls_ecp_tls_read_group"]
    pub fn ecp_tls_read_group(
        grp: *mut ecp_group,
        buf: *mut *const crate::types::c_uchar,
        len: usize,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief           This function extracts an elliptic curve group ID from a"]
    #[doc = "                  TLS ECParameters record as defined in RFC 4492, Section 5.4."]
    #[doc = ""]
    #[doc = " \\note            The read pointer \\p buf is updated to point right after"]
    #[doc = "                  the ECParameters record on exit."]
    #[doc = ""]
    #[doc = " \\param grp       The address at which to store the group id."]
    #[doc = "                  This must not be \\c NULL."]
    #[doc = " \\param buf       The address of the pointer to the start of the input buffer."]
    #[doc = " \\param len       The length of the input buffer \\c *buf in Bytes."]
    #[doc = ""]
    #[doc = " \\return          \\c 0 on success."]
    #[doc = " \\return          #MBEDTLS_ERR_ECP_BAD_INPUT_DATA if input is invalid."]
    #[doc = " \\return          #MBEDTLS_ERR_ECP_FEATURE_UNAVAILABLE if the group is not"]
    #[doc = "                  recognized."]
    #[doc = " \\return          Another negative error code on other kinds of failure."]
    #[link_name = "\u{1}mbedtls_ecp_tls_read_group_id"]
    pub fn ecp_tls_read_group_id(
        grp: *mut ecp_group_id,
        buf: *mut *const crate::types::c_uchar,
        len: usize,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief           This function exports an elliptic curve as a TLS"]
    #[doc = "                  ECParameters record as defined in RFC 4492, Section 5.4."]
    #[doc = ""]
    #[doc = " \\param grp       The ECP group to be exported."]
    #[doc = "                  This must be initialized and have group parameters"]
    #[doc = "                  set, for example through mbedtls_ecp_group_load()."]
    #[doc = " \\param olen      The address at which to store the number of Bytes written."]
    #[doc = "                  This must not be \\c NULL."]
    #[doc = " \\param buf       The buffer to write to. This must be a writable buffer"]
    #[doc = "                  of length \\p blen Bytes."]
    #[doc = " \\param blen      The length of the output buffer \\p buf in Bytes."]
    #[doc = ""]
    #[doc = " \\return          \\c 0 on success."]
    #[doc = " \\return          #MBEDTLS_ERR_ECP_BUFFER_TOO_SMALL if the output"]
    #[doc = "                  buffer is too small to hold the exported group."]
    #[doc = " \\return          Another negative error code on other kinds of failure."]
    #[link_name = "\u{1}mbedtls_ecp_tls_write_group"]
    pub fn ecp_tls_write_group(
        grp: *const ecp_group,
        olen: *mut usize,
        buf: *mut crate::types::c_uchar,
        blen: usize,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief           This function performs a scalar multiplication of a point"]
    #[doc = "                  by an integer: \\p R = \\p m * \\p P."]
    #[doc = ""]
    #[doc = "                  It is not thread-safe to use same group in multiple threads."]
    #[doc = ""]
    #[doc = " \\note            To prevent timing attacks, this function"]
    #[doc = "                  executes the exact same sequence of base-field"]
    #[doc = "                  operations for any valid \\p m. It avoids any if-branch or"]
    #[doc = "                  array index depending on the value of \\p m."]
    #[doc = ""]
    #[doc = " \\note            If \\p f_rng is not NULL, it is used to randomize"]
    #[doc = "                  intermediate results to prevent potential timing attacks"]
    #[doc = "                  targeting these results. We recommend always providing"]
    #[doc = "                  a non-NULL \\p f_rng. The overhead is negligible."]
    #[doc = "                  Note: unless #MBEDTLS_ECP_NO_INTERNAL_RNG is defined, when"]
    #[doc = "                  \\p f_rng is NULL, an internal RNG (seeded from the value"]
    #[doc = "                  of \\p m) will be used instead."]
    #[doc = ""]
    #[doc = " \\param grp       The ECP group to use."]
    #[doc = "                  This must be initialized and have group parameters"]
    #[doc = "                  set, for example through mbedtls_ecp_group_load()."]
    #[doc = " \\param R         The point in which to store the result of the calculation."]
    #[doc = "                  This must be initialized."]
    #[doc = " \\param m         The integer by which to multiply. This must be initialized."]
    #[doc = " \\param P         The point to multiply. This must be initialized."]
    #[doc = " \\param f_rng     The RNG function. This may be \\c NULL if randomization"]
    #[doc = "                  of intermediate results isn't desired (discouraged)."]
    #[doc = " \\param p_rng     The RNG context to be passed to \\p p_rng."]
    #[doc = ""]
    #[doc = " \\return          \\c 0 on success."]
    #[doc = " \\return          #MBEDTLS_ERR_ECP_INVALID_KEY if \\p m is not a valid private"]
    #[doc = "                  key, or \\p P is not a valid public key."]
    #[doc = " \\return          #MBEDTLS_ERR_MPI_ALLOC_FAILED on memory-allocation failure."]
    #[doc = " \\return          Another negative error code on other kinds of failure."]
    #[link_name = "\u{1}mbedtls_ecp_mul"]
    pub fn ecp_mul(
        grp: *mut ecp_group,
        R: *mut ecp_point,
        m: *const mpi,
        P: *const ecp_point,
        f_rng: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut crate::types::c_void,
                arg2: *mut crate::types::c_uchar,
                arg3: usize,
            ) -> crate::types::c_int,
        >,
        p_rng: *mut crate::types::c_void,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief           This function performs multiplication of a point by"]
    #[doc = "                  an integer: \\p R = \\p m * \\p P in a restartable way."]
    #[doc = ""]
    #[doc = " \\see             mbedtls_ecp_mul()"]
    #[doc = ""]
    #[doc = " \\note            This function does the same as \\c mbedtls_ecp_mul(), but"]
    #[doc = "                  it can return early and restart according to the limit set"]
    #[doc = "                  with \\c mbedtls_ecp_set_max_ops() to reduce blocking."]
    #[doc = ""]
    #[doc = " \\param grp       The ECP group to use."]
    #[doc = "                  This must be initialized and have group parameters"]
    #[doc = "                  set, for example through mbedtls_ecp_group_load()."]
    #[doc = " \\param R         The point in which to store the result of the calculation."]
    #[doc = "                  This must be initialized."]
    #[doc = " \\param m         The integer by which to multiply. This must be initialized."]
    #[doc = " \\param P         The point to multiply. This must be initialized."]
    #[doc = " \\param f_rng     The RNG function. This may be \\c NULL if randomization"]
    #[doc = "                  of intermediate results isn't desired (discouraged)."]
    #[doc = " \\param p_rng     The RNG context to be passed to \\p p_rng."]
    #[doc = " \\param rs_ctx    The restart context (NULL disables restart)."]
    #[doc = ""]
    #[doc = " \\return          \\c 0 on success."]
    #[doc = " \\return          #MBEDTLS_ERR_ECP_INVALID_KEY if \\p m is not a valid private"]
    #[doc = "                  key, or \\p P is not a valid public key."]
    #[doc = " \\return          #MBEDTLS_ERR_MPI_ALLOC_FAILED on memory-allocation failure."]
    #[doc = " \\return          #MBEDTLS_ERR_ECP_IN_PROGRESS if maximum number of"]
    #[doc = "                  operations was reached: see \\c mbedtls_ecp_set_max_ops()."]
    #[doc = " \\return          Another negative error code on other kinds of failure."]
    #[link_name = "\u{1}mbedtls_ecp_mul_restartable"]
    pub fn ecp_mul_restartable(
        grp: *mut ecp_group,
        R: *mut ecp_point,
        m: *const mpi,
        P: *const ecp_point,
        f_rng: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut crate::types::c_void,
                arg2: *mut crate::types::c_uchar,
                arg3: usize,
            ) -> crate::types::c_int,
        >,
        p_rng: *mut crate::types::c_void,
        rs_ctx: *mut ecp_restart_ctx,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief           This function performs multiplication and addition of two"]
    #[doc = "                  points by integers: \\p R = \\p m * \\p P + \\p n * \\p Q"]
    #[doc = ""]
    #[doc = "                  It is not thread-safe to use same group in multiple threads."]
    #[doc = ""]
    #[doc = " \\note            In contrast to mbedtls_ecp_mul(), this function does not"]
    #[doc = "                  guarantee a constant execution flow and timing."]
    #[doc = ""]
    #[doc = " \\note            This function is only defined for short Weierstrass curves."]
    #[doc = "                  It may not be included in builds without any short"]
    #[doc = "                  Weierstrass curve."]
    #[doc = ""]
    #[doc = " \\param grp       The ECP group to use."]
    #[doc = "                  This must be initialized and have group parameters"]
    #[doc = "                  set, for example through mbedtls_ecp_group_load()."]
    #[doc = " \\param R         The point in which to store the result of the calculation."]
    #[doc = "                  This must be initialized."]
    #[doc = " \\param m         The integer by which to multiply \\p P."]
    #[doc = "                  This must be initialized."]
    #[doc = " \\param P         The point to multiply by \\p m. This must be initialized."]
    #[doc = " \\param n         The integer by which to multiply \\p Q."]
    #[doc = "                  This must be initialized."]
    #[doc = " \\param Q         The point to be multiplied by \\p n."]
    #[doc = "                  This must be initialized."]
    #[doc = ""]
    #[doc = " \\return          \\c 0 on success."]
    #[doc = " \\return          #MBEDTLS_ERR_ECP_INVALID_KEY if \\p m or \\p n are not"]
    #[doc = "                  valid private keys, or \\p P or \\p Q are not valid public"]
    #[doc = "                  keys."]
    #[doc = " \\return          #MBEDTLS_ERR_MPI_ALLOC_FAILED on memory-allocation failure."]
    #[doc = " \\return          #MBEDTLS_ERR_ECP_FEATURE_UNAVAILABLE if \\p grp does not"]
    #[doc = "                  designate a short Weierstrass curve."]
    #[doc = " \\return          Another negative error code on other kinds of failure."]
    #[link_name = "\u{1}mbedtls_ecp_muladd"]
    pub fn ecp_muladd(
        grp: *mut ecp_group,
        R: *mut ecp_point,
        m: *const mpi,
        P: *const ecp_point,
        n: *const mpi,
        Q: *const ecp_point,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief           This function performs multiplication and addition of two"]
    #[doc = "                  points by integers: \\p R = \\p m * \\p P + \\p n * \\p Q in a"]
    #[doc = "                  restartable way."]
    #[doc = ""]
    #[doc = " \\see             \\c mbedtls_ecp_muladd()"]
    #[doc = ""]
    #[doc = " \\note            This function works the same as \\c mbedtls_ecp_muladd(),"]
    #[doc = "                  but it can return early and restart according to the limit"]
    #[doc = "                  set with \\c mbedtls_ecp_set_max_ops() to reduce blocking."]
    #[doc = ""]
    #[doc = " \\note            This function is only defined for short Weierstrass curves."]
    #[doc = "                  It may not be included in builds without any short"]
    #[doc = "                  Weierstrass curve."]
    #[doc = ""]
    #[doc = " \\param grp       The ECP group to use."]
    #[doc = "                  This must be initialized and have group parameters"]
    #[doc = "                  set, for example through mbedtls_ecp_group_load()."]
    #[doc = " \\param R         The point in which to store the result of the calculation."]
    #[doc = "                  This must be initialized."]
    #[doc = " \\param m         The integer by which to multiply \\p P."]
    #[doc = "                  This must be initialized."]
    #[doc = " \\param P         The point to multiply by \\p m. This must be initialized."]
    #[doc = " \\param n         The integer by which to multiply \\p Q."]
    #[doc = "                  This must be initialized."]
    #[doc = " \\param Q         The point to be multiplied by \\p n."]
    #[doc = "                  This must be initialized."]
    #[doc = " \\param rs_ctx    The restart context (NULL disables restart)."]
    #[doc = ""]
    #[doc = " \\return          \\c 0 on success."]
    #[doc = " \\return          #MBEDTLS_ERR_ECP_INVALID_KEY if \\p m or \\p n are not"]
    #[doc = "                  valid private keys, or \\p P or \\p Q are not valid public"]
    #[doc = "                  keys."]
    #[doc = " \\return          #MBEDTLS_ERR_MPI_ALLOC_FAILED on memory-allocation failure."]
    #[doc = " \\return          #MBEDTLS_ERR_ECP_FEATURE_UNAVAILABLE if \\p grp does not"]
    #[doc = "                  designate a short Weierstrass curve."]
    #[doc = " \\return          #MBEDTLS_ERR_ECP_IN_PROGRESS if maximum number of"]
    #[doc = "                  operations was reached: see \\c mbedtls_ecp_set_max_ops()."]
    #[doc = " \\return          Another negative error code on other kinds of failure."]
    #[link_name = "\u{1}mbedtls_ecp_muladd_restartable"]
    pub fn ecp_muladd_restartable(
        grp: *mut ecp_group,
        R: *mut ecp_point,
        m: *const mpi,
        P: *const ecp_point,
        n: *const mpi,
        Q: *const ecp_point,
        rs_ctx: *mut ecp_restart_ctx,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief           This function checks that a point is a valid public key"]
    #[doc = "                  on this curve."]
    #[doc = ""]
    #[doc = "                  It only checks that the point is non-zero, has"]
    #[doc = "                  valid coordinates and lies on the curve. It does not verify"]
    #[doc = "                  that it is indeed a multiple of \\p G. This additional"]
    #[doc = "                  check is computationally more expensive, is not required"]
    #[doc = "                  by standards, and should not be necessary if the group"]
    #[doc = "                  used has a small cofactor. In particular, it is useless for"]
    #[doc = "                  the NIST groups which all have a cofactor of 1."]
    #[doc = ""]
    #[doc = " \\note            This function uses bare components rather than an"]
    #[doc = "                  ::mbedtls_ecp_keypair structure, to ease use with other"]
    #[doc = "                  structures, such as ::mbedtls_ecdh_context or"]
    #[doc = "                  ::mbedtls_ecdsa_context."]
    #[doc = ""]
    #[doc = " \\param grp       The ECP group the point should belong to."]
    #[doc = "                  This must be initialized and have group parameters"]
    #[doc = "                  set, for example through mbedtls_ecp_group_load()."]
    #[doc = " \\param pt        The point to check. This must be initialized."]
    #[doc = ""]
    #[doc = " \\return          \\c 0 if the point is a valid public key."]
    #[doc = " \\return          #MBEDTLS_ERR_ECP_INVALID_KEY if the point is not"]
    #[doc = "                  a valid public key for the given curve."]
    #[doc = " \\return          Another negative error code on other kinds of failure."]
    #[link_name = "\u{1}mbedtls_ecp_check_pubkey"]
    pub fn ecp_check_pubkey(grp: *const ecp_group, pt: *const ecp_point) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief           This function checks that an \\p mbedtls_mpi is a"]
    #[doc = "                  valid private key for this curve."]
    #[doc = ""]
    #[doc = " \\note            This function uses bare components rather than an"]
    #[doc = "                  ::mbedtls_ecp_keypair structure to ease use with other"]
    #[doc = "                  structures, such as ::mbedtls_ecdh_context or"]
    #[doc = "                  ::mbedtls_ecdsa_context."]
    #[doc = ""]
    #[doc = " \\param grp       The ECP group the private key should belong to."]
    #[doc = "                  This must be initialized and have group parameters"]
    #[doc = "                  set, for example through mbedtls_ecp_group_load()."]
    #[doc = " \\param d         The integer to check. This must be initialized."]
    #[doc = ""]
    #[doc = " \\return          \\c 0 if the point is a valid private key."]
    #[doc = " \\return          #MBEDTLS_ERR_ECP_INVALID_KEY if the point is not a valid"]
    #[doc = "                  private key for the given curve."]
    #[doc = " \\return          Another negative error code on other kinds of failure."]
    #[link_name = "\u{1}mbedtls_ecp_check_privkey"]
    pub fn ecp_check_privkey(grp: *const ecp_group, d: *const mpi) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief           This function generates a private key."]
    #[doc = ""]
    #[doc = " \\param grp       The ECP group to generate a private key for."]
    #[doc = "                  This must be initialized and have group parameters"]
    #[doc = "                  set, for example through mbedtls_ecp_group_load()."]
    #[doc = " \\param d         The destination MPI (secret part). This must be initialized."]
    #[doc = " \\param f_rng     The RNG function. This must not be \\c NULL."]
    #[doc = " \\param p_rng     The RNG parameter to be passed to \\p f_rng. This may be"]
    #[doc = "                  \\c NULL if \\p f_rng doesn't need a context argument."]
    #[doc = ""]
    #[doc = " \\return          \\c 0 on success."]
    #[doc = " \\return          An \\c MBEDTLS_ERR_ECP_XXX or \\c MBEDTLS_MPI_XXX error code"]
    #[doc = "                  on failure."]
    #[link_name = "\u{1}mbedtls_ecp_gen_privkey"]
    pub fn ecp_gen_privkey(
        grp: *const ecp_group,
        d: *mut mpi,
        f_rng: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut crate::types::c_void,
                arg2: *mut crate::types::c_uchar,
                arg3: usize,
            ) -> crate::types::c_int,
        >,
        p_rng: *mut crate::types::c_void,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief           This function generates a keypair with a configurable base"]
    #[doc = "                  point."]
    #[doc = ""]
    #[doc = " \\note            This function uses bare components rather than an"]
    #[doc = "                  ::mbedtls_ecp_keypair structure to ease use with other"]
    #[doc = "                  structures, such as ::mbedtls_ecdh_context or"]
    #[doc = "                  ::mbedtls_ecdsa_context."]
    #[doc = ""]
    #[doc = " \\param grp       The ECP group to generate a key pair for."]
    #[doc = "                  This must be initialized and have group parameters"]
    #[doc = "                  set, for example through mbedtls_ecp_group_load()."]
    #[doc = " \\param G         The base point to use. This must be initialized"]
    #[doc = "                  and belong to \\p grp. It replaces the default base"]
    #[doc = "                  point \\c grp->G used by mbedtls_ecp_gen_keypair()."]
    #[doc = " \\param d         The destination MPI (secret part)."]
    #[doc = "                  This must be initialized."]
    #[doc = " \\param Q         The destination point (public part)."]
    #[doc = "                  This must be initialized."]
    #[doc = " \\param f_rng     The RNG function. This must not be \\c NULL."]
    #[doc = " \\param p_rng     The RNG context to be passed to \\p f_rng. This may"]
    #[doc = "                  be \\c NULL if \\p f_rng doesn't need a context argument."]
    #[doc = ""]
    #[doc = " \\return          \\c 0 on success."]
    #[doc = " \\return          An \\c MBEDTLS_ERR_ECP_XXX or \\c MBEDTLS_MPI_XXX error code"]
    #[doc = "                  on failure."]
    #[link_name = "\u{1}mbedtls_ecp_gen_keypair_base"]
    pub fn ecp_gen_keypair_base(
        grp: *mut ecp_group,
        G: *const ecp_point,
        d: *mut mpi,
        Q: *mut ecp_point,
        f_rng: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut crate::types::c_void,
                arg2: *mut crate::types::c_uchar,
                arg3: usize,
            ) -> crate::types::c_int,
        >,
        p_rng: *mut crate::types::c_void,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief           This function generates an ECP keypair."]
    #[doc = ""]
    #[doc = " \\note            This function uses bare components rather than an"]
    #[doc = "                  ::mbedtls_ecp_keypair structure to ease use with other"]
    #[doc = "                  structures, such as ::mbedtls_ecdh_context or"]
    #[doc = "                  ::mbedtls_ecdsa_context."]
    #[doc = ""]
    #[doc = " \\param grp       The ECP group to generate a key pair for."]
    #[doc = "                  This must be initialized and have group parameters"]
    #[doc = "                  set, for example through mbedtls_ecp_group_load()."]
    #[doc = " \\param d         The destination MPI (secret part)."]
    #[doc = "                  This must be initialized."]
    #[doc = " \\param Q         The destination point (public part)."]
    #[doc = "                  This must be initialized."]
    #[doc = " \\param f_rng     The RNG function. This must not be \\c NULL."]
    #[doc = " \\param p_rng     The RNG context to be passed to \\p f_rng. This may"]
    #[doc = "                  be \\c NULL if \\p f_rng doesn't need a context argument."]
    #[doc = ""]
    #[doc = " \\return          \\c 0 on success."]
    #[doc = " \\return          An \\c MBEDTLS_ERR_ECP_XXX or \\c MBEDTLS_MPI_XXX error code"]
    #[doc = "                  on failure."]
    #[link_name = "\u{1}mbedtls_ecp_gen_keypair"]
    pub fn ecp_gen_keypair(
        grp: *mut ecp_group,
        d: *mut mpi,
        Q: *mut ecp_point,
        f_rng: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut crate::types::c_void,
                arg2: *mut crate::types::c_uchar,
                arg3: usize,
            ) -> crate::types::c_int,
        >,
        p_rng: *mut crate::types::c_void,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief           This function generates an ECP key."]
    #[doc = ""]
    #[doc = " \\param grp_id    The ECP group identifier."]
    #[doc = " \\param key       The destination key. This must be initialized."]
    #[doc = " \\param f_rng     The RNG function to use. This must not be \\c NULL."]
    #[doc = " \\param p_rng     The RNG context to be passed to \\p f_rng. This may"]
    #[doc = "                  be \\c NULL if \\p f_rng doesn't need a context argument."]
    #[doc = ""]
    #[doc = " \\return          \\c 0 on success."]
    #[doc = " \\return          An \\c MBEDTLS_ERR_ECP_XXX or \\c MBEDTLS_MPI_XXX error code"]
    #[doc = "                  on failure."]
    #[link_name = "\u{1}mbedtls_ecp_gen_key"]
    pub fn ecp_gen_key(
        grp_id: ecp_group_id,
        key: *mut ecp_keypair,
        f_rng: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut crate::types::c_void,
                arg2: *mut crate::types::c_uchar,
                arg3: usize,
            ) -> crate::types::c_int,
        >,
        p_rng: *mut crate::types::c_void,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief           This function reads an elliptic curve private key."]
    #[doc = ""]
    #[doc = " \\param grp_id    The ECP group identifier."]
    #[doc = " \\param key       The destination key."]
    #[doc = " \\param buf       The the buffer containing the binary representation of the"]
    #[doc = "                  key. (Big endian integer for Weierstrass curves, byte"]
    #[doc = "                  string for Montgomery curves.)"]
    #[doc = " \\param buflen    The length of the buffer in bytes."]
    #[doc = ""]
    #[doc = " \\return          \\c 0 on success."]
    #[doc = " \\return          #MBEDTLS_ERR_ECP_INVALID_KEY error if the key is"]
    #[doc = "                  invalid."]
    #[doc = " \\return          #MBEDTLS_ERR_MPI_ALLOC_FAILED if memory allocation failed."]
    #[doc = " \\return          #MBEDTLS_ERR_ECP_FEATURE_UNAVAILABLE if the operation for"]
    #[doc = "                  the group is not implemented."]
    #[doc = " \\return          Another negative error code on different kinds of failure."]
    #[link_name = "\u{1}mbedtls_ecp_read_key"]
    pub fn ecp_read_key(
        grp_id: ecp_group_id,
        key: *mut ecp_keypair,
        buf: *const crate::types::c_uchar,
        buflen: usize,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief           This function exports an elliptic curve private key."]
    #[doc = ""]
    #[doc = " \\param key       The private key."]
    #[doc = " \\param buf       The output buffer for containing the binary representation"]
    #[doc = "                  of the key. (Big endian integer for Weierstrass curves, byte"]
    #[doc = "                  string for Montgomery curves.)"]
    #[doc = " \\param buflen    The total length of the buffer in bytes."]
    #[doc = ""]
    #[doc = " \\return          \\c 0 on success."]
    #[doc = " \\return          #MBEDTLS_ERR_ECP_BUFFER_TOO_SMALL if the \\p key"]
    #[doc = "representation is larger than the available space in \\p buf."]
    #[doc = " \\return          #MBEDTLS_ERR_ECP_FEATURE_UNAVAILABLE if the operation for"]
    #[doc = "                  the group is not implemented."]
    #[doc = " \\return          Another negative error code on different kinds of failure."]
    #[link_name = "\u{1}mbedtls_ecp_write_key"]
    pub fn ecp_write_key(
        key: *mut ecp_keypair,
        buf: *mut crate::types::c_uchar,
        buflen: usize,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief           This function checks that the keypair objects"]
    #[doc = "                  \\p pub and \\p prv have the same group and the"]
    #[doc = "                  same public point, and that the private key in"]
    #[doc = "                  \\p prv is consistent with the public key."]
    #[doc = ""]
    #[doc = " \\param pub       The keypair structure holding the public key. This"]
    #[doc = "                  must be initialized. If it contains a private key, that"]
    #[doc = "                  part is ignored."]
    #[doc = " \\param prv       The keypair structure holding the full keypair."]
    #[doc = "                  This must be initialized."]
    #[doc = ""]
    #[doc = " \\return          \\c 0 on success, meaning that the keys are valid and match."]
    #[doc = " \\return          #MBEDTLS_ERR_ECP_BAD_INPUT_DATA if the keys are invalid or do not match."]
    #[doc = " \\return          An \\c MBEDTLS_ERR_ECP_XXX or an \\c MBEDTLS_ERR_MPI_XXX"]
    #[doc = "                  error code on calculation failure."]
    #[link_name = "\u{1}mbedtls_ecp_check_pub_priv"]
    pub fn ecp_check_pub_priv(
        pub_: *const ecp_keypair,
        prv: *const ecp_keypair,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief          The ECP checkup routine."]
    #[doc = ""]
    #[doc = " \\return         \\c 0 on success."]
    #[doc = " \\return         \\c 1 on failure."]
    #[link_name = "\u{1}mbedtls_ecp_self_test"]
    pub fn ecp_self_test(verbose: crate::types::c_int) -> crate::types::c_int;
}
#[doc = " \\brief   The RSA context structure."]
#[doc = ""]
#[doc = " \\note    Direct manipulation of the members of this structure"]
#[doc = "          is deprecated. All manipulation should instead be done through"]
#[doc = "          the public interface functions."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rsa_context {
    #[doc = "<  Reserved for internal purposes."]
    #[doc = "    Do not set this field in application"]
    #[doc = "    code. Its meaning might change without"]
    #[doc = "    notice."]
    pub ver: crate::types::c_int,
    #[doc = "<  The size of \\p N in Bytes."]
    pub len: usize,
    #[doc = "<  The public modulus."]
    pub N: mpi,
    #[doc = "<  The public exponent."]
    pub E: mpi,
    #[doc = "<  The private exponent."]
    pub D: mpi,
    #[doc = "<  The first prime factor."]
    pub P: mpi,
    #[doc = "<  The second prime factor."]
    pub Q: mpi,
    #[doc = "<  <code>D % (P - 1)</code>."]
    pub DP: mpi,
    #[doc = "<  <code>D % (Q - 1)</code>."]
    pub DQ: mpi,
    #[doc = "<  <code>1 / (Q % P)</code>."]
    pub QP: mpi,
    #[doc = "<  cached <code>R^2 mod N</code>."]
    pub RN: mpi,
    #[doc = "<  cached <code>R^2 mod P</code>."]
    pub RP: mpi,
    #[doc = "<  cached <code>R^2 mod Q</code>."]
    pub RQ: mpi,
    #[doc = "<  The cached blinding value."]
    pub Vi: mpi,
    #[doc = "<  The cached un-blinding value."]
    pub Vf: mpi,
    #[doc = "< Selects padding mode:"]
    #[doc = "#MBEDTLS_RSA_PKCS_V15 for 1.5 padding and"]
    #[doc = "#MBEDTLS_RSA_PKCS_V21 for OAEP or PSS."]
    pub padding: crate::types::c_int,
    #[doc = "< Hash identifier of mbedtls_md_type_t type,"]
    #[doc = "as specified in md.h for use in the MGF"]
    #[doc = "mask generating function used in the"]
    #[doc = "EME-OAEP and EMSA-PSS encodings."]
    pub hash_id: crate::types::c_int,
}
#[test]
fn bindgen_test_layout_rsa_context() {
    assert_eq!(
        ::core::mem::size_of::<rsa_context>(),
        172usize,
        concat!("Size of: ", stringify!(rsa_context))
    );
    assert_eq!(
        ::core::mem::align_of::<rsa_context>(),
        4usize,
        concat!("Alignment of ", stringify!(rsa_context))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rsa_context>())).ver as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rsa_context),
            "::",
            stringify!(ver)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rsa_context>())).len as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rsa_context),
            "::",
            stringify!(len)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rsa_context>())).N as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rsa_context),
            "::",
            stringify!(N)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rsa_context>())).E as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(rsa_context),
            "::",
            stringify!(E)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rsa_context>())).D as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(rsa_context),
            "::",
            stringify!(D)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rsa_context>())).P as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(rsa_context),
            "::",
            stringify!(P)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rsa_context>())).Q as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(rsa_context),
            "::",
            stringify!(Q)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rsa_context>())).DP as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(rsa_context),
            "::",
            stringify!(DP)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rsa_context>())).DQ as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(rsa_context),
            "::",
            stringify!(DQ)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rsa_context>())).QP as *const _ as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(rsa_context),
            "::",
            stringify!(QP)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rsa_context>())).RN as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(rsa_context),
            "::",
            stringify!(RN)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rsa_context>())).RP as *const _ as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(rsa_context),
            "::",
            stringify!(RP)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rsa_context>())).RQ as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(rsa_context),
            "::",
            stringify!(RQ)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rsa_context>())).Vi as *const _ as usize },
        140usize,
        concat!(
            "Offset of field: ",
            stringify!(rsa_context),
            "::",
            stringify!(Vi)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rsa_context>())).Vf as *const _ as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(rsa_context),
            "::",
            stringify!(Vf)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rsa_context>())).padding as *const _ as usize },
        164usize,
        concat!(
            "Offset of field: ",
            stringify!(rsa_context),
            "::",
            stringify!(padding)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<rsa_context>())).hash_id as *const _ as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(rsa_context),
            "::",
            stringify!(hash_id)
        )
    );
}
impl Default for rsa_context {
    fn default() -> Self {
        unsafe { ::core::mem::zeroed() }
    }
}
extern "C" {
    #[doc = " \\brief          This function initializes an RSA context."]
    #[doc = ""]
    #[doc = " \\note           Set padding to #MBEDTLS_RSA_PKCS_V21 for the RSAES-OAEP"]
    #[doc = "                 encryption scheme and the RSASSA-PSS signature scheme."]
    #[doc = ""]
    #[doc = " \\note           The \\p hash_id parameter is ignored when using"]
    #[doc = "                 #MBEDTLS_RSA_PKCS_V15 padding."]
    #[doc = ""]
    #[doc = " \\note           The choice of padding mode is strictly enforced for private key"]
    #[doc = "                 operations, since there might be security concerns in"]
    #[doc = "                 mixing padding modes. For public key operations it is"]
    #[doc = "                 a default value, which can be overridden by calling specific"]
    #[doc = "                 \\c rsa_rsaes_xxx or \\c rsa_rsassa_xxx functions."]
    #[doc = ""]
    #[doc = " \\note           The hash selected in \\p hash_id is always used for OEAP"]
    #[doc = "                 encryption. For PSS signatures, it is always used for"]
    #[doc = "                 making signatures, but can be overridden for verifying them."]
    #[doc = "                 If set to #MBEDTLS_MD_NONE, it is always overridden."]
    #[doc = ""]
    #[doc = " \\param ctx      The RSA context to initialize. This must not be \\c NULL."]
    #[doc = " \\param padding  The padding mode to use. This must be either"]
    #[doc = "                 #MBEDTLS_RSA_PKCS_V15 or #MBEDTLS_RSA_PKCS_V21."]
    #[doc = " \\param hash_id  The hash identifier of ::mbedtls_md_type_t type, if"]
    #[doc = "                 \\p padding is #MBEDTLS_RSA_PKCS_V21. It is unused"]
    #[doc = "                 otherwise."]
    #[link_name = "\u{1}mbedtls_rsa_init"]
    pub fn rsa_init(
        ctx: *mut rsa_context,
        padding: crate::types::c_int,
        hash_id: crate::types::c_int,
    );
}
extern "C" {
    #[doc = " \\brief          This function imports a set of core parameters into an"]
    #[doc = "                 RSA context."]
    #[doc = ""]
    #[doc = " \\note           This function can be called multiple times for successive"]
    #[doc = "                 imports, if the parameters are not simultaneously present."]
    #[doc = ""]
    #[doc = "                 Any sequence of calls to this function should be followed"]
    #[doc = "                 by a call to mbedtls_rsa_complete(), which checks and"]
    #[doc = "                 completes the provided information to a ready-for-use"]
    #[doc = "                 public or private RSA key."]
    #[doc = ""]
    #[doc = " \\note           See mbedtls_rsa_complete() for more information on which"]
    #[doc = "                 parameters are necessary to set up a private or public"]
    #[doc = "                 RSA key."]
    #[doc = ""]
    #[doc = " \\note           The imported parameters are copied and need not be preserved"]
    #[doc = "                 for the lifetime of the RSA context being set up."]
    #[doc = ""]
    #[doc = " \\param ctx      The initialized RSA context to store the parameters in."]
    #[doc = " \\param N        The RSA modulus. This may be \\c NULL."]
    #[doc = " \\param P        The first prime factor of \\p N. This may be \\c NULL."]
    #[doc = " \\param Q        The second prime factor of \\p N. This may be \\c NULL."]
    #[doc = " \\param D        The private exponent. This may be \\c NULL."]
    #[doc = " \\param E        The public exponent. This may be \\c NULL."]
    #[doc = ""]
    #[doc = " \\return         \\c 0 on success."]
    #[doc = " \\return         A non-zero error code on failure."]
    #[link_name = "\u{1}mbedtls_rsa_import"]
    pub fn rsa_import(
        ctx: *mut rsa_context,
        N: *const mpi,
        P: *const mpi,
        Q: *const mpi,
        D: *const mpi,
        E: *const mpi,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief          This function imports core RSA parameters, in raw big-endian"]
    #[doc = "                 binary format, into an RSA context."]
    #[doc = ""]
    #[doc = " \\note           This function can be called multiple times for successive"]
    #[doc = "                 imports, if the parameters are not simultaneously present."]
    #[doc = ""]
    #[doc = "                 Any sequence of calls to this function should be followed"]
    #[doc = "                 by a call to mbedtls_rsa_complete(), which checks and"]
    #[doc = "                 completes the provided information to a ready-for-use"]
    #[doc = "                 public or private RSA key."]
    #[doc = ""]
    #[doc = " \\note           See mbedtls_rsa_complete() for more information on which"]
    #[doc = "                 parameters are necessary to set up a private or public"]
    #[doc = "                 RSA key."]
    #[doc = ""]
    #[doc = " \\note           The imported parameters are copied and need not be preserved"]
    #[doc = "                 for the lifetime of the RSA context being set up."]
    #[doc = ""]
    #[doc = " \\param ctx      The initialized RSA context to store the parameters in."]
    #[doc = " \\param N        The RSA modulus. This may be \\c NULL."]
    #[doc = " \\param N_len    The Byte length of \\p N; it is ignored if \\p N == NULL."]
    #[doc = " \\param P        The first prime factor of \\p N. This may be \\c NULL."]
    #[doc = " \\param P_len    The Byte length of \\p P; it ns ignored if \\p P == NULL."]
    #[doc = " \\param Q        The second prime factor of \\p N. This may be \\c NULL."]
    #[doc = " \\param Q_len    The Byte length of \\p Q; it is ignored if \\p Q == NULL."]
    #[doc = " \\param D        The private exponent. This may be \\c NULL."]
    #[doc = " \\param D_len    The Byte length of \\p D; it is ignored if \\p D == NULL."]
    #[doc = " \\param E        The public exponent. This may be \\c NULL."]
    #[doc = " \\param E_len    The Byte length of \\p E; it is ignored if \\p E == NULL."]
    #[doc = ""]
    #[doc = " \\return         \\c 0 on success."]
    #[doc = " \\return         A non-zero error code on failure."]
    #[link_name = "\u{1}mbedtls_rsa_import_raw"]
    pub fn rsa_import_raw(
        ctx: *mut rsa_context,
        N: *const crate::types::c_uchar,
        N_len: usize,
        P: *const crate::types::c_uchar,
        P_len: usize,
        Q: *const crate::types::c_uchar,
        Q_len: usize,
        D: *const crate::types::c_uchar,
        D_len: usize,
        E: *const crate::types::c_uchar,
        E_len: usize,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief          This function completes an RSA context from"]
    #[doc = "                 a set of imported core parameters."]
    #[doc = ""]
    #[doc = "                 To setup an RSA public key, precisely \\p N and \\p E"]
    #[doc = "                 must have been imported."]
    #[doc = ""]
    #[doc = "                 To setup an RSA private key, sufficient information must"]
    #[doc = "                 be present for the other parameters to be derivable."]
    #[doc = ""]
    #[doc = "                 The default implementation supports the following:"]
    #[doc = "                 <ul><li>Derive \\p P, \\p Q from \\p N, \\p D, \\p E.</li>"]
    #[doc = "                 <li>Derive \\p N, \\p D from \\p P, \\p Q, \\p E.</li></ul>"]
    #[doc = "                 Alternative implementations need not support these."]
    #[doc = ""]
    #[doc = "                 If this function runs successfully, it guarantees that"]
    #[doc = "                 the RSA context can be used for RSA operations without"]
    #[doc = "                 the risk of failure or crash."]
    #[doc = ""]
    #[doc = " \\warning        This function need not perform consistency checks"]
    #[doc = "                 for the imported parameters. In particular, parameters that"]
    #[doc = "                 are not needed by the implementation might be silently"]
    #[doc = "                 discarded and left unchecked. To check the consistency"]
    #[doc = "                 of the key material, see mbedtls_rsa_check_privkey()."]
    #[doc = ""]
    #[doc = " \\param ctx      The initialized RSA context holding imported parameters."]
    #[doc = ""]
    #[doc = " \\return         \\c 0 on success."]
    #[doc = " \\return         #MBEDTLS_ERR_RSA_BAD_INPUT_DATA if the attempted derivations"]
    #[doc = "                 failed."]
    #[doc = ""]
    #[link_name = "\u{1}mbedtls_rsa_complete"]
    pub fn rsa_complete(ctx: *mut rsa_context) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief          This function exports the core parameters of an RSA key."]
    #[doc = ""]
    #[doc = "                 If this function runs successfully, the non-NULL buffers"]
    #[doc = "                 pointed to by \\p N, \\p P, \\p Q, \\p D, and \\p E are fully"]
    #[doc = "                 written, with additional unused space filled leading by"]
    #[doc = "                 zero Bytes."]
    #[doc = ""]
    #[doc = "                 Possible reasons for returning"]
    #[doc = "                 #MBEDTLS_ERR_PLATFORM_FEATURE_UNSUPPORTED:<ul>"]
    #[doc = "                 <li>An alternative RSA implementation is in use, which"]
    #[doc = "                 stores the key externally, and either cannot or should"]
    #[doc = "                 not export it into RAM.</li>"]
    #[doc = "                 <li>A SW or HW implementation might not support a certain"]
    #[doc = "                 deduction. For example, \\p P, \\p Q from \\p N, \\p D,"]
    #[doc = "                 and \\p E if the former are not part of the"]
    #[doc = "                 implementation.</li></ul>"]
    #[doc = ""]
    #[doc = "                 If the function fails due to an unsupported operation,"]
    #[doc = "                 the RSA context stays intact and remains usable."]
    #[doc = ""]
    #[doc = " \\param ctx      The initialized RSA context."]
    #[doc = " \\param N        The MPI to hold the RSA modulus."]
    #[doc = "                 This may be \\c NULL if this field need not be exported."]
    #[doc = " \\param P        The MPI to hold the first prime factor of \\p N."]
    #[doc = "                 This may be \\c NULL if this field need not be exported."]
    #[doc = " \\param Q        The MPI to hold the second prime factor of \\p N."]
    #[doc = "                 This may be \\c NULL if this field need not be exported."]
    #[doc = " \\param D        The MPI to hold the private exponent."]
    #[doc = "                 This may be \\c NULL if this field need not be exported."]
    #[doc = " \\param E        The MPI to hold the public exponent."]
    #[doc = "                 This may be \\c NULL if this field need not be exported."]
    #[doc = ""]
    #[doc = " \\return         \\c 0 on success."]
    #[doc = " \\return         #MBEDTLS_ERR_PLATFORM_FEATURE_UNSUPPORTED if exporting the"]
    #[doc = "                 requested parameters cannot be done due to missing"]
    #[doc = "                 functionality or because of security policies."]
    #[doc = " \\return         A non-zero return code on any other failure."]
    #[doc = ""]
    #[link_name = "\u{1}mbedtls_rsa_export"]
    pub fn rsa_export(
        ctx: *const rsa_context,
        N: *mut mpi,
        P: *mut mpi,
        Q: *mut mpi,
        D: *mut mpi,
        E: *mut mpi,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief          This function exports core parameters of an RSA key"]
    #[doc = "                 in raw big-endian binary format."]
    #[doc = ""]
    #[doc = "                 If this function runs successfully, the non-NULL buffers"]
    #[doc = "                 pointed to by \\p N, \\p P, \\p Q, \\p D, and \\p E are fully"]
    #[doc = "                 written, with additional unused space filled leading by"]
    #[doc = "                 zero Bytes."]
    #[doc = ""]
    #[doc = "                 Possible reasons for returning"]
    #[doc = "                 #MBEDTLS_ERR_PLATFORM_FEATURE_UNSUPPORTED:<ul>"]
    #[doc = "                 <li>An alternative RSA implementation is in use, which"]
    #[doc = "                 stores the key externally, and either cannot or should"]
    #[doc = "                 not export it into RAM.</li>"]
    #[doc = "                 <li>A SW or HW implementation might not support a certain"]
    #[doc = "                 deduction. For example, \\p P, \\p Q from \\p N, \\p D,"]
    #[doc = "                 and \\p E if the former are not part of the"]
    #[doc = "                 implementation.</li></ul>"]
    #[doc = "                 If the function fails due to an unsupported operation,"]
    #[doc = "                 the RSA context stays intact and remains usable."]
    #[doc = ""]
    #[doc = " \\note           The length parameters are ignored if the corresponding"]
    #[doc = "                 buffer pointers are NULL."]
    #[doc = ""]
    #[doc = " \\param ctx      The initialized RSA context."]
    #[doc = " \\param N        The Byte array to store the RSA modulus,"]
    #[doc = "                 or \\c NULL if this field need not be exported."]
    #[doc = " \\param N_len    The size of the buffer for the modulus."]
    #[doc = " \\param P        The Byte array to hold the first prime factor of \\p N,"]
    #[doc = "                 or \\c NULL if this field need not be exported."]
    #[doc = " \\param P_len    The size of the buffer for the first prime factor."]
    #[doc = " \\param Q        The Byte array to hold the second prime factor of \\p N,"]
    #[doc = "                 or \\c NULL if this field need not be exported."]
    #[doc = " \\param Q_len    The size of the buffer for the second prime factor."]
    #[doc = " \\param D        The Byte array to hold the private exponent,"]
    #[doc = "                 or \\c NULL if this field need not be exported."]
    #[doc = " \\param D_len    The size of the buffer for the private exponent."]
    #[doc = " \\param E        The Byte array to hold the public exponent,"]
    #[doc = "                 or \\c NULL if this field need not be exported."]
    #[doc = " \\param E_len    The size of the buffer for the public exponent."]
    #[doc = ""]
    #[doc = " \\return         \\c 0 on success."]
    #[doc = " \\return         #MBEDTLS_ERR_PLATFORM_FEATURE_UNSUPPORTED if exporting the"]
    #[doc = "                 requested parameters cannot be done due to missing"]
    #[doc = "                 functionality or because of security policies."]
    #[doc = " \\return         A non-zero return code on any other failure."]
    #[link_name = "\u{1}mbedtls_rsa_export_raw"]
    pub fn rsa_export_raw(
        ctx: *const rsa_context,
        N: *mut crate::types::c_uchar,
        N_len: usize,
        P: *mut crate::types::c_uchar,
        P_len: usize,
        Q: *mut crate::types::c_uchar,
        Q_len: usize,
        D: *mut crate::types::c_uchar,
        D_len: usize,
        E: *mut crate::types::c_uchar,
        E_len: usize,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief          This function exports CRT parameters of a private RSA key."]
    #[doc = ""]
    #[doc = " \\note           Alternative RSA implementations not using CRT-parameters"]
    #[doc = "                 internally can implement this function based on"]
    #[doc = "                 mbedtls_rsa_deduce_opt()."]
    #[doc = ""]
    #[doc = " \\param ctx      The initialized RSA context."]
    #[doc = " \\param DP       The MPI to hold \\c D modulo `P-1`,"]
    #[doc = "                 or \\c NULL if it need not be exported."]
    #[doc = " \\param DQ       The MPI to hold \\c D modulo `Q-1`,"]
    #[doc = "                 or \\c NULL if it need not be exported."]
    #[doc = " \\param QP       The MPI to hold modular inverse of \\c Q modulo \\c P,"]
    #[doc = "                 or \\c NULL if it need not be exported."]
    #[doc = ""]
    #[doc = " \\return         \\c 0 on success."]
    #[doc = " \\return         A non-zero error code on failure."]
    #[doc = ""]
    #[link_name = "\u{1}mbedtls_rsa_export_crt"]
    pub fn rsa_export_crt(
        ctx: *const rsa_context,
        DP: *mut mpi,
        DQ: *mut mpi,
        QP: *mut mpi,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief          This function sets padding for an already initialized RSA"]
    #[doc = "                 context. See mbedtls_rsa_init() for details."]
    #[doc = ""]
    #[doc = " \\param ctx      The initialized RSA context to be configured."]
    #[doc = " \\param padding  The padding mode to use. This must be either"]
    #[doc = "                 #MBEDTLS_RSA_PKCS_V15 or #MBEDTLS_RSA_PKCS_V21."]
    #[doc = " \\param hash_id  The #MBEDTLS_RSA_PKCS_V21 hash identifier."]
    #[link_name = "\u{1}mbedtls_rsa_set_padding"]
    pub fn rsa_set_padding(
        ctx: *mut rsa_context,
        padding: crate::types::c_int,
        hash_id: crate::types::c_int,
    );
}
extern "C" {
    #[doc = " \\brief          This function retrieves the length of RSA modulus in Bytes."]
    #[doc = ""]
    #[doc = " \\param ctx      The initialized RSA context."]
    #[doc = ""]
    #[doc = " \\return         The length of the RSA modulus in Bytes."]
    #[doc = ""]
    #[link_name = "\u{1}mbedtls_rsa_get_len"]
    pub fn rsa_get_len(ctx: *const rsa_context) -> usize;
}
extern "C" {
    #[doc = " \\brief          This function generates an RSA keypair."]
    #[doc = ""]
    #[doc = " \\note           mbedtls_rsa_init() must be called before this function,"]
    #[doc = "                 to set up the RSA context."]
    #[doc = ""]
    #[doc = " \\param ctx      The initialized RSA context used to hold the key."]
    #[doc = " \\param f_rng    The RNG function to be used for key generation."]
    #[doc = "                 This must not be \\c NULL."]
    #[doc = " \\param p_rng    The RNG context to be passed to \\p f_rng."]
    #[doc = "                 This may be \\c NULL if \\p f_rng doesn't need a context."]
    #[doc = " \\param nbits    The size of the public key in bits."]
    #[doc = " \\param exponent The public exponent to use. For example, \\c 65537."]
    #[doc = "                 This must be odd and greater than \\c 1."]
    #[doc = ""]
    #[doc = " \\return         \\c 0 on success."]
    #[doc = " \\return         An \\c MBEDTLS_ERR_RSA_XXX error code on failure."]
    #[link_name = "\u{1}mbedtls_rsa_gen_key"]
    pub fn rsa_gen_key(
        ctx: *mut rsa_context,
        f_rng: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut crate::types::c_void,
                arg2: *mut crate::types::c_uchar,
                arg3: usize,
            ) -> crate::types::c_int,
        >,
        p_rng: *mut crate::types::c_void,
        nbits: crate::types::c_uint,
        exponent: crate::types::c_int,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief          This function checks if a context contains at least an RSA"]
    #[doc = "                 public key."]
    #[doc = ""]
    #[doc = "                 If the function runs successfully, it is guaranteed that"]
    #[doc = "                 enough information is present to perform an RSA public key"]
    #[doc = "                 operation using mbedtls_rsa_public()."]
    #[doc = ""]
    #[doc = " \\param ctx      The initialized RSA context to check."]
    #[doc = ""]
    #[doc = " \\return         \\c 0 on success."]
    #[doc = " \\return         An \\c MBEDTLS_ERR_RSA_XXX error code on failure."]
    #[doc = ""]
    #[link_name = "\u{1}mbedtls_rsa_check_pubkey"]
    pub fn rsa_check_pubkey(ctx: *const rsa_context) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief      This function checks if a context contains an RSA private key"]
    #[doc = "             and perform basic consistency checks."]
    #[doc = ""]
    #[doc = " \\note       The consistency checks performed by this function not only"]
    #[doc = "             ensure that mbedtls_rsa_private() can be called successfully"]
    #[doc = "             on the given context, but that the various parameters are"]
    #[doc = "             mutually consistent with high probability, in the sense that"]
    #[doc = "             mbedtls_rsa_public() and mbedtls_rsa_private() are inverses."]
    #[doc = ""]
    #[doc = " \\warning    This function should catch accidental misconfigurations"]
    #[doc = "             like swapping of parameters, but it cannot establish full"]
    #[doc = "             trust in neither the quality nor the consistency of the key"]
    #[doc = "             material that was used to setup the given RSA context:"]
    #[doc = "             <ul><li>Consistency: Imported parameters that are irrelevant"]
    #[doc = "             for the implementation might be silently dropped. If dropped,"]
    #[doc = "             the current function does not have access to them,"]
    #[doc = "             and therefore cannot check them. See mbedtls_rsa_complete()."]
    #[doc = "             If you want to check the consistency of the entire"]
    #[doc = "             content of an PKCS1-encoded RSA private key, for example, you"]
    #[doc = "             should use mbedtls_rsa_validate_params() before setting"]
    #[doc = "             up the RSA context."]
    #[doc = "             Additionally, if the implementation performs empirical checks,"]
    #[doc = "             these checks substantiate but do not guarantee consistency.</li>"]
    #[doc = "             <li>Quality: This function is not expected to perform"]
    #[doc = "             extended quality assessments like checking that the prime"]
    #[doc = "             factors are safe. Additionally, it is the responsibility of the"]
    #[doc = "             user to ensure the trustworthiness of the source of his RSA"]
    #[doc = "             parameters, which goes beyond what is effectively checkable"]
    #[doc = "             by the library.</li></ul>"]
    #[doc = ""]
    #[doc = " \\param ctx  The initialized RSA context to check."]
    #[doc = ""]
    #[doc = " \\return     \\c 0 on success."]
    #[doc = " \\return     An \\c MBEDTLS_ERR_RSA_XXX error code on failure."]
    #[link_name = "\u{1}mbedtls_rsa_check_privkey"]
    pub fn rsa_check_privkey(ctx: *const rsa_context) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief          This function checks a public-private RSA key pair."]
    #[doc = ""]
    #[doc = "                 It checks each of the contexts, and makes sure they match."]
    #[doc = ""]
    #[doc = " \\param pub      The initialized RSA context holding the public key."]
    #[doc = " \\param prv      The initialized RSA context holding the private key."]
    #[doc = ""]
    #[doc = " \\return         \\c 0 on success."]
    #[doc = " \\return         An \\c MBEDTLS_ERR_RSA_XXX error code on failure."]
    #[link_name = "\u{1}mbedtls_rsa_check_pub_priv"]
    pub fn rsa_check_pub_priv(
        pub_: *const rsa_context,
        prv: *const rsa_context,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief          This function performs an RSA public key operation."]
    #[doc = ""]
    #[doc = " \\param ctx      The initialized RSA context to use."]
    #[doc = " \\param input    The input buffer. This must be a readable buffer"]
    #[doc = "                 of length \\c ctx->len Bytes. For example, \\c 256 Bytes"]
    #[doc = "                 for an 2048-bit RSA modulus."]
    #[doc = " \\param output   The output buffer. This must be a writable buffer"]
    #[doc = "                 of length \\c ctx->len Bytes. For example, \\c 256 Bytes"]
    #[doc = "                 for an 2048-bit RSA modulus."]
    #[doc = ""]
    #[doc = " \\note           This function does not handle message padding."]
    #[doc = ""]
    #[doc = " \\note           Make sure to set \\p input[0] = 0 or ensure that"]
    #[doc = "                 input is smaller than \\p N."]
    #[doc = ""]
    #[doc = " \\return         \\c 0 on success."]
    #[doc = " \\return         An \\c MBEDTLS_ERR_RSA_XXX error code on failure."]
    #[link_name = "\u{1}mbedtls_rsa_public"]
    pub fn rsa_public(
        ctx: *mut rsa_context,
        input: *const crate::types::c_uchar,
        output: *mut crate::types::c_uchar,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief          This function performs an RSA private key operation."]
    #[doc = ""]
    #[doc = " \\note           Blinding is used if and only if a PRNG is provided."]
    #[doc = ""]
    #[doc = " \\note           If blinding is used, both the base of exponentation"]
    #[doc = "                 and the exponent are blinded, providing protection"]
    #[doc = "                 against some side-channel attacks."]
    #[doc = ""]
    #[doc = " \\warning        It is deprecated and a security risk to not provide"]
    #[doc = "                 a PRNG here and thereby prevent the use of blinding."]
    #[doc = "                 Future versions of the library may enforce the presence"]
    #[doc = "                 of a PRNG."]
    #[doc = ""]
    #[doc = " \\param ctx      The initialized RSA context to use."]
    #[doc = " \\param f_rng    The RNG function, used for blinding. It is discouraged"]
    #[doc = "                 and deprecated to pass \\c NULL here, in which case"]
    #[doc = "                 blinding will be omitted."]
    #[doc = " \\param p_rng    The RNG context to pass to \\p f_rng. This may be \\c NULL"]
    #[doc = "                 if \\p f_rng is \\c NULL or if \\p f_rng doesn't need a context."]
    #[doc = " \\param input    The input buffer. This must be a readable buffer"]
    #[doc = "                 of length \\c ctx->len Bytes. For example, \\c 256 Bytes"]
    #[doc = "                 for an 2048-bit RSA modulus."]
    #[doc = " \\param output   The output buffer. This must be a writable buffer"]
    #[doc = "                 of length \\c ctx->len Bytes. For example, \\c 256 Bytes"]
    #[doc = "                 for an 2048-bit RSA modulus."]
    #[doc = ""]
    #[doc = " \\return         \\c 0 on success."]
    #[doc = " \\return         An \\c MBEDTLS_ERR_RSA_XXX error code on failure."]
    #[doc = ""]
    #[link_name = "\u{1}mbedtls_rsa_private"]
    pub fn rsa_private(
        ctx: *mut rsa_context,
        f_rng: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut crate::types::c_void,
                arg2: *mut crate::types::c_uchar,
                arg3: usize,
            ) -> crate::types::c_int,
        >,
        p_rng: *mut crate::types::c_void,
        input: *const crate::types::c_uchar,
        output: *mut crate::types::c_uchar,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief          This function adds the message padding, then performs an RSA"]
    #[doc = "                 operation."]
    #[doc = ""]
    #[doc = "                 It is the generic wrapper for performing a PKCS#1 encryption"]
    #[doc = "                 operation using the \\p mode from the context."]
    #[doc = ""]
    #[doc = " \\deprecated     It is deprecated and discouraged to call this function"]
    #[doc = "                 in #MBEDTLS_RSA_PRIVATE mode. Future versions of the library"]
    #[doc = "                 are likely to remove the \\p mode argument and have it"]
    #[doc = "                 implicitly set to #MBEDTLS_RSA_PUBLIC."]
    #[doc = ""]
    #[doc = " \\note           Alternative implementations of RSA need not support"]
    #[doc = "                 mode being set to #MBEDTLS_RSA_PRIVATE and might instead"]
    #[doc = "                 return #MBEDTLS_ERR_PLATFORM_FEATURE_UNSUPPORTED."]
    #[doc = ""]
    #[doc = " \\param ctx      The initialized RSA context to use."]
    #[doc = " \\param f_rng    The RNG to use. It is mandatory for PKCS#1 v2.1 padding"]
    #[doc = "                 encoding, and for PKCS#1 v1.5 padding encoding when used"]
    #[doc = "                 with \\p mode set to #MBEDTLS_RSA_PUBLIC. For PKCS#1 v1.5"]
    #[doc = "                 padding encoding and \\p mode set to #MBEDTLS_RSA_PRIVATE,"]
    #[doc = "                 it is used for blinding and should be provided in this"]
    #[doc = "                 case; see mbedtls_rsa_private() for more."]
    #[doc = " \\param p_rng    The RNG context to be passed to \\p f_rng. May be"]
    #[doc = "                 \\c NULL if \\p f_rng is \\c NULL or if \\p f_rng doesn't"]
    #[doc = "                 need a context argument."]
    #[doc = " \\param mode     The mode of operation. This must be either"]
    #[doc = "                 #MBEDTLS_RSA_PUBLIC or #MBEDTLS_RSA_PRIVATE (deprecated)."]
    #[doc = " \\param ilen     The length of the plaintext in Bytes."]
    #[doc = " \\param input    The input data to encrypt. This must be a readable"]
    #[doc = "                 buffer of size \\p ilen Bytes. It may be \\c NULL if"]
    #[doc = "                 `ilen == 0`."]
    #[doc = " \\param output   The output buffer. This must be a writable buffer"]
    #[doc = "                 of length \\c ctx->len Bytes. For example, \\c 256 Bytes"]
    #[doc = "                 for an 2048-bit RSA modulus."]
    #[doc = ""]
    #[doc = " \\return         \\c 0 on success."]
    #[doc = " \\return         An \\c MBEDTLS_ERR_RSA_XXX error code on failure."]
    #[link_name = "\u{1}mbedtls_rsa_pkcs1_encrypt"]
    pub fn rsa_pkcs1_encrypt(
        ctx: *mut rsa_context,
        f_rng: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut crate::types::c_void,
                arg2: *mut crate::types::c_uchar,
                arg3: usize,
            ) -> crate::types::c_int,
        >,
        p_rng: *mut crate::types::c_void,
        mode: crate::types::c_int,
        ilen: usize,
        input: *const crate::types::c_uchar,
        output: *mut crate::types::c_uchar,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief          This function performs a PKCS#1 v1.5 encryption operation"]
    #[doc = "                 (RSAES-PKCS1-v1_5-ENCRYPT)."]
    #[doc = ""]
    #[doc = " \\deprecated     It is deprecated and discouraged to call this function"]
    #[doc = "                 in #MBEDTLS_RSA_PRIVATE mode. Future versions of the library"]
    #[doc = "                 are likely to remove the \\p mode argument and have it"]
    #[doc = "                 implicitly set to #MBEDTLS_RSA_PUBLIC."]
    #[doc = ""]
    #[doc = " \\note           Alternative implementations of RSA need not support"]
    #[doc = "                 mode being set to #MBEDTLS_RSA_PRIVATE and might instead"]
    #[doc = "                 return #MBEDTLS_ERR_PLATFORM_FEATURE_UNSUPPORTED."]
    #[doc = ""]
    #[doc = " \\param ctx      The initialized RSA context to use."]
    #[doc = " \\param f_rng    The RNG function to use. It is needed for padding generation"]
    #[doc = "                 if \\p mode is #MBEDTLS_RSA_PUBLIC. If \\p mode is"]
    #[doc = "                 #MBEDTLS_RSA_PRIVATE (discouraged), it is used for"]
    #[doc = "                 blinding and should be provided; see mbedtls_rsa_private()."]
    #[doc = " \\param p_rng    The RNG context to be passed to \\p f_rng. This may"]
    #[doc = "                 be \\c NULL if \\p f_rng is \\c NULL or if \\p f_rng"]
    #[doc = "                 doesn't need a context argument."]
    #[doc = " \\param mode     The mode of operation. This must be either"]
    #[doc = "                 #MBEDTLS_RSA_PUBLIC or #MBEDTLS_RSA_PRIVATE (deprecated)."]
    #[doc = " \\param ilen     The length of the plaintext in Bytes."]
    #[doc = " \\param input    The input data to encrypt. This must be a readable"]
    #[doc = "                 buffer of size \\p ilen Bytes. It may be \\c NULL if"]
    #[doc = "                 `ilen == 0`."]
    #[doc = " \\param output   The output buffer. This must be a writable buffer"]
    #[doc = "                 of length \\c ctx->len Bytes. For example, \\c 256 Bytes"]
    #[doc = "                 for an 2048-bit RSA modulus."]
    #[doc = ""]
    #[doc = " \\return         \\c 0 on success."]
    #[doc = " \\return         An \\c MBEDTLS_ERR_RSA_XXX error code on failure."]
    #[link_name = "\u{1}mbedtls_rsa_rsaes_pkcs1_v15_encrypt"]
    pub fn rsa_rsaes_pkcs1_v15_encrypt(
        ctx: *mut rsa_context,
        f_rng: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut crate::types::c_void,
                arg2: *mut crate::types::c_uchar,
                arg3: usize,
            ) -> crate::types::c_int,
        >,
        p_rng: *mut crate::types::c_void,
        mode: crate::types::c_int,
        ilen: usize,
        input: *const crate::types::c_uchar,
        output: *mut crate::types::c_uchar,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief            This function performs a PKCS#1 v2.1 OAEP encryption"]
    #[doc = "                   operation (RSAES-OAEP-ENCRYPT)."]
    #[doc = ""]
    #[doc = " \\note             The output buffer must be as large as the size"]
    #[doc = "                   of ctx->N. For example, 128 Bytes if RSA-1024 is used."]
    #[doc = ""]
    #[doc = " \\deprecated       It is deprecated and discouraged to call this function"]
    #[doc = "                   in #MBEDTLS_RSA_PRIVATE mode. Future versions of the library"]
    #[doc = "                   are likely to remove the \\p mode argument and have it"]
    #[doc = "                   implicitly set to #MBEDTLS_RSA_PUBLIC."]
    #[doc = ""]
    #[doc = " \\note             Alternative implementations of RSA need not support"]
    #[doc = "                   mode being set to #MBEDTLS_RSA_PRIVATE and might instead"]
    #[doc = "                   return #MBEDTLS_ERR_PLATFORM_FEATURE_UNSUPPORTED."]
    #[doc = ""]
    #[doc = " \\param ctx        The initnialized RSA context to use."]
    #[doc = " \\param f_rng      The RNG function to use. This is needed for padding"]
    #[doc = "                   generation and must be provided."]
    #[doc = " \\param p_rng      The RNG context to be passed to \\p f_rng. This may"]
    #[doc = "                   be \\c NULL if \\p f_rng doesn't need a context argument."]
    #[doc = " \\param mode       The mode of operation. This must be either"]
    #[doc = "                   #MBEDTLS_RSA_PUBLIC or #MBEDTLS_RSA_PRIVATE (deprecated)."]
    #[doc = " \\param label      The buffer holding the custom label to use."]
    #[doc = "                   This must be a readable buffer of length \\p label_len"]
    #[doc = "                   Bytes. It may be \\c NULL if \\p label_len is \\c 0."]
    #[doc = " \\param label_len  The length of the label in Bytes."]
    #[doc = " \\param ilen       The length of the plaintext buffer \\p input in Bytes."]
    #[doc = " \\param input      The input data to encrypt. This must be a readable"]
    #[doc = "                   buffer of size \\p ilen Bytes. It may be \\c NULL if"]
    #[doc = "                   `ilen == 0`."]
    #[doc = " \\param output     The output buffer. This must be a writable buffer"]
    #[doc = "                   of length \\c ctx->len Bytes. For example, \\c 256 Bytes"]
    #[doc = "                   for an 2048-bit RSA modulus."]
    #[doc = ""]
    #[doc = " \\return           \\c 0 on success."]
    #[doc = " \\return           An \\c MBEDTLS_ERR_RSA_XXX error code on failure."]
    #[link_name = "\u{1}mbedtls_rsa_rsaes_oaep_encrypt"]
    pub fn rsa_rsaes_oaep_encrypt(
        ctx: *mut rsa_context,
        f_rng: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut crate::types::c_void,
                arg2: *mut crate::types::c_uchar,
                arg3: usize,
            ) -> crate::types::c_int,
        >,
        p_rng: *mut crate::types::c_void,
        mode: crate::types::c_int,
        label: *const crate::types::c_uchar,
        label_len: usize,
        ilen: usize,
        input: *const crate::types::c_uchar,
        output: *mut crate::types::c_uchar,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief          This function performs an RSA operation, then removes the"]
    #[doc = "                 message padding."]
    #[doc = ""]
    #[doc = "                 It is the generic wrapper for performing a PKCS#1 decryption"]
    #[doc = "                 operation using the \\p mode from the context."]
    #[doc = ""]
    #[doc = " \\note           The output buffer length \\c output_max_len should be"]
    #[doc = "                 as large as the size \\p ctx->len of \\p ctx->N (for example,"]
    #[doc = "                 128 Bytes if RSA-1024 is used) to be able to hold an"]
    #[doc = "                 arbitrary decrypted message. If it is not large enough to"]
    #[doc = "                 hold the decryption of the particular ciphertext provided,"]
    #[doc = "                 the function returns \\c MBEDTLS_ERR_RSA_OUTPUT_TOO_LARGE."]
    #[doc = ""]
    #[doc = " \\deprecated     It is deprecated and discouraged to call this function"]
    #[doc = "                 in #MBEDTLS_RSA_PUBLIC mode. Future versions of the library"]
    #[doc = "                 are likely to remove the \\p mode argument and have it"]
    #[doc = "                 implicitly set to #MBEDTLS_RSA_PRIVATE."]
    #[doc = ""]
    #[doc = " \\note           Alternative implementations of RSA need not support"]
    #[doc = "                 mode being set to #MBEDTLS_RSA_PUBLIC and might instead"]
    #[doc = "                 return #MBEDTLS_ERR_PLATFORM_FEATURE_UNSUPPORTED."]
    #[doc = ""]
    #[doc = " \\param ctx      The initialized RSA context to use."]
    #[doc = " \\param f_rng    The RNG function. If \\p mode is #MBEDTLS_RSA_PRIVATE,"]
    #[doc = "                 this is used for blinding and should be provided; see"]
    #[doc = "                 mbedtls_rsa_private() for more. If \\p mode is"]
    #[doc = "                 #MBEDTLS_RSA_PUBLIC, it is ignored."]
    #[doc = " \\param p_rng    The RNG context to be passed to \\p f_rng. This may be"]
    #[doc = "                 \\c NULL if \\p f_rng is \\c NULL or doesn't need a context."]
    #[doc = " \\param mode     The mode of operation. This must be either"]
    #[doc = "                 #MBEDTLS_RSA_PRIVATE or #MBEDTLS_RSA_PUBLIC (deprecated)."]
    #[doc = " \\param olen     The address at which to store the length of"]
    #[doc = "                 the plaintext. This must not be \\c NULL."]
    #[doc = " \\param input    The ciphertext buffer. This must be a readable buffer"]
    #[doc = "                 of length \\c ctx->len Bytes. For example, \\c 256 Bytes"]
    #[doc = "                 for an 2048-bit RSA modulus."]
    #[doc = " \\param output   The buffer used to hold the plaintext. This must"]
    #[doc = "                 be a writable buffer of length \\p output_max_len Bytes."]
    #[doc = " \\param output_max_len The length in Bytes of the output buffer \\p output."]
    #[doc = ""]
    #[doc = " \\return         \\c 0 on success."]
    #[doc = " \\return         An \\c MBEDTLS_ERR_RSA_XXX error code on failure."]
    #[link_name = "\u{1}mbedtls_rsa_pkcs1_decrypt"]
    pub fn rsa_pkcs1_decrypt(
        ctx: *mut rsa_context,
        f_rng: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut crate::types::c_void,
                arg2: *mut crate::types::c_uchar,
                arg3: usize,
            ) -> crate::types::c_int,
        >,
        p_rng: *mut crate::types::c_void,
        mode: crate::types::c_int,
        olen: *mut usize,
        input: *const crate::types::c_uchar,
        output: *mut crate::types::c_uchar,
        output_max_len: usize,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief          This function performs a PKCS#1 v1.5 decryption"]
    #[doc = "                 operation (RSAES-PKCS1-v1_5-DECRYPT)."]
    #[doc = ""]
    #[doc = " \\note           The output buffer length \\c output_max_len should be"]
    #[doc = "                 as large as the size \\p ctx->len of \\p ctx->N, for example,"]
    #[doc = "                 128 Bytes if RSA-1024 is used, to be able to hold an"]
    #[doc = "                 arbitrary decrypted message. If it is not large enough to"]
    #[doc = "                 hold the decryption of the particular ciphertext provided,"]
    #[doc = "                 the function returns #MBEDTLS_ERR_RSA_OUTPUT_TOO_LARGE."]
    #[doc = ""]
    #[doc = " \\deprecated     It is deprecated and discouraged to call this function"]
    #[doc = "                 in #MBEDTLS_RSA_PUBLIC mode. Future versions of the library"]
    #[doc = "                 are likely to remove the \\p mode argument and have it"]
    #[doc = "                 implicitly set to #MBEDTLS_RSA_PRIVATE."]
    #[doc = ""]
    #[doc = " \\note           Alternative implementations of RSA need not support"]
    #[doc = "                 mode being set to #MBEDTLS_RSA_PUBLIC and might instead"]
    #[doc = "                 return #MBEDTLS_ERR_PLATFORM_FEATURE_UNSUPPORTED."]
    #[doc = ""]
    #[doc = " \\param ctx      The initialized RSA context to use."]
    #[doc = " \\param f_rng    The RNG function. If \\p mode is #MBEDTLS_RSA_PRIVATE,"]
    #[doc = "                 this is used for blinding and should be provided; see"]
    #[doc = "                 mbedtls_rsa_private() for more. If \\p mode is"]
    #[doc = "                 #MBEDTLS_RSA_PUBLIC, it is ignored."]
    #[doc = " \\param p_rng    The RNG context to be passed to \\p f_rng. This may be"]
    #[doc = "                 \\c NULL if \\p f_rng is \\c NULL or doesn't need a context."]
    #[doc = " \\param mode     The mode of operation. This must be either"]
    #[doc = "                 #MBEDTLS_RSA_PRIVATE or #MBEDTLS_RSA_PUBLIC (deprecated)."]
    #[doc = " \\param olen     The address at which to store the length of"]
    #[doc = "                 the plaintext. This must not be \\c NULL."]
    #[doc = " \\param input    The ciphertext buffer. This must be a readable buffer"]
    #[doc = "                 of length \\c ctx->len Bytes. For example, \\c 256 Bytes"]
    #[doc = "                 for an 2048-bit RSA modulus."]
    #[doc = " \\param output   The buffer used to hold the plaintext. This must"]
    #[doc = "                 be a writable buffer of length \\p output_max_len Bytes."]
    #[doc = " \\param output_max_len The length in Bytes of the output buffer \\p output."]
    #[doc = ""]
    #[doc = " \\return         \\c 0 on success."]
    #[doc = " \\return         An \\c MBEDTLS_ERR_RSA_XXX error code on failure."]
    #[doc = ""]
    #[link_name = "\u{1}mbedtls_rsa_rsaes_pkcs1_v15_decrypt"]
    pub fn rsa_rsaes_pkcs1_v15_decrypt(
        ctx: *mut rsa_context,
        f_rng: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut crate::types::c_void,
                arg2: *mut crate::types::c_uchar,
                arg3: usize,
            ) -> crate::types::c_int,
        >,
        p_rng: *mut crate::types::c_void,
        mode: crate::types::c_int,
        olen: *mut usize,
        input: *const crate::types::c_uchar,
        output: *mut crate::types::c_uchar,
        output_max_len: usize,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief            This function performs a PKCS#1 v2.1 OAEP decryption"]
    #[doc = "                   operation (RSAES-OAEP-DECRYPT)."]
    #[doc = ""]
    #[doc = " \\note             The output buffer length \\c output_max_len should be"]
    #[doc = "                   as large as the size \\p ctx->len of \\p ctx->N, for"]
    #[doc = "                   example, 128 Bytes if RSA-1024 is used, to be able to"]
    #[doc = "                   hold an arbitrary decrypted message. If it is not"]
    #[doc = "                   large enough to hold the decryption of the particular"]
    #[doc = "                   ciphertext provided, the function returns"]
    #[doc = "                   #MBEDTLS_ERR_RSA_OUTPUT_TOO_LARGE."]
    #[doc = ""]
    #[doc = " \\deprecated       It is deprecated and discouraged to call this function"]
    #[doc = "                   in #MBEDTLS_RSA_PUBLIC mode. Future versions of the library"]
    #[doc = "                   are likely to remove the \\p mode argument and have it"]
    #[doc = "                   implicitly set to #MBEDTLS_RSA_PRIVATE."]
    #[doc = ""]
    #[doc = " \\note             Alternative implementations of RSA need not support"]
    #[doc = "                   mode being set to #MBEDTLS_RSA_PUBLIC and might instead"]
    #[doc = "                   return #MBEDTLS_ERR_PLATFORM_FEATURE_UNSUPPORTED."]
    #[doc = ""]
    #[doc = " \\param ctx        The initialized RSA context to use."]
    #[doc = " \\param f_rng      The RNG function. If \\p mode is #MBEDTLS_RSA_PRIVATE,"]
    #[doc = "                   this is used for blinding and should be provided; see"]
    #[doc = "                   mbedtls_rsa_private() for more. If \\p mode is"]
    #[doc = "                   #MBEDTLS_RSA_PUBLIC, it is ignored."]
    #[doc = " \\param p_rng      The RNG context to be passed to \\p f_rng. This may be"]
    #[doc = "                   \\c NULL if \\p f_rng is \\c NULL or doesn't need a context."]
    #[doc = " \\param mode       The mode of operation. This must be either"]
    #[doc = "                   #MBEDTLS_RSA_PRIVATE or #MBEDTLS_RSA_PUBLIC (deprecated)."]
    #[doc = " \\param label      The buffer holding the custom label to use."]
    #[doc = "                   This must be a readable buffer of length \\p label_len"]
    #[doc = "                   Bytes. It may be \\c NULL if \\p label_len is \\c 0."]
    #[doc = " \\param label_len  The length of the label in Bytes."]
    #[doc = " \\param olen       The address at which to store the length of"]
    #[doc = "                   the plaintext. This must not be \\c NULL."]
    #[doc = " \\param input      The ciphertext buffer. This must be a readable buffer"]
    #[doc = "                   of length \\c ctx->len Bytes. For example, \\c 256 Bytes"]
    #[doc = "                   for an 2048-bit RSA modulus."]
    #[doc = " \\param output     The buffer used to hold the plaintext. This must"]
    #[doc = "                   be a writable buffer of length \\p output_max_len Bytes."]
    #[doc = " \\param output_max_len The length in Bytes of the output buffer \\p output."]
    #[doc = ""]
    #[doc = " \\return         \\c 0 on success."]
    #[doc = " \\return         An \\c MBEDTLS_ERR_RSA_XXX error code on failure."]
    #[link_name = "\u{1}mbedtls_rsa_rsaes_oaep_decrypt"]
    pub fn rsa_rsaes_oaep_decrypt(
        ctx: *mut rsa_context,
        f_rng: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut crate::types::c_void,
                arg2: *mut crate::types::c_uchar,
                arg3: usize,
            ) -> crate::types::c_int,
        >,
        p_rng: *mut crate::types::c_void,
        mode: crate::types::c_int,
        label: *const crate::types::c_uchar,
        label_len: usize,
        olen: *mut usize,
        input: *const crate::types::c_uchar,
        output: *mut crate::types::c_uchar,
        output_max_len: usize,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief          This function performs a private RSA operation to sign"]
    #[doc = "                 a message digest using PKCS#1."]
    #[doc = ""]
    #[doc = "                 It is the generic wrapper for performing a PKCS#1"]
    #[doc = "                 signature using the \\p mode from the context."]
    #[doc = ""]
    #[doc = " \\note           The \\p sig buffer must be as large as the size"]
    #[doc = "                 of \\p ctx->N. For example, 128 Bytes if RSA-1024 is used."]
    #[doc = ""]
    #[doc = " \\note           For PKCS#1 v2.1 encoding, see comments on"]
    #[doc = "                 mbedtls_rsa_rsassa_pss_sign() for details on"]
    #[doc = "                 \\p md_alg and \\p hash_id."]
    #[doc = ""]
    #[doc = " \\deprecated     It is deprecated and discouraged to call this function"]
    #[doc = "                 in #MBEDTLS_RSA_PUBLIC mode. Future versions of the library"]
    #[doc = "                 are likely to remove the \\p mode argument and have it"]
    #[doc = "                 implicitly set to #MBEDTLS_RSA_PRIVATE."]
    #[doc = ""]
    #[doc = " \\note           Alternative implementations of RSA need not support"]
    #[doc = "                 mode being set to #MBEDTLS_RSA_PUBLIC and might instead"]
    #[doc = "                 return #MBEDTLS_ERR_PLATFORM_FEATURE_UNSUPPORTED."]
    #[doc = ""]
    #[doc = " \\param ctx      The initialized RSA context to use."]
    #[doc = " \\param f_rng    The RNG function to use. If the padding mode is PKCS#1 v2.1,"]
    #[doc = "                 this must be provided. If the padding mode is PKCS#1 v1.5 and"]
    #[doc = "                 \\p mode is #MBEDTLS_RSA_PRIVATE, it is used for blinding"]
    #[doc = "                 and should be provided; see mbedtls_rsa_private() for more"]
    #[doc = "                 more. It is ignored otherwise."]
    #[doc = " \\param p_rng    The RNG context to be passed to \\p f_rng. This may be \\c NULL"]
    #[doc = "                 if \\p f_rng is \\c NULL or doesn't need a context argument."]
    #[doc = " \\param mode     The mode of operation. This must be either"]
    #[doc = "                 #MBEDTLS_RSA_PRIVATE or #MBEDTLS_RSA_PUBLIC (deprecated)."]
    #[doc = " \\param md_alg   The message-digest algorithm used to hash the original data."]
    #[doc = "                 Use #MBEDTLS_MD_NONE for signing raw data."]
    #[doc = " \\param hashlen  The length of the message digest."]
    #[doc = "                 Ths is only used if \\p md_alg is #MBEDTLS_MD_NONE."]
    #[doc = " \\param hash     The buffer holding the message digest or raw data."]
    #[doc = "                 If \\p md_alg is #MBEDTLS_MD_NONE, this must be a readable"]
    #[doc = "                 buffer of length \\p hashlen Bytes. If \\p md_alg is not"]
    #[doc = "                 #MBEDTLS_MD_NONE, it must be a readable buffer of length"]
    #[doc = "                 the size of the hash corresponding to \\p md_alg."]
    #[doc = " \\param sig      The buffer to hold the signature. This must be a writable"]
    #[doc = "                 buffer of length \\c ctx->len Bytes. For example, \\c 256 Bytes"]
    #[doc = "                 for an 2048-bit RSA modulus. A buffer length of"]
    #[doc = "                 #MBEDTLS_MPI_MAX_SIZE is always safe."]
    #[doc = ""]
    #[doc = " \\return         \\c 0 if the signing operation was successful."]
    #[doc = " \\return         An \\c MBEDTLS_ERR_RSA_XXX error code on failure."]
    #[link_name = "\u{1}mbedtls_rsa_pkcs1_sign"]
    pub fn rsa_pkcs1_sign(
        ctx: *mut rsa_context,
        f_rng: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut crate::types::c_void,
                arg2: *mut crate::types::c_uchar,
                arg3: usize,
            ) -> crate::types::c_int,
        >,
        p_rng: *mut crate::types::c_void,
        mode: crate::types::c_int,
        md_alg: md_type_t,
        hashlen: crate::types::c_uint,
        hash: *const crate::types::c_uchar,
        sig: *mut crate::types::c_uchar,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief          This function performs a PKCS#1 v1.5 signature"]
    #[doc = "                 operation (RSASSA-PKCS1-v1_5-SIGN)."]
    #[doc = ""]
    #[doc = " \\deprecated     It is deprecated and discouraged to call this function"]
    #[doc = "                 in #MBEDTLS_RSA_PUBLIC mode. Future versions of the library"]
    #[doc = "                 are likely to remove the \\p mode argument and have it"]
    #[doc = "                 implicitly set to #MBEDTLS_RSA_PRIVATE."]
    #[doc = ""]
    #[doc = " \\note           Alternative implementations of RSA need not support"]
    #[doc = "                 mode being set to #MBEDTLS_RSA_PUBLIC and might instead"]
    #[doc = "                 return #MBEDTLS_ERR_PLATFORM_FEATURE_UNSUPPORTED."]
    #[doc = ""]
    #[doc = " \\param ctx      The initialized RSA context to use."]
    #[doc = " \\param f_rng    The RNG function. If \\p mode is #MBEDTLS_RSA_PRIVATE,"]
    #[doc = "                 this is used for blinding and should be provided; see"]
    #[doc = "                 mbedtls_rsa_private() for more. If \\p mode is"]
    #[doc = "                 #MBEDTLS_RSA_PUBLIC, it is ignored."]
    #[doc = " \\param p_rng    The RNG context to be passed to \\p f_rng. This may be \\c NULL"]
    #[doc = "                 if \\p f_rng is \\c NULL or doesn't need a context argument."]
    #[doc = " \\param mode     The mode of operation. This must be either"]
    #[doc = "                 #MBEDTLS_RSA_PRIVATE or #MBEDTLS_RSA_PUBLIC (deprecated)."]
    #[doc = " \\param md_alg   The message-digest algorithm used to hash the original data."]
    #[doc = "                 Use #MBEDTLS_MD_NONE for signing raw data."]
    #[doc = " \\param hashlen  The length of the message digest."]
    #[doc = "                 Ths is only used if \\p md_alg is #MBEDTLS_MD_NONE."]
    #[doc = " \\param hash     The buffer holding the message digest or raw data."]
    #[doc = "                 If \\p md_alg is #MBEDTLS_MD_NONE, this must be a readable"]
    #[doc = "                 buffer of length \\p hashlen Bytes. If \\p md_alg is not"]
    #[doc = "                 #MBEDTLS_MD_NONE, it must be a readable buffer of length"]
    #[doc = "                 the size of the hash corresponding to \\p md_alg."]
    #[doc = " \\param sig      The buffer to hold the signature. This must be a writable"]
    #[doc = "                 buffer of length \\c ctx->len Bytes. For example, \\c 256 Bytes"]
    #[doc = "                 for an 2048-bit RSA modulus. A buffer length of"]
    #[doc = "                 #MBEDTLS_MPI_MAX_SIZE is always safe."]
    #[doc = ""]
    #[doc = " \\return         \\c 0 if the signing operation was successful."]
    #[doc = " \\return         An \\c MBEDTLS_ERR_RSA_XXX error code on failure."]
    #[link_name = "\u{1}mbedtls_rsa_rsassa_pkcs1_v15_sign"]
    pub fn rsa_rsassa_pkcs1_v15_sign(
        ctx: *mut rsa_context,
        f_rng: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut crate::types::c_void,
                arg2: *mut crate::types::c_uchar,
                arg3: usize,
            ) -> crate::types::c_int,
        >,
        p_rng: *mut crate::types::c_void,
        mode: crate::types::c_int,
        md_alg: md_type_t,
        hashlen: crate::types::c_uint,
        hash: *const crate::types::c_uchar,
        sig: *mut crate::types::c_uchar,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief          This function performs a PKCS#1 v2.1 PSS signature"]
    #[doc = "                 operation (RSASSA-PSS-SIGN)."]
    #[doc = ""]
    #[doc = " \\note           The \\p hash_id in the RSA context is the one used for the"]
    #[doc = "                 encoding. \\p md_alg in the function call is the type of hash"]
    #[doc = "                 that is encoded. According to <em>RFC-3447: Public-Key"]
    #[doc = "                 Cryptography Standards (PKCS) #1 v2.1: RSA Cryptography"]
    #[doc = "                 Specifications</em> it is advised to keep both hashes the"]
    #[doc = "                 same."]
    #[doc = ""]
    #[doc = " \\note           This function always uses the maximum possible salt size,"]
    #[doc = "                 up to the length of the payload hash. This choice of salt"]
    #[doc = "                 size complies with FIPS 186-4 5.5 (e) and RFC 8017 (PKCS#1"]
    #[doc = "                 v2.2) 9.1.1 step 3. Furthermore this function enforces a"]
    #[doc = "                 minimum salt size which is the hash size minus 2 bytes. If"]
    #[doc = "                 this minimum size is too large given the key size (the salt"]
    #[doc = "                 size, plus the hash size, plus 2 bytes must be no more than"]
    #[doc = "                 the key size in bytes), this function returns"]
    #[doc = "                 #MBEDTLS_ERR_RSA_BAD_INPUT_DATA."]
    #[doc = ""]
    #[doc = " \\deprecated     It is deprecated and discouraged to call this function"]
    #[doc = "                 in #MBEDTLS_RSA_PUBLIC mode. Future versions of the library"]
    #[doc = "                 are likely to remove the \\p mode argument and have it"]
    #[doc = "                 implicitly set to #MBEDTLS_RSA_PRIVATE."]
    #[doc = ""]
    #[doc = " \\note           Alternative implementations of RSA need not support"]
    #[doc = "                 mode being set to #MBEDTLS_RSA_PUBLIC and might instead"]
    #[doc = "                 return #MBEDTLS_ERR_PLATFORM_FEATURE_UNSUPPORTED."]
    #[doc = ""]
    #[doc = " \\param ctx      The initialized RSA context to use."]
    #[doc = " \\param f_rng    The RNG function. It must not be \\c NULL."]
    #[doc = " \\param p_rng    The RNG context to be passed to \\p f_rng. This may be \\c NULL"]
    #[doc = "                 if \\p f_rng doesn't need a context argument."]
    #[doc = " \\param mode     The mode of operation. This must be either"]
    #[doc = "                 #MBEDTLS_RSA_PRIVATE or #MBEDTLS_RSA_PUBLIC (deprecated)."]
    #[doc = " \\param md_alg   The message-digest algorithm used to hash the original data."]
    #[doc = "                 Use #MBEDTLS_MD_NONE for signing raw data."]
    #[doc = " \\param hashlen  The length of the message digest."]
    #[doc = "                 Ths is only used if \\p md_alg is #MBEDTLS_MD_NONE."]
    #[doc = " \\param hash     The buffer holding the message digest or raw data."]
    #[doc = "                 If \\p md_alg is #MBEDTLS_MD_NONE, this must be a readable"]
    #[doc = "                 buffer of length \\p hashlen Bytes. If \\p md_alg is not"]
    #[doc = "                 #MBEDTLS_MD_NONE, it must be a readable buffer of length"]
    #[doc = "                 the size of the hash corresponding to \\p md_alg."]
    #[doc = " \\param sig      The buffer to hold the signature. This must be a writable"]
    #[doc = "                 buffer of length \\c ctx->len Bytes. For example, \\c 256 Bytes"]
    #[doc = "                 for an 2048-bit RSA modulus. A buffer length of"]
    #[doc = "                 #MBEDTLS_MPI_MAX_SIZE is always safe."]
    #[doc = ""]
    #[doc = " \\return         \\c 0 if the signing operation was successful."]
    #[doc = " \\return         An \\c MBEDTLS_ERR_RSA_XXX error code on failure."]
    #[link_name = "\u{1}mbedtls_rsa_rsassa_pss_sign"]
    pub fn rsa_rsassa_pss_sign(
        ctx: *mut rsa_context,
        f_rng: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut crate::types::c_void,
                arg2: *mut crate::types::c_uchar,
                arg3: usize,
            ) -> crate::types::c_int,
        >,
        p_rng: *mut crate::types::c_void,
        mode: crate::types::c_int,
        md_alg: md_type_t,
        hashlen: crate::types::c_uint,
        hash: *const crate::types::c_uchar,
        sig: *mut crate::types::c_uchar,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief          This function performs a public RSA operation and checks"]
    #[doc = "                 the message digest."]
    #[doc = ""]
    #[doc = "                 This is the generic wrapper for performing a PKCS#1"]
    #[doc = "                 verification using the mode from the context."]
    #[doc = ""]
    #[doc = " \\note           For PKCS#1 v2.1 encoding, see comments on"]
    #[doc = "                 mbedtls_rsa_rsassa_pss_verify() about \\p md_alg and"]
    #[doc = "                 \\p hash_id."]
    #[doc = ""]
    #[doc = " \\deprecated     It is deprecated and discouraged to call this function"]
    #[doc = "                 in #MBEDTLS_RSA_PRIVATE mode. Future versions of the library"]
    #[doc = "                 are likely to remove the \\p mode argument and have it"]
    #[doc = "                 set to #MBEDTLS_RSA_PUBLIC."]
    #[doc = ""]
    #[doc = " \\note           Alternative implementations of RSA need not support"]
    #[doc = "                 mode being set to #MBEDTLS_RSA_PRIVATE and might instead"]
    #[doc = "                 return #MBEDTLS_ERR_PLATFORM_FEATURE_UNSUPPORTED."]
    #[doc = ""]
    #[doc = " \\param ctx      The initialized RSA public key context to use."]
    #[doc = " \\param f_rng    The RNG function to use. If \\p mode is #MBEDTLS_RSA_PRIVATE,"]
    #[doc = "                 this is used for blinding and should be provided; see"]
    #[doc = "                 mbedtls_rsa_private() for more. Otherwise, it is ignored."]
    #[doc = " \\param p_rng    The RNG context to be passed to \\p f_rng. This may be"]
    #[doc = "                 \\c NULL if \\p f_rng is \\c NULL or doesn't need a context."]
    #[doc = " \\param mode     The mode of operation. This must be either"]
    #[doc = "                 #MBEDTLS_RSA_PUBLIC or #MBEDTLS_RSA_PRIVATE (deprecated)."]
    #[doc = " \\param md_alg   The message-digest algorithm used to hash the original data."]
    #[doc = "                 Use #MBEDTLS_MD_NONE for signing raw data."]
    #[doc = " \\param hashlen  The length of the message digest."]
    #[doc = "                 This is only used if \\p md_alg is #MBEDTLS_MD_NONE."]
    #[doc = " \\param hash     The buffer holding the message digest or raw data."]
    #[doc = "                 If \\p md_alg is #MBEDTLS_MD_NONE, this must be a readable"]
    #[doc = "                 buffer of length \\p hashlen Bytes. If \\p md_alg is not"]
    #[doc = "                 #MBEDTLS_MD_NONE, it must be a readable buffer of length"]
    #[doc = "                 the size of the hash corresponding to \\p md_alg."]
    #[doc = " \\param sig      The buffer holding the signature. This must be a readable"]
    #[doc = "                 buffer of length \\c ctx->len Bytes. For example, \\c 256 Bytes"]
    #[doc = "                 for an 2048-bit RSA modulus."]
    #[doc = ""]
    #[doc = " \\return         \\c 0 if the verify operation was successful."]
    #[doc = " \\return         An \\c MBEDTLS_ERR_RSA_XXX error code on failure."]
    #[link_name = "\u{1}mbedtls_rsa_pkcs1_verify"]
    pub fn rsa_pkcs1_verify(
        ctx: *mut rsa_context,
        f_rng: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut crate::types::c_void,
                arg2: *mut crate::types::c_uchar,
                arg3: usize,
            ) -> crate::types::c_int,
        >,
        p_rng: *mut crate::types::c_void,
        mode: crate::types::c_int,
        md_alg: md_type_t,
        hashlen: crate::types::c_uint,
        hash: *const crate::types::c_uchar,
        sig: *const crate::types::c_uchar,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief          This function performs a PKCS#1 v1.5 verification"]
    #[doc = "                 operation (RSASSA-PKCS1-v1_5-VERIFY)."]
    #[doc = ""]
    #[doc = " \\deprecated     It is deprecated and discouraged to call this function"]
    #[doc = "                 in #MBEDTLS_RSA_PRIVATE mode. Future versions of the library"]
    #[doc = "                 are likely to remove the \\p mode argument and have it"]
    #[doc = "                 set to #MBEDTLS_RSA_PUBLIC."]
    #[doc = ""]
    #[doc = " \\note           Alternative implementations of RSA need not support"]
    #[doc = "                 mode being set to #MBEDTLS_RSA_PRIVATE and might instead"]
    #[doc = "                 return #MBEDTLS_ERR_PLATFORM_FEATURE_UNSUPPORTED."]
    #[doc = ""]
    #[doc = " \\param ctx      The initialized RSA public key context to use."]
    #[doc = " \\param f_rng    The RNG function to use. If \\p mode is #MBEDTLS_RSA_PRIVATE,"]
    #[doc = "                 this is used for blinding and should be provided; see"]
    #[doc = "                 mbedtls_rsa_private() for more. Otherwise, it is ignored."]
    #[doc = " \\param p_rng    The RNG context to be passed to \\p f_rng. This may be"]
    #[doc = "                 \\c NULL if \\p f_rng is \\c NULL or doesn't need a context."]
    #[doc = " \\param mode     The mode of operation. This must be either"]
    #[doc = "                 #MBEDTLS_RSA_PUBLIC or #MBEDTLS_RSA_PRIVATE (deprecated)."]
    #[doc = " \\param md_alg   The message-digest algorithm used to hash the original data."]
    #[doc = "                 Use #MBEDTLS_MD_NONE for signing raw data."]
    #[doc = " \\param hashlen  The length of the message digest."]
    #[doc = "                 This is only used if \\p md_alg is #MBEDTLS_MD_NONE."]
    #[doc = " \\param hash     The buffer holding the message digest or raw data."]
    #[doc = "                 If \\p md_alg is #MBEDTLS_MD_NONE, this must be a readable"]
    #[doc = "                 buffer of length \\p hashlen Bytes. If \\p md_alg is not"]
    #[doc = "                 #MBEDTLS_MD_NONE, it must be a readable buffer of length"]
    #[doc = "                 the size of the hash corresponding to \\p md_alg."]
    #[doc = " \\param sig      The buffer holding the signature. This must be a readable"]
    #[doc = "                 buffer of length \\c ctx->len Bytes. For example, \\c 256 Bytes"]
    #[doc = "                 for an 2048-bit RSA modulus."]
    #[doc = ""]
    #[doc = " \\return         \\c 0 if the verify operation was successful."]
    #[doc = " \\return         An \\c MBEDTLS_ERR_RSA_XXX error code on failure."]
    #[link_name = "\u{1}mbedtls_rsa_rsassa_pkcs1_v15_verify"]
    pub fn rsa_rsassa_pkcs1_v15_verify(
        ctx: *mut rsa_context,
        f_rng: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut crate::types::c_void,
                arg2: *mut crate::types::c_uchar,
                arg3: usize,
            ) -> crate::types::c_int,
        >,
        p_rng: *mut crate::types::c_void,
        mode: crate::types::c_int,
        md_alg: md_type_t,
        hashlen: crate::types::c_uint,
        hash: *const crate::types::c_uchar,
        sig: *const crate::types::c_uchar,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief          This function performs a PKCS#1 v2.1 PSS verification"]
    #[doc = "                 operation (RSASSA-PSS-VERIFY)."]
    #[doc = ""]
    #[doc = "                 The hash function for the MGF mask generating function"]
    #[doc = "                 is that specified in the RSA context."]
    #[doc = ""]
    #[doc = " \\note           The \\p hash_id in the RSA context is the one used for the"]
    #[doc = "                 verification. \\p md_alg in the function call is the type of"]
    #[doc = "                 hash that is verified. According to <em>RFC-3447: Public-Key"]
    #[doc = "                 Cryptography Standards (PKCS) #1 v2.1: RSA Cryptography"]
    #[doc = "                 Specifications</em> it is advised to keep both hashes the"]
    #[doc = "                 same. If \\p hash_id in the RSA context is unset,"]
    #[doc = "                 the \\p md_alg from the function call is used."]
    #[doc = ""]
    #[doc = " \\deprecated     It is deprecated and discouraged to call this function"]
    #[doc = "                 in #MBEDTLS_RSA_PRIVATE mode. Future versions of the library"]
    #[doc = "                 are likely to remove the \\p mode argument and have it"]
    #[doc = "                 implicitly set to #MBEDTLS_RSA_PUBLIC."]
    #[doc = ""]
    #[doc = " \\note           Alternative implementations of RSA need not support"]
    #[doc = "                 mode being set to #MBEDTLS_RSA_PRIVATE and might instead"]
    #[doc = "                 return #MBEDTLS_ERR_PLATFORM_FEATURE_UNSUPPORTED."]
    #[doc = ""]
    #[doc = " \\param ctx      The initialized RSA public key context to use."]
    #[doc = " \\param f_rng    The RNG function to use. If \\p mode is #MBEDTLS_RSA_PRIVATE,"]
    #[doc = "                 this is used for blinding and should be provided; see"]
    #[doc = "                 mbedtls_rsa_private() for more. Otherwise, it is ignored."]
    #[doc = " \\param p_rng    The RNG context to be passed to \\p f_rng. This may be"]
    #[doc = "                 \\c NULL if \\p f_rng is \\c NULL or doesn't need a context."]
    #[doc = " \\param mode     The mode of operation. This must be either"]
    #[doc = "                 #MBEDTLS_RSA_PUBLIC or #MBEDTLS_RSA_PRIVATE (deprecated)."]
    #[doc = " \\param md_alg   The message-digest algorithm used to hash the original data."]
    #[doc = "                 Use #MBEDTLS_MD_NONE for signing raw data."]
    #[doc = " \\param hashlen  The length of the message digest."]
    #[doc = "                 This is only used if \\p md_alg is #MBEDTLS_MD_NONE."]
    #[doc = " \\param hash     The buffer holding the message digest or raw data."]
    #[doc = "                 If \\p md_alg is #MBEDTLS_MD_NONE, this must be a readable"]
    #[doc = "                 buffer of length \\p hashlen Bytes. If \\p md_alg is not"]
    #[doc = "                 #MBEDTLS_MD_NONE, it must be a readable buffer of length"]
    #[doc = "                 the size of the hash corresponding to \\p md_alg."]
    #[doc = " \\param sig      The buffer holding the signature. This must be a readable"]
    #[doc = "                 buffer of length \\c ctx->len Bytes. For example, \\c 256 Bytes"]
    #[doc = "                 for an 2048-bit RSA modulus."]
    #[doc = ""]
    #[doc = " \\return         \\c 0 if the verify operation was successful."]
    #[doc = " \\return         An \\c MBEDTLS_ERR_RSA_XXX error code on failure."]
    #[link_name = "\u{1}mbedtls_rsa_rsassa_pss_verify"]
    pub fn rsa_rsassa_pss_verify(
        ctx: *mut rsa_context,
        f_rng: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut crate::types::c_void,
                arg2: *mut crate::types::c_uchar,
                arg3: usize,
            ) -> crate::types::c_int,
        >,
        p_rng: *mut crate::types::c_void,
        mode: crate::types::c_int,
        md_alg: md_type_t,
        hashlen: crate::types::c_uint,
        hash: *const crate::types::c_uchar,
        sig: *const crate::types::c_uchar,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief          This function performs a PKCS#1 v2.1 PSS verification"]
    #[doc = "                 operation (RSASSA-PSS-VERIFY)."]
    #[doc = ""]
    #[doc = "                 The hash function for the MGF mask generating function"]
    #[doc = "                 is that specified in \\p mgf1_hash_id."]
    #[doc = ""]
    #[doc = " \\note           The \\p sig buffer must be as large as the size"]
    #[doc = "                 of \\p ctx->N. For example, 128 Bytes if RSA-1024 is used."]
    #[doc = ""]
    #[doc = " \\note           The \\p hash_id in the RSA context is ignored."]
    #[doc = ""]
    #[doc = " \\param ctx      The initialized RSA public key context to use."]
    #[doc = " \\param f_rng    The RNG function to use. If \\p mode is #MBEDTLS_RSA_PRIVATE,"]
    #[doc = "                 this is used for blinding and should be provided; see"]
    #[doc = "                 mbedtls_rsa_private() for more. Otherwise, it is ignored."]
    #[doc = " \\param p_rng    The RNG context to be passed to \\p f_rng. This may be"]
    #[doc = "                 \\c NULL if \\p f_rng is \\c NULL or doesn't need a context."]
    #[doc = " \\param mode     The mode of operation. This must be either"]
    #[doc = "                 #MBEDTLS_RSA_PUBLIC or #MBEDTLS_RSA_PRIVATE."]
    #[doc = " \\param md_alg   The message-digest algorithm used to hash the original data."]
    #[doc = "                 Use #MBEDTLS_MD_NONE for signing raw data."]
    #[doc = " \\param hashlen  The length of the message digest."]
    #[doc = "                 This is only used if \\p md_alg is #MBEDTLS_MD_NONE."]
    #[doc = " \\param hash     The buffer holding the message digest or raw data."]
    #[doc = "                 If \\p md_alg is #MBEDTLS_MD_NONE, this must be a readable"]
    #[doc = "                 buffer of length \\p hashlen Bytes. If \\p md_alg is not"]
    #[doc = "                 #MBEDTLS_MD_NONE, it must be a readable buffer of length"]
    #[doc = "                 the size of the hash corresponding to \\p md_alg."]
    #[doc = " \\param mgf1_hash_id      The message digest used for mask generation."]
    #[doc = " \\param expected_salt_len The length of the salt used in padding. Use"]
    #[doc = "                          #MBEDTLS_RSA_SALT_LEN_ANY to accept any salt length."]
    #[doc = " \\param sig      The buffer holding the signature. This must be a readable"]
    #[doc = "                 buffer of length \\c ctx->len Bytes. For example, \\c 256 Bytes"]
    #[doc = "                 for an 2048-bit RSA modulus."]
    #[doc = ""]
    #[doc = " \\return         \\c 0 if the verify operation was successful."]
    #[doc = " \\return         An \\c MBEDTLS_ERR_RSA_XXX error code on failure."]
    #[link_name = "\u{1}mbedtls_rsa_rsassa_pss_verify_ext"]
    pub fn rsa_rsassa_pss_verify_ext(
        ctx: *mut rsa_context,
        f_rng: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut crate::types::c_void,
                arg2: *mut crate::types::c_uchar,
                arg3: usize,
            ) -> crate::types::c_int,
        >,
        p_rng: *mut crate::types::c_void,
        mode: crate::types::c_int,
        md_alg: md_type_t,
        hashlen: crate::types::c_uint,
        hash: *const crate::types::c_uchar,
        mgf1_hash_id: md_type_t,
        expected_salt_len: crate::types::c_int,
        sig: *const crate::types::c_uchar,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief          This function copies the components of an RSA context."]
    #[doc = ""]
    #[doc = " \\param dst      The destination context. This must be initialized."]
    #[doc = " \\param src      The source context. This must be initialized."]
    #[doc = ""]
    #[doc = " \\return         \\c 0 on success."]
    #[doc = " \\return         #MBEDTLS_ERR_MPI_ALLOC_FAILED on memory allocation failure."]
    #[link_name = "\u{1}mbedtls_rsa_copy"]
    pub fn rsa_copy(dst: *mut rsa_context, src: *const rsa_context) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief          This function frees the components of an RSA key."]
    #[doc = ""]
    #[doc = " \\param ctx      The RSA context to free. May be \\c NULL, in which case"]
    #[doc = "                 this function is a no-op. If it is not \\c NULL, it must"]
    #[doc = "                 point to an initialized RSA context."]
    #[link_name = "\u{1}mbedtls_rsa_free"]
    pub fn rsa_free(ctx: *mut rsa_context);
}
extern "C" {
    #[doc = " \\brief          The RSA checkup routine."]
    #[doc = ""]
    #[doc = " \\return         \\c 0 on success."]
    #[doc = " \\return         \\c 1 on failure."]
    #[link_name = "\u{1}mbedtls_rsa_self_test"]
    pub fn rsa_self_test(verbose: crate::types::c_int) -> crate::types::c_int;
}
#[doc = " \\brief           The ECDSA context structure."]
#[doc = ""]
#[doc = " \\warning         Performing multiple operations concurrently on the same"]
#[doc = "                  ECDSA context is not supported; objects of this type"]
#[doc = "                  should not be shared between multiple threads."]
pub type ecdsa_context = ecp_keypair;
pub type ecdsa_restart_ctx = crate::types::c_void;
extern "C" {
    #[doc = " \\brief          This function checks whether a given group can be used"]
    #[doc = "                 for ECDSA."]
    #[doc = ""]
    #[doc = " \\param gid      The ECP group ID to check."]
    #[doc = ""]
    #[doc = " \\return         \\c 1 if the group can be used, \\c 0 otherwise"]
    #[link_name = "\u{1}mbedtls_ecdsa_can_do"]
    pub fn ecdsa_can_do(gid: ecp_group_id) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief           This function computes the ECDSA signature of a"]
    #[doc = "                  previously-hashed message."]
    #[doc = ""]
    #[doc = " \\note            The deterministic version implemented in"]
    #[doc = "                  mbedtls_ecdsa_sign_det() is usually preferred."]
    #[doc = ""]
    #[doc = " \\note            If the bitlength of the message hash is larger than the"]
    #[doc = "                  bitlength of the group order, then the hash is truncated"]
    #[doc = "                  as defined in <em>Standards for Efficient Cryptography Group"]
    #[doc = "                  (SECG): SEC1 Elliptic Curve Cryptography</em>, section"]
    #[doc = "                  4.1.3, step 5."]
    #[doc = ""]
    #[doc = " \\see             ecp.h"]
    #[doc = ""]
    #[doc = " \\param grp       The context for the elliptic curve to use."]
    #[doc = "                  This must be initialized and have group parameters"]
    #[doc = "                  set, for example through mbedtls_ecp_group_load()."]
    #[doc = " \\param r         The MPI context in which to store the first part"]
    #[doc = "                  the signature. This must be initialized."]
    #[doc = " \\param s         The MPI context in which to store the second part"]
    #[doc = "                  the signature. This must be initialized."]
    #[doc = " \\param d         The private signing key. This must be initialized."]
    #[doc = " \\param buf       The content to be signed. This is usually the hash of"]
    #[doc = "                  the original data to be signed. This must be a readable"]
    #[doc = "                  buffer of length \\p blen Bytes. It may be \\c NULL if"]
    #[doc = "                  \\p blen is zero."]
    #[doc = " \\param blen      The length of \\p buf in Bytes."]
    #[doc = " \\param f_rng     The RNG function. This must not be \\c NULL."]
    #[doc = " \\param p_rng     The RNG context to be passed to \\p f_rng. This may be"]
    #[doc = "                  \\c NULL if \\p f_rng doesn't need a context parameter."]
    #[doc = ""]
    #[doc = " \\return          \\c 0 on success."]
    #[doc = " \\return          An \\c MBEDTLS_ERR_ECP_XXX"]
    #[doc = "                  or \\c MBEDTLS_MPI_XXX error code on failure."]
    #[link_name = "\u{1}mbedtls_ecdsa_sign"]
    pub fn ecdsa_sign(
        grp: *mut ecp_group,
        r: *mut mpi,
        s: *mut mpi,
        d: *const mpi,
        buf: *const crate::types::c_uchar,
        blen: usize,
        f_rng: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut crate::types::c_void,
                arg2: *mut crate::types::c_uchar,
                arg3: usize,
            ) -> crate::types::c_int,
        >,
        p_rng: *mut crate::types::c_void,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief           This function computes the ECDSA signature of a"]
    #[doc = "                  previously-hashed message, deterministic version."]
    #[doc = ""]
    #[doc = "                  For more information, see <em>RFC-6979: Deterministic"]
    #[doc = "                  Usage of the Digital Signature Algorithm (DSA) and Elliptic"]
    #[doc = "                  Curve Digital Signature Algorithm (ECDSA)</em>."]
    #[doc = ""]
    #[doc = " \\note            If the bitlength of the message hash is larger than the"]
    #[doc = "                  bitlength of the group order, then the hash is truncated as"]
    #[doc = "                  defined in <em>Standards for Efficient Cryptography Group"]
    #[doc = "                  (SECG): SEC1 Elliptic Curve Cryptography</em>, section"]
    #[doc = "                  4.1.3, step 5."]
    #[doc = ""]
    #[doc = " \\warning         Since the output of the internal RNG is always the same for"]
    #[doc = "                  the same key and message, this limits the efficiency of"]
    #[doc = "                  blinding and leaks information through side channels. For"]
    #[doc = "                  secure behavior use mbedtls_ecdsa_sign_det_ext() instead."]
    #[doc = ""]
    #[doc = "                  (Optimally the blinding is a random value that is different"]
    #[doc = "                  on every execution. In this case the blinding is still"]
    #[doc = "                  random from the attackers perspective, but is the same on"]
    #[doc = "                  each execution. This means that this blinding does not"]
    #[doc = "                  prevent attackers from recovering secrets by combining"]
    #[doc = "                  several measurement traces, but may prevent some attacks"]
    #[doc = "                  that exploit relationships between secret data.)"]
    #[doc = ""]
    #[doc = " \\see             ecp.h"]
    #[doc = ""]
    #[doc = " \\param grp       The context for the elliptic curve to use."]
    #[doc = "                  This must be initialized and have group parameters"]
    #[doc = "                  set, for example through mbedtls_ecp_group_load()."]
    #[doc = " \\param r         The MPI context in which to store the first part"]
    #[doc = "                  the signature. This must be initialized."]
    #[doc = " \\param s         The MPI context in which to store the second part"]
    #[doc = "                  the signature. This must be initialized."]
    #[doc = " \\param d         The private signing key. This must be initialized"]
    #[doc = "                  and setup, for example through mbedtls_ecp_gen_privkey()."]
    #[doc = " \\param buf       The hashed content to be signed. This must be a readable"]
    #[doc = "                  buffer of length \\p blen Bytes. It may be \\c NULL if"]
    #[doc = "                  \\p blen is zero."]
    #[doc = " \\param blen      The length of \\p buf in Bytes."]
    #[doc = " \\param md_alg    The hash algorithm used to hash the original data."]
    #[doc = ""]
    #[doc = " \\return          \\c 0 on success."]
    #[doc = " \\return          An \\c MBEDTLS_ERR_ECP_XXX or \\c MBEDTLS_MPI_XXX"]
    #[doc = "                  error code on failure."]
    #[link_name = "\u{1}mbedtls_ecdsa_sign_det"]
    pub fn ecdsa_sign_det(
        grp: *mut ecp_group,
        r: *mut mpi,
        s: *mut mpi,
        d: *const mpi,
        buf: *const crate::types::c_uchar,
        blen: usize,
        md_alg: md_type_t,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief           This function computes the ECDSA signature of a"]
    #[doc = "                  previously-hashed message, deterministic version."]
    #[doc = ""]
    #[doc = "                  For more information, see <em>RFC-6979: Deterministic"]
    #[doc = "                  Usage of the Digital Signature Algorithm (DSA) and Elliptic"]
    #[doc = "                  Curve Digital Signature Algorithm (ECDSA)</em>."]
    #[doc = ""]
    #[doc = " \\note            If the bitlength of the message hash is larger than the"]
    #[doc = "                  bitlength of the group order, then the hash is truncated as"]
    #[doc = "                  defined in <em>Standards for Efficient Cryptography Group"]
    #[doc = "                  (SECG): SEC1 Elliptic Curve Cryptography</em>, section"]
    #[doc = "                  4.1.3, step 5."]
    #[doc = ""]
    #[doc = " \\see             ecp.h"]
    #[doc = ""]
    #[doc = " \\param grp           The context for the elliptic curve to use."]
    #[doc = "                      This must be initialized and have group parameters"]
    #[doc = "                      set, for example through mbedtls_ecp_group_load()."]
    #[doc = " \\param r             The MPI context in which to store the first part"]
    #[doc = "                      the signature. This must be initialized."]
    #[doc = " \\param s             The MPI context in which to store the second part"]
    #[doc = "                      the signature. This must be initialized."]
    #[doc = " \\param d             The private signing key. This must be initialized"]
    #[doc = "                      and setup, for example through mbedtls_ecp_gen_privkey()."]
    #[doc = " \\param buf           The hashed content to be signed. This must be a readable"]
    #[doc = "                      buffer of length \\p blen Bytes. It may be \\c NULL if"]
    #[doc = "                      \\p blen is zero."]
    #[doc = " \\param blen          The length of \\p buf in Bytes."]
    #[doc = " \\param md_alg        The hash algorithm used to hash the original data."]
    #[doc = " \\param f_rng_blind   The RNG function used for blinding. This must not be"]
    #[doc = "                      \\c NULL."]
    #[doc = " \\param p_rng_blind   The RNG context to be passed to \\p f_rng. This may be"]
    #[doc = "                      \\c NULL if \\p f_rng doesn't need a context parameter."]
    #[doc = ""]
    #[doc = " \\return          \\c 0 on success."]
    #[doc = " \\return          An \\c MBEDTLS_ERR_ECP_XXX or \\c MBEDTLS_MPI_XXX"]
    #[doc = "                  error code on failure."]
    #[link_name = "\u{1}mbedtls_ecdsa_sign_det_ext"]
    pub fn ecdsa_sign_det_ext(
        grp: *mut ecp_group,
        r: *mut mpi,
        s: *mut mpi,
        d: *const mpi,
        buf: *const crate::types::c_uchar,
        blen: usize,
        md_alg: md_type_t,
        f_rng_blind: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut crate::types::c_void,
                arg2: *mut crate::types::c_uchar,
                arg3: usize,
            ) -> crate::types::c_int,
        >,
        p_rng_blind: *mut crate::types::c_void,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief           This function verifies the ECDSA signature of a"]
    #[doc = "                  previously-hashed message."]
    #[doc = ""]
    #[doc = " \\note            If the bitlength of the message hash is larger than the"]
    #[doc = "                  bitlength of the group order, then the hash is truncated as"]
    #[doc = "                  defined in <em>Standards for Efficient Cryptography Group"]
    #[doc = "                  (SECG): SEC1 Elliptic Curve Cryptography</em>, section"]
    #[doc = "                  4.1.4, step 3."]
    #[doc = ""]
    #[doc = " \\see             ecp.h"]
    #[doc = ""]
    #[doc = " \\param grp       The ECP group to use."]
    #[doc = "                  This must be initialized and have group parameters"]
    #[doc = "                  set, for example through mbedtls_ecp_group_load()."]
    #[doc = " \\param buf       The hashed content that was signed. This must be a readable"]
    #[doc = "                  buffer of length \\p blen Bytes. It may be \\c NULL if"]
    #[doc = "                  \\p blen is zero."]
    #[doc = " \\param blen      The length of \\p buf in Bytes."]
    #[doc = " \\param Q         The public key to use for verification. This must be"]
    #[doc = "                  initialized and setup."]
    #[doc = " \\param r         The first integer of the signature."]
    #[doc = "                  This must be initialized."]
    #[doc = " \\param s         The second integer of the signature."]
    #[doc = "                  This must be initialized."]
    #[doc = ""]
    #[doc = " \\return          \\c 0 on success."]
    #[doc = " \\return          #MBEDTLS_ERR_ECP_BAD_INPUT_DATA if the signature"]
    #[doc = "                  is invalid."]
    #[doc = " \\return          An \\c MBEDTLS_ERR_ECP_XXX or \\c MBEDTLS_MPI_XXX"]
    #[doc = "                  error code on failure for any other reason."]
    #[link_name = "\u{1}mbedtls_ecdsa_verify"]
    pub fn ecdsa_verify(
        grp: *mut ecp_group,
        buf: *const crate::types::c_uchar,
        blen: usize,
        Q: *const ecp_point,
        r: *const mpi,
        s: *const mpi,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief           This function computes the ECDSA signature and writes it"]
    #[doc = "                  to a buffer, serialized as defined in <em>RFC-4492:"]
    #[doc = "                  Elliptic Curve Cryptography (ECC) Cipher Suites for"]
    #[doc = "                  Transport Layer Security (TLS)</em>."]
    #[doc = ""]
    #[doc = " \\warning         It is not thread-safe to use the same context in"]
    #[doc = "                  multiple threads."]
    #[doc = ""]
    #[doc = " \\note            The deterministic version is used if"]
    #[doc = "                  #MBEDTLS_ECDSA_DETERMINISTIC is defined. For more"]
    #[doc = "                  information, see <em>RFC-6979: Deterministic Usage"]
    #[doc = "                  of the Digital Signature Algorithm (DSA) and Elliptic"]
    #[doc = "                  Curve Digital Signature Algorithm (ECDSA)</em>."]
    #[doc = ""]
    #[doc = " \\note            If the bitlength of the message hash is larger than the"]
    #[doc = "                  bitlength of the group order, then the hash is truncated as"]
    #[doc = "                  defined in <em>Standards for Efficient Cryptography Group"]
    #[doc = "                  (SECG): SEC1 Elliptic Curve Cryptography</em>, section"]
    #[doc = "                  4.1.3, step 5."]
    #[doc = ""]
    #[doc = " \\see             ecp.h"]
    #[doc = ""]
    #[doc = " \\param ctx       The ECDSA context to use. This must be initialized"]
    #[doc = "                  and have a group and private key bound to it, for example"]
    #[doc = "                  via mbedtls_ecdsa_genkey() or mbedtls_ecdsa_from_keypair()."]
    #[doc = " \\param md_alg    The message digest that was used to hash the message."]
    #[doc = " \\param hash      The message hash to be signed. This must be a readable"]
    #[doc = "                  buffer of length \\p blen Bytes."]
    #[doc = " \\param hlen      The length of the hash \\p hash in Bytes."]
    #[doc = " \\param sig       The buffer to which to write the signature. This must be a"]
    #[doc = "                  writable buffer of length at least twice as large as the"]
    #[doc = "                  size of the curve used, plus 9. For example, 73 Bytes if"]
    #[doc = "                  a 256-bit curve is used. A buffer length of"]
    #[doc = "                  #MBEDTLS_ECDSA_MAX_LEN is always safe."]
    #[doc = " \\param slen      The address at which to store the actual length of"]
    #[doc = "                  the signature written. Must not be \\c NULL."]
    #[doc = " \\param f_rng     The RNG function. This must not be \\c NULL if"]
    #[doc = "                  #MBEDTLS_ECDSA_DETERMINISTIC is unset. Otherwise,"]
    #[doc = "                  it is used only for blinding and may be set to \\c NULL, but"]
    #[doc = "                  doing so is DEPRECATED."]
    #[doc = " \\param p_rng     The RNG context to be passed to \\p f_rng. This may be"]
    #[doc = "                  \\c NULL if \\p f_rng is \\c NULL or doesn't use a context."]
    #[doc = ""]
    #[doc = " \\return          \\c 0 on success."]
    #[doc = " \\return          An \\c MBEDTLS_ERR_ECP_XXX, \\c MBEDTLS_ERR_MPI_XXX or"]
    #[doc = "                  \\c MBEDTLS_ERR_ASN1_XXX error code on failure."]
    #[link_name = "\u{1}mbedtls_ecdsa_write_signature"]
    pub fn ecdsa_write_signature(
        ctx: *mut ecdsa_context,
        md_alg: md_type_t,
        hash: *const crate::types::c_uchar,
        hlen: usize,
        sig: *mut crate::types::c_uchar,
        slen: *mut usize,
        f_rng: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut crate::types::c_void,
                arg2: *mut crate::types::c_uchar,
                arg3: usize,
            ) -> crate::types::c_int,
        >,
        p_rng: *mut crate::types::c_void,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief           This function computes the ECDSA signature and writes it"]
    #[doc = "                  to a buffer, in a restartable way."]
    #[doc = ""]
    #[doc = " \\see             \\c mbedtls_ecdsa_write_signature()"]
    #[doc = ""]
    #[doc = " \\note            This function is like \\c mbedtls_ecdsa_write_signature()"]
    #[doc = "                  but it can return early and restart according to the limit"]
    #[doc = "                  set with \\c mbedtls_ecp_set_max_ops() to reduce blocking."]
    #[doc = ""]
    #[doc = " \\param ctx       The ECDSA context to use. This must be initialized"]
    #[doc = "                  and have a group and private key bound to it, for example"]
    #[doc = "                  via mbedtls_ecdsa_genkey() or mbedtls_ecdsa_from_keypair()."]
    #[doc = " \\param md_alg    The message digest that was used to hash the message."]
    #[doc = " \\param hash      The message hash to be signed. This must be a readable"]
    #[doc = "                  buffer of length \\p blen Bytes."]
    #[doc = " \\param hlen      The length of the hash \\p hash in Bytes."]
    #[doc = " \\param sig       The buffer to which to write the signature. This must be a"]
    #[doc = "                  writable buffer of length at least twice as large as the"]
    #[doc = "                  size of the curve used, plus 9. For example, 73 Bytes if"]
    #[doc = "                  a 256-bit curve is used. A buffer length of"]
    #[doc = "                  #MBEDTLS_ECDSA_MAX_LEN is always safe."]
    #[doc = " \\param slen      The address at which to store the actual length of"]
    #[doc = "                  the signature written. Must not be \\c NULL."]
    #[doc = " \\param f_rng     The RNG function. This must not be \\c NULL if"]
    #[doc = "                  #MBEDTLS_ECDSA_DETERMINISTIC is unset. Otherwise,"]
    #[doc = "                  it is unused and may be set to \\c NULL."]
    #[doc = " \\param p_rng     The RNG context to be passed to \\p f_rng. This may be"]
    #[doc = "                  \\c NULL if \\p f_rng is \\c NULL or doesn't use a context."]
    #[doc = " \\param rs_ctx    The restart context to use. This may be \\c NULL to disable"]
    #[doc = "                  restarting. If it is not \\c NULL, it must point to an"]
    #[doc = "                  initialized restart context."]
    #[doc = ""]
    #[doc = " \\return          \\c 0 on success."]
    #[doc = " \\return          #MBEDTLS_ERR_ECP_IN_PROGRESS if maximum number of"]
    #[doc = "                  operations was reached: see \\c mbedtls_ecp_set_max_ops()."]
    #[doc = " \\return          Another \\c MBEDTLS_ERR_ECP_XXX, \\c MBEDTLS_ERR_MPI_XXX or"]
    #[doc = "                  \\c MBEDTLS_ERR_ASN1_XXX error code on failure."]
    #[link_name = "\u{1}mbedtls_ecdsa_write_signature_restartable"]
    pub fn ecdsa_write_signature_restartable(
        ctx: *mut ecdsa_context,
        md_alg: md_type_t,
        hash: *const crate::types::c_uchar,
        hlen: usize,
        sig: *mut crate::types::c_uchar,
        slen: *mut usize,
        f_rng: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut crate::types::c_void,
                arg2: *mut crate::types::c_uchar,
                arg3: usize,
            ) -> crate::types::c_int,
        >,
        p_rng: *mut crate::types::c_void,
        rs_ctx: *mut ecdsa_restart_ctx,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief           This function computes an ECDSA signature and writes"]
    #[doc = "                  it to a buffer, serialized as defined in <em>RFC-4492:"]
    #[doc = "                  Elliptic Curve Cryptography (ECC) Cipher Suites for"]
    #[doc = "                  Transport Layer Security (TLS)</em>."]
    #[doc = ""]
    #[doc = "                  The deterministic version is defined in <em>RFC-6979:"]
    #[doc = "                  Deterministic Usage of the Digital Signature Algorithm (DSA)"]
    #[doc = "                  and Elliptic Curve Digital Signature Algorithm (ECDSA)</em>."]
    #[doc = ""]
    #[doc = " \\warning         It is not thread-safe to use the same context in"]
    #[doc = "                  multiple threads."]
    #[doc = ""]
    #[doc = " \\note            If the bitlength of the message hash is larger than the"]
    #[doc = "                  bitlength of the group order, then the hash is truncated as"]
    #[doc = "                  defined in <em>Standards for Efficient Cryptography Group"]
    #[doc = "                  (SECG): SEC1 Elliptic Curve Cryptography</em>, section"]
    #[doc = "                  4.1.3, step 5."]
    #[doc = ""]
    #[doc = " \\see             ecp.h"]
    #[doc = ""]
    #[doc = " \\deprecated      Superseded by mbedtls_ecdsa_write_signature() in"]
    #[doc = "                  Mbed TLS version 2.0 and later."]
    #[doc = ""]
    #[doc = " \\param ctx       The ECDSA context to use. This must be initialized"]
    #[doc = "                  and have a group and private key bound to it, for example"]
    #[doc = "                  via mbedtls_ecdsa_genkey() or mbedtls_ecdsa_from_keypair()."]
    #[doc = " \\param hash      The message hash to be signed. This must be a readable"]
    #[doc = "                  buffer of length \\p blen Bytes."]
    #[doc = " \\param hlen      The length of the hash \\p hash in Bytes."]
    #[doc = " \\param sig       The buffer to which to write the signature. This must be a"]
    #[doc = "                  writable buffer of length at least twice as large as the"]
    #[doc = "                  size of the curve used, plus 9. For example, 73 Bytes if"]
    #[doc = "                  a 256-bit curve is used. A buffer length of"]
    #[doc = "                  #MBEDTLS_ECDSA_MAX_LEN is always safe."]
    #[doc = " \\param slen      The address at which to store the actual length of"]
    #[doc = "                  the signature written. Must not be \\c NULL."]
    #[doc = " \\param md_alg    The message digest that was used to hash the message."]
    #[doc = ""]
    #[doc = " \\return          \\c 0 on success."]
    #[doc = " \\return          An \\c MBEDTLS_ERR_ECP_XXX, \\c MBEDTLS_ERR_MPI_XXX or"]
    #[doc = "                  \\c MBEDTLS_ERR_ASN1_XXX error code on failure."]
    #[link_name = "\u{1}mbedtls_ecdsa_write_signature_det"]
    pub fn ecdsa_write_signature_det(
        ctx: *mut ecdsa_context,
        hash: *const crate::types::c_uchar,
        hlen: usize,
        sig: *mut crate::types::c_uchar,
        slen: *mut usize,
        md_alg: md_type_t,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief           This function reads and verifies an ECDSA signature."]
    #[doc = ""]
    #[doc = " \\note            If the bitlength of the message hash is larger than the"]
    #[doc = "                  bitlength of the group order, then the hash is truncated as"]
    #[doc = "                  defined in <em>Standards for Efficient Cryptography Group"]
    #[doc = "                  (SECG): SEC1 Elliptic Curve Cryptography</em>, section"]
    #[doc = "                  4.1.4, step 3."]
    #[doc = ""]
    #[doc = " \\see             ecp.h"]
    #[doc = ""]
    #[doc = " \\param ctx       The ECDSA context to use. This must be initialized"]
    #[doc = "                  and have a group and public key bound to it."]
    #[doc = " \\param hash      The message hash that was signed. This must be a readable"]
    #[doc = "                  buffer of length \\p size Bytes."]
    #[doc = " \\param hlen      The size of the hash \\p hash."]
    #[doc = " \\param sig       The signature to read and verify. This must be a readable"]
    #[doc = "                  buffer of length \\p slen Bytes."]
    #[doc = " \\param slen      The size of \\p sig in Bytes."]
    #[doc = ""]
    #[doc = " \\return          \\c 0 on success."]
    #[doc = " \\return          #MBEDTLS_ERR_ECP_BAD_INPUT_DATA if signature is invalid."]
    #[doc = " \\return          #MBEDTLS_ERR_ECP_SIG_LEN_MISMATCH if there is a valid"]
    #[doc = "                  signature in \\p sig, but its length is less than \\p siglen."]
    #[doc = " \\return          An \\c MBEDTLS_ERR_ECP_XXX or \\c MBEDTLS_ERR_MPI_XXX"]
    #[doc = "                  error code on failure for any other reason."]
    #[link_name = "\u{1}mbedtls_ecdsa_read_signature"]
    pub fn ecdsa_read_signature(
        ctx: *mut ecdsa_context,
        hash: *const crate::types::c_uchar,
        hlen: usize,
        sig: *const crate::types::c_uchar,
        slen: usize,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief           This function reads and verifies an ECDSA signature,"]
    #[doc = "                  in a restartable way."]
    #[doc = ""]
    #[doc = " \\see             \\c mbedtls_ecdsa_read_signature()"]
    #[doc = ""]
    #[doc = " \\note            This function is like \\c mbedtls_ecdsa_read_signature()"]
    #[doc = "                  but it can return early and restart according to the limit"]
    #[doc = "                  set with \\c mbedtls_ecp_set_max_ops() to reduce blocking."]
    #[doc = ""]
    #[doc = " \\param ctx       The ECDSA context to use. This must be initialized"]
    #[doc = "                  and have a group and public key bound to it."]
    #[doc = " \\param hash      The message hash that was signed. This must be a readable"]
    #[doc = "                  buffer of length \\p size Bytes."]
    #[doc = " \\param hlen      The size of the hash \\p hash."]
    #[doc = " \\param sig       The signature to read and verify. This must be a readable"]
    #[doc = "                  buffer of length \\p slen Bytes."]
    #[doc = " \\param slen      The size of \\p sig in Bytes."]
    #[doc = " \\param rs_ctx    The restart context to use. This may be \\c NULL to disable"]
    #[doc = "                  restarting. If it is not \\c NULL, it must point to an"]
    #[doc = "                  initialized restart context."]
    #[doc = ""]
    #[doc = " \\return          \\c 0 on success."]
    #[doc = " \\return          #MBEDTLS_ERR_ECP_BAD_INPUT_DATA if signature is invalid."]
    #[doc = " \\return          #MBEDTLS_ERR_ECP_SIG_LEN_MISMATCH if there is a valid"]
    #[doc = "                  signature in \\p sig, but its length is less than \\p siglen."]
    #[doc = " \\return          #MBEDTLS_ERR_ECP_IN_PROGRESS if maximum number of"]
    #[doc = "                  operations was reached: see \\c mbedtls_ecp_set_max_ops()."]
    #[doc = " \\return          Another \\c MBEDTLS_ERR_ECP_XXX or \\c MBEDTLS_ERR_MPI_XXX"]
    #[doc = "                  error code on failure for any other reason."]
    #[link_name = "\u{1}mbedtls_ecdsa_read_signature_restartable"]
    pub fn ecdsa_read_signature_restartable(
        ctx: *mut ecdsa_context,
        hash: *const crate::types::c_uchar,
        hlen: usize,
        sig: *const crate::types::c_uchar,
        slen: usize,
        rs_ctx: *mut ecdsa_restart_ctx,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief          This function generates an ECDSA keypair on the given curve."]
    #[doc = ""]
    #[doc = " \\see            ecp.h"]
    #[doc = ""]
    #[doc = " \\param ctx      The ECDSA context to store the keypair in."]
    #[doc = "                 This must be initialized."]
    #[doc = " \\param gid      The elliptic curve to use. One of the various"]
    #[doc = "                 \\c MBEDTLS_ECP_DP_XXX macros depending on configuration."]
    #[doc = " \\param f_rng    The RNG function to use. This must not be \\c NULL."]
    #[doc = " \\param p_rng    The RNG context to be passed to \\p f_rng. This may be"]
    #[doc = "                 \\c NULL if \\p f_rng doesn't need a context argument."]
    #[doc = ""]
    #[doc = " \\return         \\c 0 on success."]
    #[doc = " \\return         An \\c MBEDTLS_ERR_ECP_XXX code on failure."]
    #[link_name = "\u{1}mbedtls_ecdsa_genkey"]
    pub fn ecdsa_genkey(
        ctx: *mut ecdsa_context,
        gid: ecp_group_id,
        f_rng: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut crate::types::c_void,
                arg2: *mut crate::types::c_uchar,
                arg3: usize,
            ) -> crate::types::c_int,
        >,
        p_rng: *mut crate::types::c_void,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief           This function sets up an ECDSA context from an EC key pair."]
    #[doc = ""]
    #[doc = " \\see             ecp.h"]
    #[doc = ""]
    #[doc = " \\param ctx       The ECDSA context to setup. This must be initialized."]
    #[doc = " \\param key       The EC key to use. This must be initialized and hold"]
    #[doc = "                  a private-public key pair or a public key. In the former"]
    #[doc = "                  case, the ECDSA context may be used for signature creation"]
    #[doc = "                  and verification after this call. In the latter case, it"]
    #[doc = "                  may be used for signature verification."]
    #[doc = ""]
    #[doc = " \\return          \\c 0 on success."]
    #[doc = " \\return          An \\c MBEDTLS_ERR_ECP_XXX code on failure."]
    #[link_name = "\u{1}mbedtls_ecdsa_from_keypair"]
    pub fn ecdsa_from_keypair(
        ctx: *mut ecdsa_context,
        key: *const ecp_keypair,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief           This function initializes an ECDSA context."]
    #[doc = ""]
    #[doc = " \\param ctx       The ECDSA context to initialize."]
    #[doc = "                  This must not be \\c NULL."]
    #[link_name = "\u{1}mbedtls_ecdsa_init"]
    pub fn ecdsa_init(ctx: *mut ecdsa_context);
}
extern "C" {
    #[doc = " \\brief           This function frees an ECDSA context."]
    #[doc = ""]
    #[doc = " \\param ctx       The ECDSA context to free. This may be \\c NULL,"]
    #[doc = "                  in which case this function does nothing. If it"]
    #[doc = "                  is not \\c NULL, it must be initialized."]
    #[link_name = "\u{1}mbedtls_ecdsa_free"]
    pub fn ecdsa_free(ctx: *mut ecdsa_context);
}
#[repr(u32)]
#[doc = " Defines the source of the imported EC key."]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum ecdh_side {
    #[doc = "< Our key."]
    ECDH_OURS = 0,
    #[doc = "< The key of the peer."]
    ECDH_THEIRS = 1,
}
#[doc = " \\warning         Performing multiple operations concurrently on the same"]
#[doc = "                  ECDSA context is not supported; objects of this type"]
#[doc = "                  should not be shared between multiple threads."]
#[doc = " \\brief           The ECDH context structure."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ecdh_context {
    #[doc = "< The elliptic curve used."]
    pub grp: ecp_group,
    #[doc = "< The private key."]
    pub d: mpi,
    #[doc = "< The public key."]
    pub Q: ecp_point,
    #[doc = "< The value of the public key of the peer."]
    pub Qp: ecp_point,
    #[doc = "< The shared secret."]
    pub z: mpi,
    #[doc = "< The format of point export in TLS messages."]
    pub point_format: crate::types::c_int,
    #[doc = "< The blinding value."]
    pub Vi: ecp_point,
    #[doc = "< The unblinding value."]
    pub Vf: ecp_point,
    #[doc = "< The previous \\p d."]
    pub _d: mpi,
}
#[test]
fn bindgen_test_layout_ecdh_context() {
    assert_eq!(
        ::core::mem::size_of::<ecdh_context>(),
        308usize,
        concat!("Size of: ", stringify!(ecdh_context))
    );
    assert_eq!(
        ::core::mem::align_of::<ecdh_context>(),
        4usize,
        concat!("Alignment of ", stringify!(ecdh_context))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ecdh_context>())).grp as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ecdh_context),
            "::",
            stringify!(grp)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ecdh_context>())).d as *const _ as usize },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(ecdh_context),
            "::",
            stringify!(d)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ecdh_context>())).Q as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(ecdh_context),
            "::",
            stringify!(Q)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ecdh_context>())).Qp as *const _ as usize },
        172usize,
        concat!(
            "Offset of field: ",
            stringify!(ecdh_context),
            "::",
            stringify!(Qp)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ecdh_context>())).z as *const _ as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(ecdh_context),
            "::",
            stringify!(z)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ecdh_context>())).point_format as *const _ as usize },
        220usize,
        concat!(
            "Offset of field: ",
            stringify!(ecdh_context),
            "::",
            stringify!(point_format)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ecdh_context>())).Vi as *const _ as usize },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(ecdh_context),
            "::",
            stringify!(Vi)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ecdh_context>())).Vf as *const _ as usize },
        260usize,
        concat!(
            "Offset of field: ",
            stringify!(ecdh_context),
            "::",
            stringify!(Vf)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ecdh_context>()))._d as *const _ as usize },
        296usize,
        concat!(
            "Offset of field: ",
            stringify!(ecdh_context),
            "::",
            stringify!(_d)
        )
    );
}
impl Default for ecdh_context {
    fn default() -> Self {
        unsafe { ::core::mem::zeroed() }
    }
}
extern "C" {
    #[doc = " \\brief          Check whether a given group can be used for ECDH."]
    #[doc = ""]
    #[doc = " \\param gid      The ECP group ID to check."]
    #[doc = ""]
    #[doc = " \\return         \\c 1 if the group can be used, \\c 0 otherwise"]
    #[link_name = "\u{1}mbedtls_ecdh_can_do"]
    pub fn ecdh_can_do(gid: ecp_group_id) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief           This function generates an ECDH keypair on an elliptic"]
    #[doc = "                  curve."]
    #[doc = ""]
    #[doc = "                  This function performs the first of two core computations"]
    #[doc = "                  implemented during the ECDH key exchange. The second core"]
    #[doc = "                  computation is performed by mbedtls_ecdh_compute_shared()."]
    #[doc = ""]
    #[doc = " \\see             ecp.h"]
    #[doc = ""]
    #[doc = " \\param grp       The ECP group to use. This must be initialized and have"]
    #[doc = "                  domain parameters loaded, for example through"]
    #[doc = "                  mbedtls_ecp_load() or mbedtls_ecp_tls_read_group()."]
    #[doc = " \\param d         The destination MPI (private key)."]
    #[doc = "                  This must be initialized."]
    #[doc = " \\param Q         The destination point (public key)."]
    #[doc = "                  This must be initialized."]
    #[doc = " \\param f_rng     The RNG function to use. This must not be \\c NULL."]
    #[doc = " \\param p_rng     The RNG context to be passed to \\p f_rng. This may be"]
    #[doc = "                  \\c NULL in case \\p f_rng doesn't need a context argument."]
    #[doc = ""]
    #[doc = " \\return          \\c 0 on success."]
    #[doc = " \\return          Another \\c MBEDTLS_ERR_ECP_XXX or"]
    #[doc = "                  \\c MBEDTLS_MPI_XXX error code on failure."]
    #[link_name = "\u{1}mbedtls_ecdh_gen_public"]
    pub fn ecdh_gen_public(
        grp: *mut ecp_group,
        d: *mut mpi,
        Q: *mut ecp_point,
        f_rng: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut crate::types::c_void,
                arg2: *mut crate::types::c_uchar,
                arg3: usize,
            ) -> crate::types::c_int,
        >,
        p_rng: *mut crate::types::c_void,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief           This function computes the shared secret."]
    #[doc = ""]
    #[doc = "                  This function performs the second of two core computations"]
    #[doc = "                  implemented during the ECDH key exchange. The first core"]
    #[doc = "                  computation is performed by mbedtls_ecdh_gen_public()."]
    #[doc = ""]
    #[doc = " \\see             ecp.h"]
    #[doc = ""]
    #[doc = " \\note            If \\p f_rng is not NULL, it is used to implement"]
    #[doc = "                  countermeasures against side-channel attacks."]
    #[doc = "                  For more information, see mbedtls_ecp_mul()."]
    #[doc = ""]
    #[doc = " \\param grp       The ECP group to use. This must be initialized and have"]
    #[doc = "                  domain parameters loaded, for example through"]
    #[doc = "                  mbedtls_ecp_load() or mbedtls_ecp_tls_read_group()."]
    #[doc = " \\param z         The destination MPI (shared secret)."]
    #[doc = "                  This must be initialized."]
    #[doc = " \\param Q         The public key from another party."]
    #[doc = "                  This must be initialized."]
    #[doc = " \\param d         Our secret exponent (private key)."]
    #[doc = "                  This must be initialized."]
    #[doc = " \\param f_rng     The RNG function. This may be \\c NULL if randomization"]
    #[doc = "                  of intermediate results during the ECP computations is"]
    #[doc = "                  not needed (discouraged). See the documentation of"]
    #[doc = "                  mbedtls_ecp_mul() for more."]
    #[doc = " \\param p_rng     The RNG context to be passed to \\p f_rng. This may be"]
    #[doc = "                  \\c NULL if \\p f_rng is \\c NULL or doesn't need a"]
    #[doc = "                  context argument."]
    #[doc = ""]
    #[doc = " \\return          \\c 0 on success."]
    #[doc = " \\return          Another \\c MBEDTLS_ERR_ECP_XXX or"]
    #[doc = "                  \\c MBEDTLS_MPI_XXX error code on failure."]
    #[link_name = "\u{1}mbedtls_ecdh_compute_shared"]
    pub fn ecdh_compute_shared(
        grp: *mut ecp_group,
        z: *mut mpi,
        Q: *const ecp_point,
        d: *const mpi,
        f_rng: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut crate::types::c_void,
                arg2: *mut crate::types::c_uchar,
                arg3: usize,
            ) -> crate::types::c_int,
        >,
        p_rng: *mut crate::types::c_void,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief           This function initializes an ECDH context."]
    #[doc = ""]
    #[doc = " \\param ctx       The ECDH context to initialize. This must not be \\c NULL."]
    #[link_name = "\u{1}mbedtls_ecdh_init"]
    pub fn ecdh_init(ctx: *mut ecdh_context);
}
extern "C" {
    #[doc = " \\brief           This function sets up the ECDH context with the information"]
    #[doc = "                  given."]
    #[doc = ""]
    #[doc = "                  This function should be called after mbedtls_ecdh_init() but"]
    #[doc = "                  before mbedtls_ecdh_make_params(). There is no need to call"]
    #[doc = "                  this function before mbedtls_ecdh_read_params()."]
    #[doc = ""]
    #[doc = "                  This is the first function used by a TLS server for ECDHE"]
    #[doc = "                  ciphersuites."]
    #[doc = ""]
    #[doc = " \\param ctx       The ECDH context to set up. This must be initialized."]
    #[doc = " \\param grp_id    The group id of the group to set up the context for."]
    #[doc = ""]
    #[doc = " \\return          \\c 0 on success."]
    #[link_name = "\u{1}mbedtls_ecdh_setup"]
    pub fn ecdh_setup(ctx: *mut ecdh_context, grp_id: ecp_group_id) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief           This function frees a context."]
    #[doc = ""]
    #[doc = " \\param ctx       The context to free. This may be \\c NULL, in which"]
    #[doc = "                  case this function does nothing. If it is not \\c NULL,"]
    #[doc = "                  it must point to an initialized ECDH context."]
    #[link_name = "\u{1}mbedtls_ecdh_free"]
    pub fn ecdh_free(ctx: *mut ecdh_context);
}
extern "C" {
    #[doc = " \\brief           This function generates an EC key pair and exports its"]
    #[doc = "                  in the format used in a TLS ServerKeyExchange handshake"]
    #[doc = "                  message."]
    #[doc = ""]
    #[doc = "                  This is the second function used by a TLS server for ECDHE"]
    #[doc = "                  ciphersuites. (It is called after mbedtls_ecdh_setup().)"]
    #[doc = ""]
    #[doc = " \\see             ecp.h"]
    #[doc = ""]
    #[doc = " \\param ctx       The ECDH context to use. This must be initialized"]
    #[doc = "                  and bound to a group, for example via mbedtls_ecdh_setup()."]
    #[doc = " \\param olen      The address at which to store the number of Bytes written."]
    #[doc = " \\param buf       The destination buffer. This must be a writable buffer of"]
    #[doc = "                  length \\p blen Bytes."]
    #[doc = " \\param blen      The length of the destination buffer \\p buf in Bytes."]
    #[doc = " \\param f_rng     The RNG function to use. This must not be \\c NULL."]
    #[doc = " \\param p_rng     The RNG context to be passed to \\p f_rng. This may be"]
    #[doc = "                  \\c NULL in case \\p f_rng doesn't need a context argument."]
    #[doc = ""]
    #[doc = " \\return          \\c 0 on success."]
    #[doc = " \\return          #MBEDTLS_ERR_ECP_IN_PROGRESS if maximum number of"]
    #[doc = "                  operations was reached: see \\c mbedtls_ecp_set_max_ops()."]
    #[doc = " \\return          Another \\c MBEDTLS_ERR_ECP_XXX error code on failure."]
    #[link_name = "\u{1}mbedtls_ecdh_make_params"]
    pub fn ecdh_make_params(
        ctx: *mut ecdh_context,
        olen: *mut usize,
        buf: *mut crate::types::c_uchar,
        blen: usize,
        f_rng: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut crate::types::c_void,
                arg2: *mut crate::types::c_uchar,
                arg3: usize,
            ) -> crate::types::c_int,
        >,
        p_rng: *mut crate::types::c_void,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief           This function parses the ECDHE parameters in a"]
    #[doc = "                  TLS ServerKeyExchange handshake message."]
    #[doc = ""]
    #[doc = " \\note            In a TLS handshake, this is the how the client"]
    #[doc = "                  sets up its ECDHE context from the server's public"]
    #[doc = "                  ECDHE key material."]
    #[doc = ""]
    #[doc = " \\see             ecp.h"]
    #[doc = ""]
    #[doc = " \\param ctx       The ECDHE context to use. This must be initialized."]
    #[doc = " \\param buf       On input, \\c *buf must be the start of the input buffer."]
    #[doc = "                  On output, \\c *buf is updated to point to the end of the"]
    #[doc = "                  data that has been read. On success, this is the first byte"]
    #[doc = "                  past the end of the ServerKeyExchange parameters."]
    #[doc = "                  On error, this is the point at which an error has been"]
    #[doc = "                  detected, which is usually not useful except to debug"]
    #[doc = "                  failures."]
    #[doc = " \\param end       The end of the input buffer."]
    #[doc = ""]
    #[doc = " \\return          \\c 0 on success."]
    #[doc = " \\return          An \\c MBEDTLS_ERR_ECP_XXX error code on failure."]
    #[doc = ""]
    #[link_name = "\u{1}mbedtls_ecdh_read_params"]
    pub fn ecdh_read_params(
        ctx: *mut ecdh_context,
        buf: *mut *const crate::types::c_uchar,
        end: *const crate::types::c_uchar,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief           This function sets up an ECDH context from an EC key."]
    #[doc = ""]
    #[doc = "                  It is used by clients and servers in place of the"]
    #[doc = "                  ServerKeyEchange for static ECDH, and imports ECDH"]
    #[doc = "                  parameters from the EC key information of a certificate."]
    #[doc = ""]
    #[doc = " \\see             ecp.h"]
    #[doc = ""]
    #[doc = " \\param ctx       The ECDH context to set up. This must be initialized."]
    #[doc = " \\param key       The EC key to use. This must be initialized."]
    #[doc = " \\param side      Defines the source of the key. Possible values are:"]
    #[doc = "                  - #MBEDTLS_ECDH_OURS: The key is ours."]
    #[doc = "                  - #MBEDTLS_ECDH_THEIRS: The key is that of the peer."]
    #[doc = ""]
    #[doc = " \\return          \\c 0 on success."]
    #[doc = " \\return          Another \\c MBEDTLS_ERR_ECP_XXX error code on failure."]
    #[doc = ""]
    #[link_name = "\u{1}mbedtls_ecdh_get_params"]
    pub fn ecdh_get_params(
        ctx: *mut ecdh_context,
        key: *const ecp_keypair,
        side: ecdh_side,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief           This function generates a public key and exports it"]
    #[doc = "                  as a TLS ClientKeyExchange payload."]
    #[doc = ""]
    #[doc = "                  This is the second function used by a TLS client for ECDH(E)"]
    #[doc = "                  ciphersuites."]
    #[doc = ""]
    #[doc = " \\see             ecp.h"]
    #[doc = ""]
    #[doc = " \\param ctx       The ECDH context to use. This must be initialized"]
    #[doc = "                  and bound to a group, the latter usually by"]
    #[doc = "                  mbedtls_ecdh_read_params()."]
    #[doc = " \\param olen      The address at which to store the number of Bytes written."]
    #[doc = "                  This must not be \\c NULL."]
    #[doc = " \\param buf       The destination buffer. This must be a writable buffer"]
    #[doc = "                  of length \\p blen Bytes."]
    #[doc = " \\param blen      The size of the destination buffer \\p buf in Bytes."]
    #[doc = " \\param f_rng     The RNG function to use. This must not be \\c NULL."]
    #[doc = " \\param p_rng     The RNG context to be passed to \\p f_rng. This may be"]
    #[doc = "                  \\c NULL in case \\p f_rng doesn't need a context argument."]
    #[doc = ""]
    #[doc = " \\return          \\c 0 on success."]
    #[doc = " \\return          #MBEDTLS_ERR_ECP_IN_PROGRESS if maximum number of"]
    #[doc = "                  operations was reached: see \\c mbedtls_ecp_set_max_ops()."]
    #[doc = " \\return          Another \\c MBEDTLS_ERR_ECP_XXX error code on failure."]
    #[link_name = "\u{1}mbedtls_ecdh_make_public"]
    pub fn ecdh_make_public(
        ctx: *mut ecdh_context,
        olen: *mut usize,
        buf: *mut crate::types::c_uchar,
        blen: usize,
        f_rng: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut crate::types::c_void,
                arg2: *mut crate::types::c_uchar,
                arg3: usize,
            ) -> crate::types::c_int,
        >,
        p_rng: *mut crate::types::c_void,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief       This function parses and processes the ECDHE payload of a"]
    #[doc = "              TLS ClientKeyExchange message."]
    #[doc = ""]
    #[doc = "              This is the third function used by a TLS server for ECDH(E)"]
    #[doc = "              ciphersuites. (It is called after mbedtls_ecdh_setup() and"]
    #[doc = "              mbedtls_ecdh_make_params().)"]
    #[doc = ""]
    #[doc = " \\see         ecp.h"]
    #[doc = ""]
    #[doc = " \\param ctx   The ECDH context to use. This must be initialized"]
    #[doc = "              and bound to a group, for example via mbedtls_ecdh_setup()."]
    #[doc = " \\param buf   The pointer to the ClientKeyExchange payload. This must"]
    #[doc = "              be a readable buffer of length \\p blen Bytes."]
    #[doc = " \\param blen  The length of the input buffer \\p buf in Bytes."]
    #[doc = ""]
    #[doc = " \\return      \\c 0 on success."]
    #[doc = " \\return      An \\c MBEDTLS_ERR_ECP_XXX error code on failure."]
    #[link_name = "\u{1}mbedtls_ecdh_read_public"]
    pub fn ecdh_read_public(
        ctx: *mut ecdh_context,
        buf: *const crate::types::c_uchar,
        blen: usize,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief           This function derives and exports the shared secret."]
    #[doc = ""]
    #[doc = "                  This is the last function used by both TLS client"]
    #[doc = "                  and servers."]
    #[doc = ""]
    #[doc = " \\note            If \\p f_rng is not NULL, it is used to implement"]
    #[doc = "                  countermeasures against side-channel attacks."]
    #[doc = "                  For more information, see mbedtls_ecp_mul()."]
    #[doc = ""]
    #[doc = " \\see             ecp.h"]
    #[doc = ""]
    #[doc = " \\param ctx       The ECDH context to use. This must be initialized"]
    #[doc = "                  and have its own private key generated and the peer's"]
    #[doc = "                  public key imported."]
    #[doc = " \\param olen      The address at which to store the total number of"]
    #[doc = "                  Bytes written on success. This must not be \\c NULL."]
    #[doc = " \\param buf       The buffer to write the generated shared key to. This"]
    #[doc = "                  must be a writable buffer of size \\p blen Bytes."]
    #[doc = " \\param blen      The length of the destination buffer \\p buf in Bytes."]
    #[doc = " \\param f_rng     The RNG function, for blinding purposes. This may"]
    #[doc = "                  b \\c NULL if blinding isn't needed."]
    #[doc = " \\param p_rng     The RNG context. This may be \\c NULL if \\p f_rng"]
    #[doc = "                  doesn't need a context argument."]
    #[doc = ""]
    #[doc = " \\return          \\c 0 on success."]
    #[doc = " \\return          #MBEDTLS_ERR_ECP_IN_PROGRESS if maximum number of"]
    #[doc = "                  operations was reached: see \\c mbedtls_ecp_set_max_ops()."]
    #[doc = " \\return          Another \\c MBEDTLS_ERR_ECP_XXX error code on failure."]
    #[link_name = "\u{1}mbedtls_ecdh_calc_secret"]
    pub fn ecdh_calc_secret(
        ctx: *mut ecdh_context,
        olen: *mut usize,
        buf: *mut crate::types::c_uchar,
        blen: usize,
        f_rng: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut crate::types::c_void,
                arg2: *mut crate::types::c_uchar,
                arg3: usize,
            ) -> crate::types::c_int,
        >,
        p_rng: *mut crate::types::c_void,
    ) -> crate::types::c_int;
}
#[doc = " Type-length-value structure that allows for ASN1 using DER."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct asn1_buf {
    #[doc = "< ASN1 type, e.g. MBEDTLS_ASN1_UTF8_STRING."]
    pub tag: crate::types::c_int,
    #[doc = "< ASN1 length, in octets."]
    pub len: usize,
    #[doc = "< ASN1 data, e.g. in ASCII."]
    pub p: *mut crate::types::c_uchar,
}
#[test]
fn bindgen_test_layout_asn1_buf() {
    assert_eq!(
        ::core::mem::size_of::<asn1_buf>(),
        12usize,
        concat!("Size of: ", stringify!(asn1_buf))
    );
    assert_eq!(
        ::core::mem::align_of::<asn1_buf>(),
        4usize,
        concat!("Alignment of ", stringify!(asn1_buf))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<asn1_buf>())).tag as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(asn1_buf),
            "::",
            stringify!(tag)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<asn1_buf>())).len as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(asn1_buf),
            "::",
            stringify!(len)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<asn1_buf>())).p as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(asn1_buf),
            "::",
            stringify!(p)
        )
    );
}
impl Default for asn1_buf {
    fn default() -> Self {
        unsafe { ::core::mem::zeroed() }
    }
}
#[doc = " Container for ASN1 bit strings."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct asn1_bitstring {
    #[doc = "< ASN1 length, in octets."]
    pub len: usize,
    #[doc = "< Number of unused bits at the end of the string"]
    pub unused_bits: crate::types::c_uchar,
    #[doc = "< Raw ASN1 data for the bit string"]
    pub p: *mut crate::types::c_uchar,
}
#[test]
fn bindgen_test_layout_asn1_bitstring() {
    assert_eq!(
        ::core::mem::size_of::<asn1_bitstring>(),
        12usize,
        concat!("Size of: ", stringify!(asn1_bitstring))
    );
    assert_eq!(
        ::core::mem::align_of::<asn1_bitstring>(),
        4usize,
        concat!("Alignment of ", stringify!(asn1_bitstring))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<asn1_bitstring>())).len as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(asn1_bitstring),
            "::",
            stringify!(len)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<asn1_bitstring>())).unused_bits as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(asn1_bitstring),
            "::",
            stringify!(unused_bits)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<asn1_bitstring>())).p as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(asn1_bitstring),
            "::",
            stringify!(p)
        )
    );
}
impl Default for asn1_bitstring {
    fn default() -> Self {
        unsafe { ::core::mem::zeroed() }
    }
}
#[doc = " Container for a sequence of ASN.1 items"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct asn1_sequence {
    #[doc = "< Buffer containing the given ASN.1 item."]
    pub buf: asn1_buf,
    #[doc = "< The next entry in the sequence."]
    pub next: *mut asn1_sequence,
}
#[test]
fn bindgen_test_layout_asn1_sequence() {
    assert_eq!(
        ::core::mem::size_of::<asn1_sequence>(),
        16usize,
        concat!("Size of: ", stringify!(asn1_sequence))
    );
    assert_eq!(
        ::core::mem::align_of::<asn1_sequence>(),
        4usize,
        concat!("Alignment of ", stringify!(asn1_sequence))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<asn1_sequence>())).buf as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(asn1_sequence),
            "::",
            stringify!(buf)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<asn1_sequence>())).next as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(asn1_sequence),
            "::",
            stringify!(next)
        )
    );
}
impl Default for asn1_sequence {
    fn default() -> Self {
        unsafe { ::core::mem::zeroed() }
    }
}
#[doc = " Container for a sequence or list of 'named' ASN.1 data items"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct asn1_named_data {
    #[doc = "< The object identifier."]
    pub oid: asn1_buf,
    #[doc = "< The named value."]
    pub val: asn1_buf,
    #[doc = "< The next entry in the sequence."]
    pub next: *mut asn1_named_data,
    #[doc = "< Merge next item into the current one?"]
    pub next_merged: crate::types::c_uchar,
}
#[test]
fn bindgen_test_layout_asn1_named_data() {
    assert_eq!(
        ::core::mem::size_of::<asn1_named_data>(),
        32usize,
        concat!("Size of: ", stringify!(asn1_named_data))
    );
    assert_eq!(
        ::core::mem::align_of::<asn1_named_data>(),
        4usize,
        concat!("Alignment of ", stringify!(asn1_named_data))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<asn1_named_data>())).oid as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(asn1_named_data),
            "::",
            stringify!(oid)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<asn1_named_data>())).val as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(asn1_named_data),
            "::",
            stringify!(val)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<asn1_named_data>())).next as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(asn1_named_data),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<asn1_named_data>())).next_merged as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(asn1_named_data),
            "::",
            stringify!(next_merged)
        )
    );
}
impl Default for asn1_named_data {
    fn default() -> Self {
        unsafe { ::core::mem::zeroed() }
    }
}
extern "C" {
    #[doc = " \\brief       Get the length of an ASN.1 element."]
    #[doc = "              Updates the pointer to immediately behind the length."]
    #[doc = ""]
    #[doc = " \\param p     On entry, \\c *p points to the first byte of the length,"]
    #[doc = "              i.e. immediately after the tag."]
    #[doc = "              On successful completion, \\c *p points to the first byte"]
    #[doc = "              after the length, i.e. the first byte of the content."]
    #[doc = "              On error, the value of \\c *p is undefined."]
    #[doc = " \\param end   End of data."]
    #[doc = " \\param len   On successful completion, \\c *len contains the length"]
    #[doc = "              read from the ASN.1 input."]
    #[doc = ""]
    #[doc = " \\return      0 if successful."]
    #[doc = " \\return      #MBEDTLS_ERR_ASN1_OUT_OF_DATA if the ASN.1 element"]
    #[doc = "              would end beyond \\p end."]
    #[doc = " \\return      #MBEDTLS_ERR_ASN1_INVALID_LENGTH if the length is unparseable."]
    #[link_name = "\u{1}mbedtls_asn1_get_len"]
    pub fn asn1_get_len(
        p: *mut *mut crate::types::c_uchar,
        end: *const crate::types::c_uchar,
        len: *mut usize,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief       Get the tag and length of the element."]
    #[doc = "              Check for the requested tag."]
    #[doc = "              Updates the pointer to immediately behind the tag and length."]
    #[doc = ""]
    #[doc = " \\param p     On entry, \\c *p points to the start of the ASN.1 element."]
    #[doc = "              On successful completion, \\c *p points to the first byte"]
    #[doc = "              after the length, i.e. the first byte of the content."]
    #[doc = "              On error, the value of \\c *p is undefined."]
    #[doc = " \\param end   End of data."]
    #[doc = " \\param len   On successful completion, \\c *len contains the length"]
    #[doc = "              read from the ASN.1 input."]
    #[doc = " \\param tag   The expected tag."]
    #[doc = ""]
    #[doc = " \\return      0 if successful."]
    #[doc = " \\return      #MBEDTLS_ERR_ASN1_UNEXPECTED_TAG if the data does not start"]
    #[doc = "              with the requested tag."]
    #[doc = " \\return      #MBEDTLS_ERR_ASN1_OUT_OF_DATA if the ASN.1 element"]
    #[doc = "              would end beyond \\p end."]
    #[doc = " \\return      #MBEDTLS_ERR_ASN1_INVALID_LENGTH if the length is unparseable."]
    #[link_name = "\u{1}mbedtls_asn1_get_tag"]
    pub fn asn1_get_tag(
        p: *mut *mut crate::types::c_uchar,
        end: *const crate::types::c_uchar,
        len: *mut usize,
        tag: crate::types::c_int,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief       Retrieve a boolean ASN.1 tag and its value."]
    #[doc = "              Updates the pointer to immediately behind the full tag."]
    #[doc = ""]
    #[doc = " \\param p     On entry, \\c *p points to the start of the ASN.1 element."]
    #[doc = "              On successful completion, \\c *p points to the first byte"]
    #[doc = "              beyond the ASN.1 element."]
    #[doc = "              On error, the value of \\c *p is undefined."]
    #[doc = " \\param end   End of data."]
    #[doc = " \\param val   On success, the parsed value (\\c 0 or \\c 1)."]
    #[doc = ""]
    #[doc = " \\return      0 if successful."]
    #[doc = " \\return      An ASN.1 error code if the input does not start with"]
    #[doc = "              a valid ASN.1 BOOLEAN."]
    #[link_name = "\u{1}mbedtls_asn1_get_bool"]
    pub fn asn1_get_bool(
        p: *mut *mut crate::types::c_uchar,
        end: *const crate::types::c_uchar,
        val: *mut crate::types::c_int,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief       Retrieve an integer ASN.1 tag and its value."]
    #[doc = "              Updates the pointer to immediately behind the full tag."]
    #[doc = ""]
    #[doc = " \\param p     On entry, \\c *p points to the start of the ASN.1 element."]
    #[doc = "              On successful completion, \\c *p points to the first byte"]
    #[doc = "              beyond the ASN.1 element."]
    #[doc = "              On error, the value of \\c *p is undefined."]
    #[doc = " \\param end   End of data."]
    #[doc = " \\param val   On success, the parsed value."]
    #[doc = ""]
    #[doc = " \\return      0 if successful."]
    #[doc = " \\return      An ASN.1 error code if the input does not start with"]
    #[doc = "              a valid ASN.1 INTEGER."]
    #[doc = " \\return      #MBEDTLS_ERR_ASN1_INVALID_LENGTH if the parsed value does"]
    #[doc = "              not fit in an \\c int."]
    #[link_name = "\u{1}mbedtls_asn1_get_int"]
    pub fn asn1_get_int(
        p: *mut *mut crate::types::c_uchar,
        end: *const crate::types::c_uchar,
        val: *mut crate::types::c_int,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief       Retrieve an enumerated ASN.1 tag and its value."]
    #[doc = "              Updates the pointer to immediately behind the full tag."]
    #[doc = ""]
    #[doc = " \\param p     On entry, \\c *p points to the start of the ASN.1 element."]
    #[doc = "              On successful completion, \\c *p points to the first byte"]
    #[doc = "              beyond the ASN.1 element."]
    #[doc = "              On error, the value of \\c *p is undefined."]
    #[doc = " \\param end   End of data."]
    #[doc = " \\param val   On success, the parsed value."]
    #[doc = ""]
    #[doc = " \\return      0 if successful."]
    #[doc = " \\return      An ASN.1 error code if the input does not start with"]
    #[doc = "              a valid ASN.1 ENUMERATED."]
    #[doc = " \\return      #MBEDTLS_ERR_ASN1_INVALID_LENGTH if the parsed value does"]
    #[doc = "              not fit in an \\c int."]
    #[link_name = "\u{1}mbedtls_asn1_get_enum"]
    pub fn asn1_get_enum(
        p: *mut *mut crate::types::c_uchar,
        end: *const crate::types::c_uchar,
        val: *mut crate::types::c_int,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief       Retrieve a bitstring ASN.1 tag and its value."]
    #[doc = "              Updates the pointer to immediately behind the full tag."]
    #[doc = ""]
    #[doc = " \\param p     On entry, \\c *p points to the start of the ASN.1 element."]
    #[doc = "              On successful completion, \\c *p is equal to \\p end."]
    #[doc = "              On error, the value of \\c *p is undefined."]
    #[doc = " \\param end   End of data."]
    #[doc = " \\param bs    On success, ::mbedtls_asn1_bitstring information about"]
    #[doc = "              the parsed value."]
    #[doc = ""]
    #[doc = " \\return      0 if successful."]
    #[doc = " \\return      #MBEDTLS_ERR_ASN1_LENGTH_MISMATCH if the input contains"]
    #[doc = "              extra data after a valid BIT STRING."]
    #[doc = " \\return      An ASN.1 error code if the input does not start with"]
    #[doc = "              a valid ASN.1 BIT STRING."]
    #[link_name = "\u{1}mbedtls_asn1_get_bitstring"]
    pub fn asn1_get_bitstring(
        p: *mut *mut crate::types::c_uchar,
        end: *const crate::types::c_uchar,
        bs: *mut asn1_bitstring,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief       Retrieve a bitstring ASN.1 tag without unused bits and its"]
    #[doc = "              value."]
    #[doc = "              Updates the pointer to the beginning of the bit/octet string."]
    #[doc = ""]
    #[doc = " \\param p     On entry, \\c *p points to the start of the ASN.1 element."]
    #[doc = "              On successful completion, \\c *p points to the first byte"]
    #[doc = "              of the content of the BIT STRING."]
    #[doc = "              On error, the value of \\c *p is undefined."]
    #[doc = " \\param end   End of data."]
    #[doc = " \\param len   On success, \\c *len is the length of the content in bytes."]
    #[doc = ""]
    #[doc = " \\return      0 if successful."]
    #[doc = " \\return      #MBEDTLS_ERR_ASN1_INVALID_DATA if the input starts with"]
    #[doc = "              a valid BIT STRING with a nonzero number of unused bits."]
    #[doc = " \\return      An ASN.1 error code if the input does not start with"]
    #[doc = "              a valid ASN.1 BIT STRING."]
    #[link_name = "\u{1}mbedtls_asn1_get_bitstring_null"]
    pub fn asn1_get_bitstring_null(
        p: *mut *mut crate::types::c_uchar,
        end: *const crate::types::c_uchar,
        len: *mut usize,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief       Parses and splits an ASN.1 \"SEQUENCE OF <tag>\"."]
    #[doc = "              Updates the pointer to immediately behind the full sequence tag."]
    #[doc = ""]
    #[doc = " This function allocates memory for the sequence elements. You can free"]
    #[doc = " the allocated memory with mbedtls_asn1_sequence_free()."]
    #[doc = ""]
    #[doc = " \\note        On error, this function may return a partial list in \\p cur."]
    #[doc = "              You must set `cur->next = NULL` before calling this function!"]
    #[doc = "              Otherwise it is impossible to distinguish a previously non-null"]
    #[doc = "              pointer from a pointer to an object allocated by this function."]
    #[doc = ""]
    #[doc = " \\note        If the sequence is empty, this function does not modify"]
    #[doc = "              \\c *cur. If the sequence is valid and non-empty, this"]
    #[doc = "              function sets `cur->buf.tag` to \\p tag. This allows"]
    #[doc = "              callers to distinguish between an empty sequence and"]
    #[doc = "              a one-element sequence."]
    #[doc = ""]
    #[doc = " \\param p     On entry, \\c *p points to the start of the ASN.1 element."]
    #[doc = "              On successful completion, \\c *p is equal to \\p end."]
    #[doc = "              On error, the value of \\c *p is undefined."]
    #[doc = " \\param end   End of data."]
    #[doc = " \\param cur   A ::mbedtls_asn1_sequence which this function fills."]
    #[doc = "              When this function returns, \\c *cur is the head of a linked"]
    #[doc = "              list. Each node in this list is allocated with"]
    #[doc = "              mbedtls_calloc() apart from \\p cur itself, and should"]
    #[doc = "              therefore be freed with mbedtls_free()."]
    #[doc = "              The list describes the content of the sequence."]
    #[doc = "              The head of the list (i.e. \\c *cur itself) describes the"]
    #[doc = "              first element, `*cur->next` describes the second element, etc."]
    #[doc = "              For each element, `buf.tag == tag`, `buf.len` is the length"]
    #[doc = "              of the content of the content of the element, and `buf.p`"]
    #[doc = "              points to the first byte of the content (i.e. immediately"]
    #[doc = "              past the length of the element)."]
    #[doc = "              Note that list elements may be allocated even on error."]
    #[doc = " \\param tag   Each element of the sequence must have this tag."]
    #[doc = ""]
    #[doc = " \\return      0 if successful."]
    #[doc = " \\return      #MBEDTLS_ERR_ASN1_LENGTH_MISMATCH if the input contains"]
    #[doc = "              extra data after a valid SEQUENCE OF \\p tag."]
    #[doc = " \\return      #MBEDTLS_ERR_ASN1_UNEXPECTED_TAG if the input starts with"]
    #[doc = "              an ASN.1 SEQUENCE in which an element has a tag that"]
    #[doc = "              is different from \\p tag."]
    #[doc = " \\return      #MBEDTLS_ERR_ASN1_ALLOC_FAILED if a memory allocation failed."]
    #[doc = " \\return      An ASN.1 error code if the input does not start with"]
    #[doc = "              a valid ASN.1 SEQUENCE."]
    #[link_name = "\u{1}mbedtls_asn1_get_sequence_of"]
    pub fn asn1_get_sequence_of(
        p: *mut *mut crate::types::c_uchar,
        end: *const crate::types::c_uchar,
        cur: *mut asn1_sequence,
        tag: crate::types::c_int,
    ) -> crate::types::c_int;
}
extern "C" {
    #[doc = " \\brief          Free a heap-allocated linked list presentation of"]
    #[doc = "                 an ASN.1 sequence, including the first element."]
    #[doc = ""]
    #[doc = " There are two common ways to manage the memory used for the representation"]
    #[doc = " of a parsed ASN.1 sequence:"]
    #[doc = " - Allocate a head node `mbedtls_asn1_sequence *head` with mbedtls_calloc()."]
    #[doc = "   Pass this node as the `cur` argument to mbedtls_asn1_get_sequence_of()."]
    #[doc = "   When you have finished processing the sequence,"]
    #[doc = "   call mbedtls_asn1_sequence_free() on `head`."]
    #[doc = " - Allocate a head node `mbedtls_asn1_sequence *head` in any manner,"]
    #[doc = "   for example on the stack. Make sure that `head->next == NULL`."]
    #[doc = "   Pass `head` as the `cur` argument to mbedtls_asn1_get_sequence_of()."]
    #[doc = "   When you have finished processing the sequence,"]
    #[doc = "   call mbedtls_asn1_sequence_free() on `head->cur`,"]
    #[doc = "   then free `head` itself in the appropriate manner."]
    #[doc = ""]
    #[doc = " \\param seq      The address of the first sequence component. This may"]
    #[doc = "                 be \\c NULL, in which case this functions returns"]
